Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Create Your First Library
ar: أَنشِئ أول مكتبة لك

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
ar: تحوي المكتبات قَدْرًا من المكوِّنات التي يمكن إعادة استخدامها في عدّة مساقات. أنشئ مكتبتك الأولى بكبسة زرّ!

source: New to {studio_name}?
ar: هل أنت جديد في {studio_name}؟

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
ar: اضغط زر المساعدة في الزاوية العلوية اليمنى للحصول على مزيد من المساعدة المتعلقة بصفحة {studio_name} التي تراها الآن. كما يمكنك استخدام الروابط الموجودة في أسفل الصفحة لمراجعة وثائقنا المحدَّثة باستمرار ومصادر أخرى تتعلق بـ{studio_name}.

source: Getting Started with {studio_name}
ar: البدء باستخدام {studio_name}

source: Can I create courses in {studio_name}?
ar: هل يمكنني أن أنشئ مساقات في {studio_name}؟

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
ar: لتتمكّن من إنشاء مساقات في {studio_name}، عليك {link_start}الاتّصال بطاقم {platform_name} لمساعدتك على إنشاء مساق{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
ar: لتتمكّن من إنشاء مساقات في {studio_name}، يجب أن تتمتّع بصلاحيات منشئ مساق لإنشاء مساق خاص بك.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
ar: لقد رُفض طلبك لتأليف مساقات في {studio_name}. يُرجى {link_start}التواصل مع طاقم {platform_name} لمزيد من الاستفسارات{link_end}.

source: Thanks for signing up, {name}!
ar: شكرًا لك على التسجيل يا {name}!

source: We need to verify your email address
ar: نحتاج إلى التحقّق من عنوان بريدك الإلكتروني

source: Almost there! In order to complete your sign up we need you to verify your email address ({email}). An activation message and next steps should be waiting for you there.
ar: أوشكت على الانتهاء! نحتاج منك الى تأكيد عنوان بريدك الإلكتروني ({email}) لإتمام تسجيلك. ستجد رسالة التفعيل والخطوات التالية بانتظارك في بريدك.

source: Need help?
ar: هل تحتاج إلى مساعدة؟

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
ar: تحقّق من مجلّدات الرسائل غير المرغوب فيها، Junk أو Spam، في حال لم تجد رسالتنا في صندوق بريدك الوارد. ألم تتمكّن بعد من العثور على رسالة التأكيد؟ اطلب المساعدة إذًا عن طريق الرابط أدناه.

source: Content Library
ar: مكتبة المحتوى

source: Add Component
ar: أضِف مكوِّنًا

source: Adding content to your library
ar: تجري إضافة المحتوى إلى مكتبتك

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
ar: أضِف مكوِّنات إلى مكتبتك لاستخدامها في المساقات، وذلك من خلال خيار "أضِف مكوِّنًا جديدًا" في أسفل هذه الصفحة.

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
ar: تظهر المكونات مرتبة حسب تاريخ ووقت إضافتها، بحيث تكون الأحدث في آخر القائمة. استخدم أسهم التنقل بين الصفحات إذا كانت لديك أكثر من صفحة من المكونات في مكتبتك.

source: Using library content in courses
ar: استخدام محتوى المكتبة في مساقاتك

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
ar: استخدم محتوى المكتبات في المساقات بإضافة مفتاح سياسة محتوى المكتبة {em_start}library_content{em_end} إلى "قائمة الوحدات المتقدِّمة" في صفحة "الإعدادات المتقدِّمة" للمساق، ثمّ إضافة خاصّية "وحدة محتوى عشوائي" إلى مادتك التعليمية. وفي الإعدادات الخاصة بكل وحدة محتوى عشوائي، اختَر هذه المكتبة باعتبارها المكتبة المصدر، ثمّ حدِّد عدد المسائل التي سيتم انتقاؤها عشوائيًّا وعرضها على كل طالب.

source: Learn more about content libraries
ar: اعرف المزيد عن مكتبات المحتوى

source: Course Team Settings
ar: إعدادات فريق المساق

source: New Team Member
ar: عضو جديد في الفريق

source: Add a User to Your Course's Team
ar: أضِف مستخدمًا إلى فريق مساقك

source: New Team Member Information
ar: معلومات العضو الجديد في الفريق

source: User's Email Address
ar: عنوان البريد الإلكتروني للمستخدم

source: Provide the email address of the user you want to add as Staff
ar: أدخِل عنوان البريد الإلكتروني للمستخدم الذي تريد أن تضيفه إلى الطاقم

source: Add User
ar: أضِف مستخدمًا

source: Add Team Members to This Course
ar: أضِف أعضاء إلى فريق هذا المساق

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
ar: إن إضافة أعضاء إلى الفريق تجعل تأليف المساق عملًا تعاونيًّا. يجب أن يكون المستخدمون مسجّلين في {studio_name} ولديهم حسابٌ نشِط.

source: Add a New Team Member
ar: أضِف عضوًا جديدًا إلى الفريق

source: Course Team Roles
ar: أدوار فريق المساق

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
ar: أعضاء فريق المساق الذين يلعبون دور "الطاقم" هم مؤلّفون مشاركون للمساق، ويملكون كل صلاحيات الكتابة والتعديل لكل محتوى المساق.

source: Admins are course team members who can add and remove other course team members.
ar: المدراء هم أعضاء فريق المساق، الذين بإمكانهم إضافة أو إزالة أعضاء آخرين من الفريق.

source: All course team members can access content in Studio, the LMS, and Insights, but are not automatically enrolled in the course.
ar: يمكن لجميع أعضاء فريق المساق الوصول إلى المحتوى في "استوديو" ونظام إدارة التعلّم "LMS" وInsights، ولكنّهم لا يُسجَّلون تلقائيًا في المساق.

source: Transferring Ownership
ar: نقل الملكية

source: Every course must have an Admin. If you are the Admin and you want to transfer ownership of the course, click <strong>Add admin access</strong> to make another user the Admin, then ask that user to remove you from the Course Team list.
ar: يجب أن يكون لكل مساق مدير. وإذا كنت أنت مدير المساق وأردت نقل ملكية المساق إلى مستخدِم آخر، انقر على <strong>أضِف مديرًا</strong> لجعل مستخدمٍ آخر مديرًا، ثمّ اطلب من ذلك المستخدم أن يزيلك من قائمة فريق المساق.

source: Library User Access
ar: صلاحية الوصول كمستخدم للمكتبة

source: User Access
ar: صلاحية الوصول للمستخدمين

source: Grant Access to This Library
ar: امنح صلاحيات الوصول إلى هذه المكتبة

source: Provide the email address of the user you want to add
ar: أدخِل عنوان البريد الإلكتروني للمستخدم الذي ترغب في إضافته

source: Add More Users to This Library
ar: أضِف مزيدًا من المستخدمين إلى هذه المكتبة

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
ar: امنح أعضاء آخرين من فريق مساقك صلاحيات الوصول إلى هذه المكتبة. يجب أن يكون للمستخدمين الجدد للمكتبة حساب نشط في {studio_name}.

source: Add a New User
ar: أضِف مستخدمًا جديدًا

source: Library Access Roles
ar: أدوار الوصول إلى المكتبة

source: There are three access roles for libraries: User, Staff, and Admin.
ar: هناك ثلاثة أدوار وصول إلى المكتبات: المستخدم وطاقم المساق والمدير.

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
ar: يمكن لمستخدمي المكتبات مشاهدة محتوى المكتبة والرجوع إلى مكوِّناتها أو استخدامها في مساقاتهم، لكن لا يمكنهم تعديل محتوى المكتبة.

source: Library Staff are content co-authors. They have full editing privileges on the contents of a library.
ar: طاقم المكتبة هم مؤلفون مشاركون في المحتوى. لديهم كل صلاحيات تحرير محتوى المكتبة.

source: Library Admins have full editing privileges and can also add and remove other team members. There must be at least one user with the Admin role in a library.
ar: يملك مديرو المكتبات كل صلاحيات التحرير، كما يمكنهم إضافة أعضاء الفريق الآخرين وإزالتهم. ويجب أن يكون لدى مستخدم واحد على الأقلّ صلاحيات مدير في كل مكتبة.

source: Sign Up
ar: سجِّل الآن

source: Sign Up for {studio_name}
ar: سجِّل في {studio_name}

source: Already have a {studio_name} Account? Sign in
ar: هل لديك حساب {studio_name} من قبل؟ تفضل بالدخول

source: Ready to start creating online courses? Sign up below and start creating your first {platform_name} course today.
ar: هل أنت مستعد لإنشاء مساقات متاحة عبر الإنترنت؟ سجِّل أدناه، وابدأ اليوم بإنشاء مساقك الأوّل في {platform_name}.

source: Required Information to Sign Up for {studio_name}
ar: المعلومات المطلوبة للتسجيل في {studio_name}

source: This will be used in public discussions with your courses and in our edX101 support forums
ar: ستُستخدم هذه المعلومات في نقاشات عامة تتعلق بمساقاتك وفي منتديات دعم edX101 الخاصة بنا.

source: Your Location
ar: موقعك الجغرافي

source: Preferred Language
ar: اللغة المفضّلة

source: I agree to the {a_start} Terms of Service {a_end}
ar: أوافق على {a_start} شروط الخدمة {a_end}

source: Create My Account &amp; Start Authoring Courses
ar: إنشاء حسابي والبدء بتأليف المساقات

source: Common {studio_name} Questions
ar: أسئلة شائعة تتعلق بـ{studio_name}

source: Who is {studio_name} for?
ar: لِمَن {studio_name}؟

source: {studio_name} is for anyone that wants to create online courses that leverage the global {platform_name} platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
ar: صُمِّم {studio_name} لأي شخص يريد إنشاء مساقات متاحة عبر الانترنت ليدعم منصّة {platform_name} العالمية. وغالبًا ما يكون مستخدمونا أعضاء هيئة تدريس، ومعيدين، وطواقم مساقات، وأعضاء في مجموعات مختصّة بتكنولوجيا التعليم.

source: How technically savvy do I need to be to create courses in {studio_name}?
ar: ما مدى الخبرة التقنية المطلوبة لأتمكّن من إنشاء مساقات في {studio_name}؟

source: {studio_name} is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
ar: صُمّم {studio_name} ليكون سهل الاستخدام لكل من هم على دراية بالبيئات الشائعة للتأليف على الويب (Wordpress، Moodle، الخ.). وبينما ليس من الضروري أن تتحلّى بالخبرة في مجال البرمجة، إلّا أنّ بعض الخصائص الأكثر تقدّمًا تتطلب معرفة تقنية. وكالعادة، نحن حاضرون هنا لمساعدتك، فلا تتردّد في بدء العمل.

source: I've never authored a course online before. Is there help?
ar: لم يسبق لي أن ألّفت مساقًا عبر الإنترنت. هل يمكنكم مساعدتي؟

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
ar: بالطبع. فقد أنشأنا مساقًا عبر الإنترنت، اسمه edX101، يعطي شرحًا لأفضل الممارسات: بدءًا من تصوير الفيديو وتأليف التمارين، وصولًا إلى أساسيات إدارة مساق عبر الانترنت. كما أنّنا موجودون هنا دائمًا لمساعدتك، وما عليك إلّا أن ترسل لنا ملاحظاتك أو أسئلتك.

source: Schedule & Details Settings
ar: إعدادات التفاصيل والخطة الزمنية

source: Schedule & Details
ar: التفاصيل والخطة الزمنية

source: Basic Information
ar: معلومات أساسية

source: The nuts and bolts of your course
ar: المكوِّنات الأساسية لمساقك

source: This field is disabled: this information cannot be changed.
ar: هذا الحقل معطّل: لا يمكن تغيير هذه المعلومات.

source: Course Summary Page
ar: صفحة ملخّص المساق

source: (for student enrollment and access)
ar: (لتسجيل الطلّاب ووصولهم)

source: Enroll in {course_display_name}
ar: التحِق بـ{course_display_name}

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
ar: إنّ باب التسجيل في مساق "{course_display_name}"، الذي تقدّمه {platform_name} مفتوح. تفضَّل بالذهاب إلى هذا المساق من هنا {link_for_about_page} للتسجيل.

source: Send a note to students via email
ar: أرسِل ملاحظة إلى الطلّاب عبر البريد الإلكتروني

source: Invite your students
ar: ادعُ طلّابك

source: Promoting Your Course with {platform_name}
ar: الترويج لمساقك عبر {platform_name}

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
ar: لن تكون صفحة ملخّص مساقك مرئية إلى أن تُعلِن عن مساقك. ولتزوِّد الصفحة بالمحتوى وتعاينها، اتّبع التعليمات التي يقدمها لك مدير التخصصات.

source: Course Credit Requirements
ar: متطلّبات الساعات المعتمدة للمساق

source: Steps required to earn course credit
ar: الخطوات اللازمة للحصول على ساعات معتمدة للمساق

source: Minimum Grade
ar: الدرجة الدُنيا

source: Successful Proctored Exam
ar: امتحان مراقَب ناجح

source: Proctored Exam {number}
ar: امتحان مراقَب {number}

source: ID Verification
ar: التحقق من الهويّة

source: In-Course Reverification {number}
ar: إعادة التحقّق داخل المساق {number}

source: Set the pacing for this course
ar: حدِّد نوع هذا المساق

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
ar: تسير المساقات محدّدة الوقت تبعًا للخطة الزمنية التي يحدّدها مؤلف المساق. يمكنك ضبط تواريخ نشر محتوى المساق وتواريخ تسليم الواجبات.

source: Self-paced courses do not have release dates for course content or due dates for assignments. Learners can complete course material at any time before the course end date.
ar: لا يُحدّد تاريخ لنشر المحتوى أو لتسليم الواجبات للمساقات الدائمة، حيث يُسمح للمتعلّمين إتمام مواد المساق في أي وقت قبل تاريخ انتهاء المساق.

source: Course Schedule
ar: الخطة الزمنية للمساق

source: Dates that control when your course can be viewed
ar: التواريخ التي تحدّد متى يمكن رؤية على مساقك

source: First day the course begins
ar: اليوم الأوّل الذي يبدأ فيه المساق

source: Course Start Time
ar: وقت بدء المساق

source: (UTC)
ar: (التوقيت العالمي)

source: Last day your course is active
ar: اليوم الأخير الذي يكون فيه المساق نشِطًا

source: Course End Time
ar: وقت انتهاء المساق

source: Certificates Available Date
ar: تاريخ إتاحة الشهادات

source: By default, 48 hours after course end date
ar: عادةً بعد 48 ساعة من تاريخ انتهاء المساق

source: Enrollment Start Date
ar: تاريخ بدء التسجيل

source: First day students can enroll
ar: اليوم الأوّل الذي يمكن للطلّاب التسجيل فيه

source: Enrollment Start Time
ar: وقت بدء التسجيل

source: Enrollment End Date
ar: تاريخ انتهاء التسجيل

source: Last day students can enroll.
ar: اليوم الأخير الذي يمكن للطلّاب التسجيل فيه.

source: Contact your edX partner manager to update these settings.
ar: اتصل بمدير شريك edX الذي تعمل معه لتحديث هذه الإعدادات.

source: Enrollment End Time
ar: وقت انتهاء التسجيل

source: Course Details
ar: تفاصيل المساق

source: Provide useful information about your course
ar: أدخِل معلومات مفيدة عن مساقك

source: Identify the course language here. This is used to assist users find courses that are taught in a specific language. It is also used to localize the 'From:' field in bulk emails.
ar: حدد لغة المساق هنا لمساعدة المستخدِمين على العثور على المساقات التي تُدرَّس بلغة معيَّنة. ستستخدم هذه اللغة أيضاً في حقل المُرسل عند إرسال البريد الجماعي للطلاب.

source: Introducing Your Course
ar: التعريف بمساقك

source: Information for prospective students
ar: معلومات للطلبة المحتملين

source: Course Title
ar: عنوان المساق

source: Displayed as title on the course details page. Limit to 50 characters.
ar: يظهر كعنوان على صفحة تفاصيل المساق. 50 محرفًا على الأكثر.

source: Course Subtitle
ar: العنوان الفرعي للمساق

source: Displayed as subtitle on the course details page. Limit to 150 characters.
ar: يظهر كعنوان فرعي على صفحة تفاصيل المساق. 150 محرفًا على الأكثر.

source: Course Duration
ar: مدة المساق

source: Displayed on the course details page. Limit to 50 characters.
ar: يظهر على صفحة تفاصيل المساق. 50 محرفًا على الأكثر.

source: Course Description
ar: وصف المساق

source: Displayed on the course details page. Limit to 1000 characters.
ar: يظهر على صفحة تفاصيل المساق. 1000 محرف على الأكثر.

source: Course Short Description
ar: الوصف الموجَز للمساق

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
ar: يظهر على صفحة دليل المساقات عندما يشير الطلّاب بالفأرة على اسم المساق. ويقتصر على حوالي 150 حرفًا.

source: Course Overview
ar: نظرة عامة عن المساق

source: HTML Code Editor
ar: محرر HTML

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
ar: المقدمات والمتطلبات المسبقة والأسئلة الشائعة التي تستخدم في {a_link_start} صفحة ملخص مساقك {a_link_end} (بصيغة HTML)

source: Course About Sidebar HTML
ar: شريط المعلومات الجانبي لصفحة "عن المساق" بصيغة HTML

source: Custom sidebar content for {a_link_start}your course summary page{a_link_end} (formatted in HTML)
ar: محتوى مخصص للعمود الجانبي {a_link_start} صفحة ملخص المساق{a_link_end} (بصيغة html)

source: Course Card Image
ar: صورة بطاقة المساق

source: You can manage this image along with all of your other {a_link_start}files and uploads{a_link_end}
ar: يمكنك إدارة هذه الصورة جنبًا إلى جنب مع جميع {a_link_start} الملفات والمرفوعات{a_link_end} الأخرى التي قدّمتها

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ar: ليس لمساقك صورة حاليًّا. يُرجى رفع واحدة (بصيغة JPEG أو PNG، وبأبعاد يُقترح ألّا تقلّ عن 375 بكسل عرضًا و200 بكسل طولًا)

source: Your course image URL
ar: رابط صورة مساقك

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
ar: يُرجى تحديد مسار واسم صالحين لصورة المساق (ملاحظة: تُقبَل الصور بصيغة JPEG أو PNG فقط)

source: Upload Course Card Image
ar: ارفع صورة بطاقة المساق

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
ar: ليس لمساقك صورة حاليًّا. يُرجى رفع واحدة (بصيغة JPEG أو PNG، وبأبعاد يُقترح ألّا تقلّ عن 1440 بكسل عرضًا و400 بكسل طولًا)

source: Your banner image URL
ar: رابط صورة الترويسة

source: Please provide a valid path and name to your banner image (Note: only JPEG or PNG format supported)
ar: الرجاء تقديم مسار واسم صالحين لصورة شعارك (ملاحظة: تُقبل الصور بصيغة JPEG أو PNG فقط)

source: Upload Course Banner Image
ar: ارفع صورة ترويسة المساق

source: Video Thumbnail Image
ar: صورة الفيديو المصغرة

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
ar: ليس لمساقك صورة فيديو مصغرة حاليًّا. يُرجى رفع واحدة (بصيغة JPEG أو PNG، وبأبعاد يُقترح ألّا تقلّ عن 375 بكسل عرضًا و200 بكسل طولًا)

source: Your video thumbnail image URL
ar: رابط صورة الفيديو المصغرة

source: Please provide a valid path and name to your video thumbnail image (Note: only JPEG or PNG format supported)
ar: يُرجى تحديد مسار واسم صالحين لصورة الفيديو المصغرة للمساق (ملاحظة: تُقبَل الصور بصيغة JPEG أو PNG فقط)

source: Upload Video Thumbnail Image
ar: ارفع صورة الفيديو المصغرة

source: Course Introduction Video
ar: فيديو مقدّمة المساق

source: Delete Current Video
ar: احذف الفيديو الحالي

source: your YouTube video's ID
ar: معرِّف الفيديو على يوتيوب

source: Enter your YouTube video's ID (along with any restriction parameters)
ar: أدخِل معرِّف الفيديو على يوتيوب (بما في ذلك أيّ مُعامِلات تتعلق بالقيود)

source: Learning Outcomes
ar: نتائج التعلُّم

source: Add the learning outcomes for this course
ar: أضِف نتائج تعلّم لهذا المساق

source: Add Learning Outcome
ar: أضِف نتائج التعلُّم

source: Add details about the instructors for this course
ar: أضِف تفاصيل تتعلق بمدرّسي هذا المساق

source: Add Instructor
ar: أضِف مدرِّسين

source: Expectations of the students taking this course
ar: المُفترَض من الطلاب الملتحقين بهذا المساق

source: Hours of Effort per Week
ar: ساعات الجهد المبذول كلّ أسبوع

source: Time spent on all course work
ar: الوقت المبذول لإتمام كل أعمال المساق

source: Prerequisite Course
ar: المتطلب المُسبَق

source: Course that students must complete before beginning this course
ar: المساق الذي يجب أن يُتِمَّه الطلّاب قبل البدء بهذا المساق

source: set pre-requisite course
ar: حدِّد مساقًا كمتطلَّب مُسبَق

source: Require students to pass an exam before beginning the course.
ar: يُطلَب من الطلّاب اجتياز امتحان معيّن قبل بدء المساق.

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
ar: يمكنك الآن رؤية امتحان القبول الخاص بمساقك وتأليفه من خلال {link_start}الخطة الدراسيّة للمساق{link_end}.

source: Grade Requirements
ar: متطلّبات التقييم

source: The score student must meet in order to successfully complete the entrance exam.
ar: النتيجة التي يجب أن يحصل عليها الطالب ليجتاز امتحان القبول بنجاح.

source: Course Content License
ar: ترخيص محتوى المساق

source: Select the default license for course content
ar: اختر الترخيص الافتراضي لمحتوى المساق

source: How are these settings used?
ar: كيف تُستخدم هذه الإعدادات؟

source: Your course's schedule determines when students can enroll in and begin a course.
ar: تحدّد الخطة الزمنية لمساقك متى يمكن للطلّاب التسجيل في المساق والبدء فيه.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
ar: تظهر معلومات أخرى من هذه الصفحة على صفحة "نبذة عن المساق"، وتتضمّن نظرة عامة عن المساق، وصورة المساق، وفيديو مقدّمة، ومتطلّبات الوقت التقريبية. ويستخدم الطلّاب صفحات النبذة لاختيار المساقات الجديدة التي سيلتحقون بها.

source: Your policy changes have been saved.
ar: حُفِظَت التغييرات التي أدخلتها على سياسة مساقك.

source: There was an error saving your information. Please see below.
ar: حدث خطأ أثناء حفظ معلوماتك. يُرجى النظر أدناه.

source: Manual Policy Definition
ar: تحديد السياسة يدويًّا

source: {strong_start}Warning{strong_end}: Do not modify these policies unless you are familiar with their purpose.
ar: {strong_start}تحذير{strong_end}: لا تعدل هذه السياسات إلا إذا كنت على بينة من غرضها.

source: Show Deprecated Settings
ar: أظهِر الإعدادات الأثريّة

source: What do advanced settings do?
ar: ما الغرض من الإعدادات المتقدّمة؟

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
ar: تتحكم الإعدادات المتقدّمة بوظائف محددة في المساق. ويمكنك في هذه الصفحة أن تعدّل السياسات اليدوية والتي هي أزواج من قيم ومفاتيح بصيغة JSON وتتحكّم بإعدادت محددة في المساق.

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
ar: إنّ أي سياسات تعدّلها هنا تلغي كافة المعلومات الأخرى التي حدّدتها في أيِّ مكان آخر في {studio_name}. يُرجى عدم تعديل السياسات ما لم تكن ملمًّا بهدفها وصياغتها.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (") around the string. Do not use single quotation marks (').
ar: {em_start}ملاحظة:{em_end} عند إدخال نصوص كقيم سياسة، تأكد من أنك تستخدم علامات اقتباس مزدوجة (") حول النصّ. لا تستخدم علامات الاقتباس المفردة (').

source: Grading Settings
ar: إعدادات التقييم
