Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Unfortunately, you have not completed this course, you will not be able to issue a certificate.
ar: لم تُكمل هذا المساق بعد، لذلك لا يمكنك إصدار الشهادة.

source: You will be redirected to your {link_start}dashboard{link_end} in 10 seconds.
ar: سيتم تحويلك {link_start}لمكتبك{link_end} خلال عشر ثوان.

source: We are calculating your grades. This may take up-to one minute.
ar: يجري حساب درجاتك الآن. ستستغرق هذه العملية دقيقة تقريباً.

source: Course Completion Certificate
ar: شهادة إتمام المساق

source: Please note that the certificate will be issued with your full name on it as provided on your {link_start}account settings{link_end}.
ar: تَصدر شهادات إدراك بإسمك الكامل عليها، كما هو مكتوب في {link_start}صفحة إعدادات الحساب{link_end}.

source: Please double check your name. We prefer that the name is written in the same language you're issuing the certificate with. To change it, go to the {link_start}account settings{link_end} and edit your full name.
ar: تأكد من أن اسمك مكتوب بشكل صحيح وبنفس لغة إصدار الشهادة. لتعديل اسمك يرجى التوجه الى {link_start}إعدادات الحساب{link_end} وتعديل اسمك.

source: Download as PDF
ar: حمل بصيغة PDF

source: {course_number} Student University ID
ar: الرقم الجامعي لمساق {course_number}

source: Enroll in the course so you can edit your university ID.
ar: سجِّل بالمساق كي تُدخل رقمك الجامعي.

source: Registration is disabled. Contact your course instructor for help.
ar: أنتهت الفترة المخصصة لإدخال الرقم الجامعي. تواصل مع المدرس للمساعدة.

source: The information below have been successfully submitted to your university coordinator.
ar: لقد تم إرسال البيانات أدناه إلى مندوب جامعتك بنجاح.

source: At anytime you can review and change the information.
ar: يمكنك مراجعة وتعديل معلوماتك في أيّ وقت.

source: Your university information is needed for your grade reports. Please enter the required information, and verify it is correct.
ar: نحن بحاجة إلى معلوماتك الجامعية من أجل تقارير علاماتك. نرجو منك إدخال المعلومات المطلوبة والتأكد من أنها صحيحة.

source: You can submit and change your information before {registration_end}
ar: يمكنك إدخال وتعديل معلومات قبل {registration_end}

source: Your Student University ID Has Been Saved
ar: تم حفظ رقمك الجامعي بنجاح

source: Your student university ID has been successfully submitted and will be used for your grade records.
ar: تم إرسال رقمك الجامعي بنجاح، وستُستخدم لاحتساب علامتك في هذا المساق ضمن سجل علاماتك الجامعية.

source: Should your university coordinator have any comments on the information you entered, he/she will contact you.
ar: إن كان لمندوب جامعتك أي ملاحظات حول بياناتك الجامعية، فسيقومون بالاتصال بك.

source: View the Course Content
ar: اعرِض محتوى المساق

source: Delete a University ID for {course_number}
ar: احذف رقم الطالب الجامعي من مساق {course_number}

source: Students' University IDs
ar: الأرقام الجامعية للطلاب

source: Are you sure you want to delete the university ID ({university_id}) for student "{full_name}"?
ar: أأنت متأكد من رغبتك في حذف الرقم الجامعي ({university_id}) للطالب "{full_name}" ؟

source: Students' IDs List
ar: قائمة أرقام الطلاب الجامعية

source: Edraak University IDs
ar: الأرقام الجامعية في إدراك

source: Student's University ID
ar: رقم الطالب الجامعي

source: Section Number
ar: رقم الشعبة

source: This university ID is a duplicate.
ar: هذا الرقم الجامعي مستخدم أكثر من مرة.

source: No student has entered his/her university ID yet.
ar: لم يقم أي طالب بإدخال بيانات رقمه الجامعي بعد.

source: University ID settings
ar: إعدادات الرقم الجامعي

source: Your Settings Have Been Saved
ar: حُفِظَت الإعدادات التي أجريتها.

source: View the Students List
ar: إعرض قائمة الطلاب

source: Update University ID for {course_number}
ar: عدل الرقم الجامعي لطالب في {course_number}

source: Student Notes
ar: ملاحظات الطالب

source: Highlights and notes you've made in course content
ar: النقاط المهمّة والملاحظات التي أدخلتها على محتوى المساق

source: Search notes for:
ar: البحث في الملاحظات عن:

source: Search notes for...
ar: البحث في الملاحظات عن...

source: View notes by:
ar: اعرض الملاحظات من خلال:

source: You have not made any notes in this course yet. Other students in this course are using notes to:
ar: لم تدلِ بأي ملاحظات في هذا المساق بعد. الطلّاب الآخرون في هذا المساق يستخدمون الملاحظات بهدف:

source: Mark a passage or concept so that it's easy to find later.
ar: وضع علامة على مقطع أو مفهوم ما ليَسهل إيجاده لاحقًا.

source: Record thoughts about a specific passage or concept.
ar: تدوين الأفكار حيال مقطع أو مفهوم معيّن.

source: Highlight important information to review later in the course or in future courses.
ar: تسليط الضوء على معلومات مهمّة لمراجعتها لاحقًا في المساق أو في مساقات مستقبلية.

source: Get started by making a note in something you just read, like {section_link}.
ar: ابدأ من خلال الإدلاء بملاحظة في قسم قرأته لتوّك، مثل {section_link}.

source: Hide notes
ar: اخفِ الملاحظات

source: Show notes
ar: أظهِر الملاحظات

source: Thank you for your purchase of
ar: شكرًا لشرائك

source: Your payment was successful.
ar: نجح إجراء دفعتك.

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
ar: إذا لديك أي استفسارات حول الفواتير، تُرجى قراءة الأسئلة الشائعة ({faq_url}) أو مراسلتنا على {billing_email}.

source: If you have billing questions, please contact {billing_email}.
ar: إذا كانت لديك استفسارات حول الفواتير، تُرجى مراسلتنا على {billing_email}.

source: {order_placed_by} placed an order and mentioned your name as the Organization contact.
ar: قدَّم {order_placed_by} طلبًا وحدَّد اسمك كممثّل المؤسسة للإجابة على أي استفسار.

source: {order_placed_by} placed an order and mentioned your name as the additional receipt recipient.
ar: قدَّم {order_placed_by} طلبًا وحدَّد اسمك كمستلم الإيصال الإضافي.

source: The items in your order are:
ar: طلبيتك هي:

source: Quantity - Description - Price
ar: الكمّية - الوصف - السعر

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
ar: مجموع المدفوع عبر البطاقة البنكية:{currency_symbol}{total_cost}

source: Company Name:
ar: اسم الشركة:

source: Purchase Order Number:
ar: رقم الطلبية:

source: Company Contact Name:
ar: اسم موظّف الشركة:

source: Company Contact Email:
ar: البريد الإلكتروني لموظّف الشركة:

source: Recipient Name:
ar: اسم المستلِم:

source: Recipient Email:
ar: عنوان البريد الإلكتروني للمستلِم:

source: Order Number: {order_number}
ar: رقم الطلب: {order_number}

source: A CSV file of your registration URLs is attached. Please distribute registration URLs to each student planning to enroll using the email template below.
ar: تجد مرفقًا ملف CSV يحوي روابط تسجيلك، ويُرجى توزيع هذه الروابط على كل طالب ينوي التسجيل باستخدام نموذج البريد الإلكتروني المبيّن أدناه.

source: Warm regards,
ar: مع التحية والاحترام،

source: Warm regards,<br>The {platform_name} Team
ar: مع التحية والاحترام،<br>فريق {platform_name}

source: Dear [[Name]]
ar: مرحباً يا [[اسم المتعلّم]]،

source: To enroll in {course_names} we have provided a registration URL for you. Please follow the instructions below to claim your access.
ar: لقد زودناك برابط للتسجيل في {course_names}، يرجى اتّباع التعليمات الواردة أدناه لتتمكن من الدخول.

source: Your redeem url is: [[Enter Redeem URL here from the attached CSV]]
ar: رابط الاسترداد الخاص بمساقك هو: [[أدخل رابط الاسترداد هنا من ملف CSV المرفَق]]

source: (1) Register for an account at {site_name}
ar: (1) أنشئ حسابًا على موقع {site_name}

source: (2) Once registered, copy the redeem URL and paste it in your web browser.
ar: (2) بعد انشاء الحساب، انسخ رابط الاسترداد وألصقه في متصفّحك.

source: (3) On the enrollment confirmation page, Click the 'Activate Enrollment Code' button. This will show the enrollment confirmation.
ar: (3) انقر زر تفعيل رمز التسجيل في صفحة تأكيد التسجيل، ليظهر التأكيد على تسجيلك.

source: (4) You should be able to click on 'view course' button or see your course on your student dashboard at {url}
ar: (4) يجب أن تتمكّن من النقر على زر "اعرض المساق" أو أن ترى مساقك على صفحة "لوحتي التعليمية" الخاصة بك عبر الرابط {url}

source: (5) Course materials will not be available until the course start date.
ar: (5) لن تُتاح محتويات المساق قبل تاريخ بدء المساق.

source: <p>Sincerely,</p><p>[[Your Signature]]</p>
ar: <p>المخلص،</p><p>[[توقيعك]]</p>

source: Your payment was successful. You will see the charge below on your next credit or debit card statement under the company name {merchant_name}.
ar: جرت عملية الدفع بنجاح. سترى قيمة السداد في أسفل كشف الحساب الخاص ببطاقتك البنكية تحت اسم شركة {merchant_name}.

source: Thank you,
ar: وشكرًا،

source: Your order number is: {order_number}
ar: رقم طلبيتك: {order_number}

source: Hi {full_name},
ar: مرحبًا يا {full_name}،

source: Thanks for submitting your photos!
ar: شكرًا لإرسالك صورك!

source: We've received your information and the ID verification process has begun.Check for an email from us in the next few days to confirm whether your verification was successful.You can also check the status of the verification process on your dashboard.
ar: لقد تلقينا معلوماتك وبدأت عملية التحقق من الهوية. ستتلقى رسالة بريد إلكتروني منا في الأيام القليلة القادمة لتأكيد ما إذا كان التحقق قد نجح أم لا. يمكنك أيضًا التحقق من حالة عملية التحقق على لوحة التحكم.

source: The {platform_name} team
ar: فريق {platform_name}

source: Thank you for purchasing enrollments in {course_name}.
ar: شكرًا لدفعك رسوم التسجيل في {course_name}.

source: An invoice for {currency_symbol}{total_price} is attached. Payment is due upon receipt. You can find information about payment methods on the invoice.
ar: تجد مرفقًا فاتورة بقيمة {currency_symbol}{total_price}. الدفع مستحق فور الاستلام. تجد في الفاتورة تفاصيل حول أساليب الدفع الممكنة.

source: A .csv file that lists your enrollment codes is attached. You can use the email template below to distribute enrollment codes to your students. Each student must use a separate enrollment code.
ar: تجد مرفقًا ملف .csv يحتوي على رموز تسجيلك. يمكنك استخدام نموذج البريد الإلكتروني أدناه لتوزيع رموز التسجيل على طلابك. يجب أن يستخدم كل طالب رمز تسجيل خاص به.

source: Thanks, The {platform_name} Team
ar: وشكرًا، فريق {platform_name}

source: Dear [[Name]]:
ar: السيد/ة [[اسم المتعلّم]]:

source: We have provided a course enrollment code for you in {course_name}. To enroll in the course, click the following link:
ar: لقد زودناك برمز تسجيل لمساق {course_name}. للتسجيل في المساق انقر على الربط التالي:

source: HTML link from the attached CSV file
ar: رابط HTML من ملف CSV المرفق

source: After you enroll, you can see the course on your student dashboard. You can see course materials after the course start date.
ar: يمكنك بعد التسجيل أن ترى مساقك في صفحة "لوحتي التعليمية" الخاصة بك. يمكنك أن ترى المواد الدراسيّة بعد تاريخ بدء المساق.

source: Sincerely, [[Your Signature]]
ar: المخلص، [[توقيعك]]

source: INVOICE
ar: فاتورة

source: Invoice No: {invoice_number}
ar: رقم الفاتورة: {invoice_number}

source: Terms: Due Upon Receipt
ar: الشروط: المبلغ مستحق عند استلام الفاتورة

source: Due Date: {date}
ar: تاريخ الاستحقاق: {date}

source: Bill to:
ar: أرسِل الفاتورة إلى:

source: Customer Reference Number: {reference_number}
ar: الرقم المرجعي للعميل: {reference_number}

source: Balance Due: {currency_symbol}{sale_price}
ar: المبلغ المستحق: {currency_symbol}{sale_price}

source: Course: {course_name}
ar: المساق: {course_name}

source: Price: {currency_symbol}{course_price} Quantity: {quantity} Sub-Total: {currency_symbol}{sub_total} Discount: {currency_symbol}{discount}
ar: التكلفة: {currency_symbol}{course_price} الكمية: {quantity} المجموع الجزئي: {currency_symbol}{sub_total} الخصم: {currency_symbol}{discount}

source: Total: {currency_symbol}{sale_price}
ar: المجموع: {currency_symbol}{sale_price}

source: Payment Instructions
ar: تعليمات الدفع

source: If we do not receive payment, the learner enrollments that use these codes will be canceled and learners will not be able to access course materials. All purchases are final. For more information, see the {site_name} cancellation policy.
ar: في حال عدم استلامتنا للدفعة فإن تسجيلات المتعلّم التي تستخدم هذه الرموز سوف تلغى ولن يتمكن المتعلم من الوصول إلى محتويات المساق. جميع عمليات الشراء نهائية. للمزيد من المعلومات راجع سياسة الإلغاء في {site_name}.

source: For payment questions, contact {contact_email}
ar: للاستفسار حول الدفعات تواصل مع {contact_email}

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at {email}.
ar: نعتذر. لم يوافق طاقم المساق لدينا على طلبك تغيير اسمك من {old_name} إلى {new_name}. إذا كنت بحاجة للمزيد من المساعدة، فنرجو منك مراسلة فريق المساق على البريد الإلكتروني {email}

source: We have successfully verified your identity for the {assessment} assessment in the {course_name} course.
ar: لقد تحققنا بنجاح من هويتك من أجل تقييم {assessment} في مساق {course_name}.

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity.
ar: لم نتمكن من التحقق من هويتك من أجل تقييم {assessment} في المساق {course_name}. لقد استخدمت {used_attempts} من أصل {allowed_attempts} محاولات للتحقق من هويتك.

source: You must verify your identity before the assessment closes on {due_date}.
ar: يجب عليك توثيق من هويتك قبل إغلاق التقييم في {due_date}.

source: To try to verify your identity again, select the following link:
ar: لمحاولة التحقق من هويتك مجددًا اختر الرابط التالي:

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity, and verification is no longer possible.
ar: لم نتمكن من التحقق من هويتك من أجل تقييم {assessment} في لمساق {course_name}. لقد استخدمت {used_attempts} من أصل {allowed_attempts} محاولات للتحقق من هويتك ولم يعد التحقق ممكنًا.

source: To go to the courseware, select the following link:
ar: اختر الرابط التالي للذهاب إلى المادة التعليمية:

source: If you have any questions, you can contact student support at {support_link}.
ar: إذا كانت لديك أي أسئلة، فيمكنك الاتصال بخدمة دعم الطلاب على الرابط {support_link}.

source: Thanks,
ar: شكرًا،

source: This Course Unavailable In Your Country
ar: هذا المساق غير متاح في بلدك

source: Our system indicates that you are trying to access this {platform_name} course from a country or region in which it is not currently available.
ar: يشير نظامنا إلى أنك تحاول الوصول إلى مساق {platform_name} هذا من بلد أو منطقة لا يتوفر فيها المساق المطلوب حاليًا.

source: Our system indicates that you are trying to enroll in this {platform_name} course from a country or region in which it is not currently available.
ar: يشير نظامنا إلى أنك تحاول التسجيل في مساق {platform_name} هذا من بلد أو منطقة لا يتوافر فيها المساق المطلوب حاليًا.

source: Enrollment Successful
ar: نجح التسجيل

source: Thank you for enrolling in {course_names}. We hope you enjoy the course.
ar: شكرًا لتسجيلك في {course_names}، نرجو أن تستمتع بالمساق.

source: Thank you for enrolling in:
ar: شكرا لتسجيلك في :

source: We hope you enjoy the course.
ar: نأمل أن تستمتع بالمساق!

source: {platform_name} is a nonprofit bringing high-quality education to everyone, everywhere. Your help allows us to continuously improve the learning experience for millions and make a better future one learner at a time.
ar: {platform_name} هي جهة لا ربحية تهدف إلى توفير تعليم عالي المستوى بين أيدي الجميع أينما كانوا. نستفيد من مساعدتك لتحسين تجربة التعلّم باستمرار للملايين من الناس وفتح باب مستقبل أفضل لكل متعلم بدوره.

source: Donation Actions
ar: عمليات التبرع

source: Financial Assistance Application
ar: طلب دعم مالي

source: A Note to Learners
ar: ملاحظة للمتعلّمين

source: Dear edX Learner,
ar: أعزائي متعلمي إدراك،

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
ar: برنامج الدعم المالي من إدراك، هو برنامج أُنشئ لمنح المتعلّمين من مختلف القدرات المالية فرصة الحصول على شهادة موثّقة بناءً على نجاحهم في إتمام مساق في إدراك.

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
ar: إذا كنت مهتمًّا ببذل جهد للحصول على شهادة موثّقة إلا أنك غير قادر على دفع رسومها، يُرجى التقدّم بطلب الآن. يٌرجى الانتباه إلى أن فرص الحصول على دعم مالي محدودة وقد لا يسعنا منح جميع المتعلّمين المؤهّلين شهاداتهم.

source: In order to be eligible for edX Financial Assistance, you must demonstrate that paying the Verified Certificate fee would cause you economic hardship. To apply, you will be asked to answer a few questions about why you are applying and how the Verified Certificate will benefit you.
ar: لتتأهل للحصل على مساعدة مالية من إدراك، يجب أن تثبت بأن دفع رسم الحصول على شهادة موثّقة سيسبّب لك ضيقًا ماليًا. للتقدّم بطلب، سيُطلب منك الإجابة على بعض الأسئلة حول سبب تقدّمك بالطلب وكيف يمكن أن يفيدك الحصول على شهادة موثّقة.

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
ar: إذا تمت الموافقة على طلبك، سنزوّدك بالإرشادات اللازمة للتأكد من هويّتك على موقع إدراك لتتمكّن من مباشرة العمل لإتمام المساق الذي سجّلت فيه.

source: EdX is committed to making it possible for you to take high quality courses from leading institutions regardless of your financial situation, earn a Verified Certificate, and share your success with others.
ar: تلتزم إدراك بمنحك فرصة الحصول على مساقات تعليمية عالية الجودة، من مؤسسات تعليمية مرموقة ورائدة في المجال، بغض النظر عن مقدرتك الماديّة. احصل على شهادة موثّقة وشارك الآخرين نبأ نجاحِك.

source: Sincerely, Anant
ar: مع تحيات فريق إدراك

source: Back to Student FAQs
ar: العودة إلى "أسئلة الطلاب الشائعة"

source: Apply for Financial Assistance
ar: تقدّم بطلب للحصول على دعم مالي

source: {platform_name} Home Page
ar: الصفحة الرئيسية لمنصّة {platform_name}

source: Options Menu
ar: قائمة الخيارات

source: {begin_strong}Warning:{end_strong} Your browser is not fully supported. We strongly recommend using {chrome_link} or {ff_link}.
ar: {begin_strong}تحذير:{end_strong} متصفحك غير مدعوم بالكامل. ننصحك باستخدام {chrome_link} أو {ff_link}.

source: Programs
ar: التخصصات

source: Profile
ar: الملف الشخصي

source: Discover New
ar: اكتشف الجديد

source: Sysadmin
ar: مدير النظام

source: Shopping Cart
ar: سلّة المشتريات

source: Supplemental Links
ar: روابط تدعيمية

source: How it Works
ar: كيف تتعلم عبر إدراك

source: Schools
ar: المؤسسات التعليمية

source: Resume your last course
ar: متابعة التعلّم في مساقك الأخير

source: Add Coupon Code
ar: أضف رمز القسيمة

source: Enter information about the coupon code below.
ar: أدخل معلومات حول رمز القسيمة أدناه

source: Discount Percentage
ar: نسبة الخصم

source: Add expiration date
ar: أضف تاريخ انتهاء صلاحية

source: Example Certificates
ar: أمثلة على شهادات

source: Generate example certificates for the course.
ar: أنشئ أمثلة على شهادات للمساق

source: Generate Example Certificates
ar: أنشئ أمثلة على شهادات

source: Status:
ar: الحالة:

source: Generating example {name} certificate
ar: أنشئ مثالًا عن شهادة {name}

source: Error generating example {name} certificate: {error}
ar: نأسف لوقوع خطأ في إنشاء مثال على شهادة {name}: {error}

source: View {name} certificate
ar: معاينة شهادة {name}

source: Refresh Status
ar: حدِّث الحالة

source: Student-Generated Certificates
ar: شهادات أنشأها الطلاب

source: Disable Student-Generated Certificates
ar: تعطيل إمكانية أن يُنشئ الطلاب شهاداتهم

source: Enable Student-Generated Certificates
ar: تمكين الطلاب من إنشاء شهاداتهم

source: You must successfully generate example certificates before you enable student-generated certificates.
ar: يجب أن تنجح في إنشاء مثال عن الشهادة قبل أن تمكّن الطلاب من إنشاء شهاداتهم.

source: Generate Certificates
ar: أنشئ الشهادات

source: Course certificate generation requires an activated web certificate configuration.
ar: يتطلّب إنشاء شهادة المساق وجود إعدادات مفعّلة لاستصدار شهادة إلكترونية.

source: When you are ready to generate certificates for your course, click Generate Certificates. You do not need to do this if you have set the certificate mode to on-demand generation.
ar: عندما تكون مستعداً لإصدار الشهادات في مساقك، اضغط على "أصدر الشهادات". إن كان نظام الشهادات في وضع إصدار "عند الطلب" فلا داعي للقيام بهذه الخطوة.

source: Pending Tasks
ar: مهام قيد الانتظار

source: The status for any active tasks appears in a table below.
ar: حالة أي مهام فعالة تظهر في الجدول أدناه.

source: Regenerate Certificates
ar: أعِد إنشاء الشهادات

source: To regenerate certificates for your course, choose the learners who will receive regenerated certificates and click Regenerate Certificates.
ar: لإعادة إصدار شهادات لمساقك، اختر المتعلّمين الذي تود أن يحصلوا على شهادات جديدة ثم انقر على "أعِد إصدار الشهادات".

source: Choose learner types for regeneration
ar: اختر أنواع المتعلمين الذين ترغب بإعادة إصدار شهاداتهم

source: Regenerate for learners who have already received certificates. ({count})
ar: أعد إنشاء شهادات المتعلمين الذين كانوا قد استلموا شهاداتهم في وقت سابق وعددهم ({count}).

source: Regenerate for learners who have not received certificates. ({count})
ar: أعد إنشاء شهادات المتعلمين الذين لم يسبق أن استلموا شهاداتهم وعددهم ({count}).

source: Regenerate for learners with audit passing state. ({count})
ar: أعد إنشاء شهادات للمستمعين الذين نجحوا وعددهم ({count}).

source: Regenerate for learners with audit not passing state. ({count})
ar: أعد إنشاء شهادات للمستمعين الذين رسبوا وعددهم ({count}).

source: Regenerate for learners in an error state. ({count})
ar: أعد إنشاء شهادات المتعلّمين الذين حالتهم "خطأ" وعددهم ({count}).

source: Certificate Generation History
ar: سجِل عمليات إنشاء الشهادات

source: Task name
ar: اسم المهمة

source: SET CERTIFICATE EXCEPTIONS
ar: عيّن استثناءات الشهادة

source: Set exceptions to generate certificates for learners who did not qualify for a certificate but have been given an exception by the course team. After you add learners to the exception list, click Generate Exception Certificates below.
ar: عيّن استثناءات لإنشاء شهادات المتعلّمين الذين حصلوا على استثناء من قبل طاقم المساق رغم عدم استيفائهم لشروط الحصول على شهادة. بعد إضافة المتعلّمين إلى قائمة الاستثناءات، انقر على "إنشاء شهادات الاستثناءات" أدناه.

source: Invalidate Certificates
ar: الغِ الشهادة

source: Enrollment Information
ar: معلومات التسجيل

source: Number of enrollees (admins, staff, and students) by track
ar: عدد المسجلين (الإداريون والطاقم والطلاب) حسب المسار

source: Professional
ar: مهني

source: Basic Course Information
ar: المعلومات الأساسية للمساق

source: Course Name:
ar: اسم المساق:

source: Course Start Date:
ar: تاريخ بدء المساق:

source: Course End Date:
ar: تاريخ انتهاء المساق:

source: No end date set
ar: لم يُحدّد تاريخ الانتهاء

source: Has the course started?
ar: هل بدأ المساق؟

source: Yes
ar: نعم

source: No
ar: لا

source: Has the course ended?
ar: هل انتهى المساق؟

source: Number of sections:
ar: عدد الأقسام:

source: Grade Cutoffs:
ar: نطاق العلامات المرادفة لكل تقدير:

source: View detailed Git import logs for this course {link_start}by clicking here{link_end}.
ar: شاهد سجلات استيراد Git مفصلة لهذا المساق {link_start} بالنقر هنا{link_end}

source: Course Warnings
ar: إنذارات المساق
