Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Sorry! Your payment could not be processed because an unexpected exception occurred. Please contact us at {email} for assistance.
ar: عُذرًا! تعذّرت معالجة دفعتك نظرًا لحصول استثناء غير متوقَّع. تُرجى مراسلتنا على {email} للحصول على المساعدة.

source: The merchant reference code for this authorization request matches the merchant reference code of another authorization request that you sent within the past 15 minutes. Possible action: Resend the request with a unique merchant reference code.
ar: إنّ الرمز المرجعي للبائع المُستخدم في طلب التفويض هذا يتطابق مع الرمز المرجعي لطلب تفويض آخر، كنت قد أرسلته خلال آخر 15 دقيقة. الإجراء المحتمل: إعادة إرسال الطلب واستخدام رمز مرجعي فريد للبائع.

source: Only a partial amount was approved.
ar: تمت الموافقة على جزء من المبلغ فقط.

source: General system failure.
ar: فشل عام في النظام.

source: The request was received but there was a server timeout. This error does not include timeouts between the client and the server.
ar: جرى استلام الطلب إلا أن مهلة الاتصال بالخادم قد انتهت. ولا يشمل هذا الخطأ انتهاء المهل المسموح بها بين العميل والخادم.

source: The request was received, but a service did not finish running in time.
ar: استُلِمَ الطلب، ولكن خدمة لم تنتهِ في وقتها.

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the Address Verification System (AVS).
ar: وافق البنك المُصدِر على طلب التفويض إلا أن ’CyberSource‘ رفضه نظرًا لعدم سماح نظام التحقّق من العنوان (AVS) بمرور الطلب.

source: The issuing bank has questions about the request. You do not receive an authorization code programmatically, but you might receive one verbally by calling the processor. Possible action: retry with another form of payment.
ar: لدى البنك المُصدِر تساؤلات حول الطلب. لم تحصل على رمز تفويض مُرسل آليًا، بل يمكنك الحصول على إجابة شفهية باتصالك بالمعالج. الإجراء المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible action: retry with another form of payment.
ar: بطاقة منتهية الصلاحية. كما ويُمكن أن تتلقّى هذه الرسالة أيضًا في حال كان تاريخ انتهاء الصلاحية الذي قدّمته غير مطابق للتاريخ الموجود في ملفّ البنك المُصدِر. الإجراء المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: General decline of the card. No other information provided by the issuing bank. Possible action: retry with another form of payment.
ar: رفض عام للبطاقة. لم يوفّر البنك المصدر أي معلومات أخرى. والإجراء المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: Insufficient funds in the account. Possible action: retry with another form of payment.
ar: المبلغ المتوفّر في الحساب غير كافٍ. والإجراء المُحتمل: إعادة محاولة الدفع باستخدام وسيلة أخرى.

source: Stolen or lost card.
ar: بطاقة مسروقة أو ضائعة.

source: Issuing bank unavailable. Possible action: retry again after a few minutes.
ar: البنك المُصدِر غير متاح. والإجراء المحتمل: إعادة المحاولة بعد بضع دقائق.

source: Inactive card or card not authorized for card-not-present transactions. Possible action: retry with another form of payment.
ar: بطاقة غير مفعَّلة أو إنّ البطاقة غير مصرّح لها بالمعاملات التي لا تستلزم وجود بطاقة. والإجراء المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: CVN did not match.
ar: لم يتطابق رقم التحقق الخاص بالبطاقة "CVN".

source: The card has reached the credit limit. Possible action: retry with another form of payment.
ar: بلغت البطاقة السقف الائتماني المسموح به. والإجراء المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: Invalid card verification number (CVN). Possible action: retry with another form of payment.
ar: رقم التحقق الخاص بالبطاقة (CVN) غير صالح. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: The customer matched an entry on the processors negative file.
ar: طابق العميل إحدى مدخلات ملف الرفض لدى المعالِج.

source: Account frozen. Possible action: retry with another form of payment.
ar: حساب مجمَّد. الإجراء المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the CVN check. Possible action: retry with another form of payment.
ar: وافق البنك المُصدِر على طلب التفويض ولكنّCyberSource رفضه بسبب فشل اطلب في اختبار رقم التحقّق الخاص بالبطاقة. الإجراء المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: Invalid account number. Possible action: retry with another form of payment.
ar: رقم الحساب غير صالح. والإجراء المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: The card type is not accepted by the payment processor. Possible action: retry with another form of payment.
ar: لم يَقبَل معالِج الدفعات نوع بطاقتك. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: General decline by the processor. Possible action: retry with another form of payment.
ar: أبدى المعالج رفضا عامًا. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: There is a problem with the information in your CyberSource account. Please let us know at {0}
ar: ثمّة مشكلة في المعلومات الواردة في حسابك لدى CyberSource. يُرجى إعلامنا عبر {0}

source: The requested capture amount exceeds the originally authorized amount.
ar: إن المبلغ المطلوب للحجز الماليّ يتخطى المقدار الذي سُمِح به أصلًا.

source: Processor Failure. Possible action: retry the payment
ar: فشل في المعالِج. الحلّ المحتمل: إعادة محاولة الدفع.

source: The authorization has already been reversed.
ar: سبق أن أُجري إلغاء التفويض.

source: The authorization has already been captured.
ar: لقد تم الحصول على التفويض بالفعل.

source: The card type sent is invalid or does not correlate with the credit card number. Possible action: retry with the same card or another form of payment.
ar: نوع البطاقة المرسلة غير صالح أو لا يتماشى مع رقم البطاقة الائتمانية. الإجراء المُحتمل: إعادة المحاولة باستخدام البطاقة نفسها أو باستخدام وسيلة دفع أخرى.

source: You requested a capture, but there is no corresponding, unused authorization record. Occurs if there was not a previously successful authorization request or if the previously successful authorization has already been used by another capture request.
ar: لقد طلبت حجز مبلغ ماليّ عبر واجهة برمجة التطبيقات، ولكن ليس هناك أيّ سجلّ تخويل غير مستخدم ذي علاقة. يحدث هذا إذا لم يكن هناك طلب تخويل سابق ناجح، أو إذا كان هناك تخويل سابق ناجح تم استخدامه بالفعل في طلب حجز مالي سابق.

source: Either the capture or credit is not voidable because the capture or credit information has already been submitted to your processor, or you requested a void for a type of transaction that cannot be voided.
ar: إن الحجز المالي أو الدفع لا يمكن إلغاؤه إما لأن معلومات الحجز المالي أو الدفع قد تم إرسالها إلى الجهة المسؤولة أو لأنك قد طلبت إلغاء حركة لا يُمكن إلغاؤها.

source: You requested a credit for a capture that was previously voided.
ar: لقد طلبت اعتمادًا لإجراء عملية "Capture" سبق أن أُلغِيت

source: The request was received, but there was a timeout at the payment processor.
ar: تم استلام الطلب إلا أن مهلة العملية المسموح بها لمعالج الدفعات قد انتهت.

source: Stand-alone credits are not allowed.
ar: الساعات المعتمدة القائمة بذاتها غير مسموح بها.

source: The cardholder is enrolled for payer authentication
ar: إنّ حامل البطاقة مسجَّل للتحقّق من هوية الدافع

source: Payer authentication could not be authenticated
ar: تعذّر التحقّق من هويّة الدافع

source: The authorization request was approved by the issuing bank but declined by CyberSource based on your legacy Smart Authorization settings. Possible action: retry with a different form of payment.
ar: وافق البنك المصدِّر على طلب التفويض إلا أن CyberSource رفضته بناءً على إعدادات التفويض الذكية القديمة الخاصة بك. الإجراء المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: Order Number
ar: رقم الطلبية

source: Customer Name
ar: اسم العميل

source: Date of Original Transaction
ar: التاريخ الأصلي للقيد

source: Date of Refund
ar: تاريخ استرداد المبلغ

source: Amount of Refund
ar: المبلغ المستردّ

source: Service Fees (if any)
ar: رسوم الخدمة (إن وجدت)

source: Purchase Time
ar: وقت الشراء

source: Order ID
ar: معرِّف الطلبيّة

source: Unit Cost
ar: تكلفة الوحدة

source: Total Cost
ar: التكلفة الإجمالية

source: Currency
ar: العملة

source: Comments
ar: التعليقات

source: University
ar: الجامعة

source: Course Announce Date
ar: تاريخ الإعلان عن المساق

source: Course Start Date
ar: تاريخ بدء المساق

source: Course Registration Close Date
ar: تاريخ إغلاق باب التسجيل في المساق

source: Course Registration Period
ar: مدّة التسجيل في المساق

source: Total Enrolled
ar: إجمالي عدد الملتحقين

source: Audit Enrollment
ar: الملتحقون كمستمعين

source: Honor Code Enrollment
ar: التحاق بميثاق الشرف

source: Verified Enrollment
ar: الملتحقون كموثَّقين

source: Gross Revenue
ar: إجمالي الإيرادات

source: Gross Revenue over the Minimum
ar: تجاوز إجمالي الإيرادات الحدّ الأدنى

source: Number of Verified Students Contributing More than the Minimum
ar: عدد الطلّاب الموثَّقين الذين تتجاوزت مساهماتهم الحدّ الأدنى

source: Number of Refunds
ar: عدد الدفعات المستردّة

source: Dollars Refunded
ar: قيمة المبالغ المستردّة بالدولار

source: Number of Transactions
ar: عدد القيود

source: Total Payments Collected
ar: إجمالي الدفعات المقبوضة

source: Number of Successful Refunds
ar: عدد الدفعات التي استُردَّت بنجاح

source: Total Amount of Refunds
ar: إجمالي قيمة الدفعات المستردّة

source: You must be logged-in to add to a shopping cart
ar: يجب أن تدخل لتتمكّن من الإضافة إلى سلّة مشتريات

source: The course you requested does not exist.
ar: المساق الذي طلبته غير موجود.

source: The course {course_id} is already in your cart.
ar: مساق {course_id} موجود في سلّة مشترياتك أصلًا.

source: You are already registered in course {course_id}.
ar: سبق أن سجّلت في مساق {course_id}.

source: Course added to cart.
ar: أُضيف المساق إلى السلّة.

source: Discount does not exist against code '{code}'.
ar: لا يتوفّر خصم للرمز '{code}'.

source: This enrollment code ({enrollment_code}) is no longer valid.
ar: لم يعد رمز التسجيل ({enrollment_code}) صالحًا.

source: This enrollment code ({enrollment_code}) is not valid.
ar: رمز التسجيل ({enrollment_code}) غير صالح.

source: Code '{registration_code}' is not valid for any course in the shopping cart.
ar: رمز '{registration_code}' غير صالح لأي مساق في سلّة مشترياتك.

source: Cart item quantity should not be greater than 1 when applying activation code
ar: يجب أن لا تزيد الكمّية في السلّة عن 1 عند تطبيق رمز التفعيل.

source: Only one coupon redemption is allowed against an order
ar: يُسمح باسترداد قسيمة واحدة فقط للطلبيّة الواحدة

source: success
ar: نجح الأمر

source: You do not have permission to view this page.
ar: ليست لديك صلاحية الاطّلاع على محتوى هذه الصفحة.

source: We are sorry, you are not authorized to access {platform_name} via this channel. Please contact your learning administrator or manager in order to access {platform_name}.{line_break}{line_break}Error Details:{line_break}{error_message}
ar: عذرًا ، لا يحق لك الوصول إلى {platform_name} عبر هذه القناة. يرجى الاتصال بمسؤول التعلم أو المدير من أجل الوصول إلى {platform_name}. {line_break} {line_break} تفاصيل الخطأ: {line_break} {error_message}

source: Some error occured during password change. Please try again
ar: حدث خطأ ما أثناء تغيير كلمة المرور. حاول مرة اخرى

source: No email address provided.
ar: لم يُحدَّد عنوان بريد إلكتروني.

source: Create Account
ar: إنشاء حساب

source: State/Province/Region
ar: الولاية/المقاطعة/المنطقة

source: Company
ar: الشركة

source: Job Title
ar: المسمى الوظيفي

source: Mailing address
ar: العنوان البريدي

source: Tell us why you're interested in {platform_name}
ar: أخبرنا أسباب اهتمامك بـ{platform_name}

source: Profession
ar: المهنة

source: Specialty
ar: التخصص

source: View and regenerate certificates.
ar: عرض وإعادة إنشاء الشهادات.

source: Manual Refund
ar: استرداد المبلغ يدويًّا

source: Track refunds issued directly through CyberSource.
ar: تعقّب عمليات استرداد المبالغ الصادرة مباشرة عبر CyberSource.

source: Enrollment
ar: التسجيل

source: View and update learner enrollments.
ar: عرض وتحديث عمليات تسجيل المتعلّمين.

source: Manage User
ar: إدارة المستخدم

source: Disable User Account
ar: تعطيل حساب المستخدم

source: Entitlements
ar: استحقاقات

source: View, create, and reissue learner entitlements
ar: عرض وانشاء واعادة اصدار استحقاقات المتعلم

source: Usable
ar: قابل للإستعمال

source: Unusable
ar: غير قابل للإستعمال

source: User Disabled Successfully
ar: تم تعطيل المستخدم بنجاح

source: Email Address
ar: عنوان البريد الإلكتروني

source: Course ID
ar: معرِّف المساق

source: User not found
ar: لم يُعثَر على المستخدِم

source: Course {course_id} not past the refund window.
ar: لم يتخطّ المساق {course_id} فترة السماح باسترداد القيمة.

source: No order found for {user} in course {course_id}
ar: لم يُعثَر على طلبية خاصّة بالمستخدم {user} في مساق {course_id}

source: Unenrolled {user} from {course_id}
ar: انسحب {user} من مساق {course_id}

source: Refunded {cost} for order id {order_id}
ar: استُردّ مبلغ {cost} المدفوع لقاء الطلبيّة رقم {order_id}

source: Optional language the team uses as ISO 639-1 code.
ar: اللغة الاختيارية التي يستخدمها الفريق كرمز ISO 639-1.

source: Teams
ar: الفِرَق

source: The supplied course id {course_id} is not valid.
ar: إن معرِّف المساق المستخدَم {course_id} ليس صالحًا.

source: course_id must be provided
ar: يجب إدخال معرِّف المساق.

source: text_search and order_by cannot be provided together
ar: لا يمكن استخدام ميزتي البحث النصيّ text_search والترتيب order_by معًا.

source: The supplied topic id {topic_id} is not valid
ar: معرِّف الموضوع {topic_id} ليس صالحًا.

source: Error connecting to elasticsearch
ar: حدث خطأ في محاولة الاتصال بخادم "elasticSearch"

source: The ordering {ordering} is not supported
ar: إنّ خاصّية الترتيب {ordering} غير مدعومة.

source: The supplied course_id {course_id} is not valid.
ar: معرف المساق الذيأدخلته {course_id} ليس صالحًا.

source: You are already in a team in this course.
ar: أنت عضو في فريق في هذا المساق بالفعل.

source: username or team_id must be specified.
ar: يجب تحديد اسم المستخدم أو معرِّف الفريق.

source: Username is required.
ar: اسم المستخدم مطلوب.

source: Team id is required.
ar: معرِّف الفريق مطلوب.

source: This team is already full.
ar: هذا الفريق مكتمل أصلًا.

source: The user {username} is already a member of a team in this course.
ar: سبق أنّ سُجَّل المستخدم {username} كعضو في إحدى فرق هذا المساق.

source: The user {username} is not enrolled in the course associated with this team.
ar: المستخدم {username} غير مسجَّل في المساق المرتبط بهذا الفريق.

source: The course for which this deadline applies
ar: المساق الذي تنطبق عليه هذه المهلة

source: The datetime after which users are no longer allowed to submit photos for verification.
ar: الموعد الذي لا يُسمح بعده للطالب تقديم صور للتوثيق.

source: Your {platform_name} verification has expired.
ar: انتهت مهلة التوثيق في {platform_name}.

source: Intro
ar: المقدّمة

source: Make payment
ar: ادفع

source: Payment confirmation
ar: تأكيد الدفعة

source: Take photo
ar: التقط صورة

source: Take a photo of your ID
ar: التقط صورة لبطاقة هويتك

source: Review your info
ar: راجع بياناتك

source: Enrollment confirmation
ar: تأكيد التسجيل

source: Selected price is not valid number.
ar: التكلفة التي تم تحديدها ليست عددًا صالحًا.

source: This course doesn't support paid certificates
ar: لا يدعم هذا المساق الشهادات مدفوعة القيمة.

source: No selected price or selected price is below minimum.
ar: لم لم تحدَّد تكلفة أو أن التكلفة أقل من الحدّ الأدنى.

source: Photo ID image is required if the user does not have an initial verification attempt.
ar: صورة الهوية مطلوبة إذا لم يكن المستخدم قد أجرى محاولة توثيق أوّليّة.

source: Missing required parameter face_image
ar: لم تُرسِل صورة لوجهك (مطلوب)

source: Invalid course key
ar: مفتاح المساق غير صالح

source: No profile found for user
ar: لم يُعثر على ملف شخصي للمستخدم

source: Name must be at least {min_length} characters long.
ar: يجب أن يتكون الاسم من {min_length} حرفًا على الأقلّ.

source: Image data is not valid.
ar: بيانات الصورة غير صالحة.

source: {platform_name} ID Verification Photos Received
ar: تم استلام الصور الخاصة ببتوثيق الرقم المعرف {platform_name}

source: Your {platform_name} ID Verification Approved
ar: تمت الموافقة على توثيق الرقم المعرف ل{platform_name}

source: Your {platform_name} Verification Has Been Denied
ar: تم رفض التحقق من {platform_name}

source: Your Platform Name Here
ar: اسم المنصة هنا

source: Your Platform Description Here
ar: تعريف المنصة هنا

source: Read access
ar: خاصية القراءة فقط

source: Write access
ar: خاصية السماح بالكتابة والتعديل

source: Know your email address
ar: اعرف عنوان بريدك الالكتروني

source: Know your name and username
ar: اعر ف اسمك واسم الستخدم

source: Retrieve your grades for your enrolled courses
ar: راجع علاماتك في المساقات المسجل بها

source: Retrieve your course certificates
ar: استرجع شهاداتك في المساقات

source: Audit
ar: مستمع

source: Facebook
ar: فيسبوك

source: Like {platform_name} on Facebook
ar: تابِع {platform_name} على فيسبوك

source: Twitter
ar: تويتر

source: Follow {platform_name} on Twitter
ar: تابِع {platform_name} على تويتر

source: LinkedIn
ar: لينكد إن

source: Follow {platform_name} on LinkedIn
ar: تابِع {platform_name} على لينكد إن

source: Google+
ar: جوجل+

source: Follow {platform_name} on Google+
ar: تابِع {platform_name} على ’Google+‘

source: Tumblr
ar: تمبلر

source: Meetup
ar: موقع ميت اب "Meetup"

source: Reddit
ar: موقع رِدِت (Reddit)

source: Subscribe to the {platform_name} subreddit
ar: اشترك في ’subreddit‘ الخاص بـ{platform_name}

source: VK
ar: موقع VK

source: Weibo
ar: موقع ويبو (Weibo)

source: Youtube
ar: يوتيوب

source: Subscribe to the {platform_name} YouTube channel
ar: اشترك في قناة {platform_name} على يوتيوب.

source: Kosovo
ar: كوسوفو (Kosovo)

source: Welcome to {platform_name}.
ar: أهلًا بك في {platform_name}.

source: You have left the {start_bold}{enterprise_name}{end_bold} website and are now on the {platform_name} site. {enterprise_name} has partnered with {platform_name} to offer you high-quality, always available learning programs to help you advance your knowledge and career. {line_break}Please note that {platform_name} has a different {privacy_policy_link_start}Privacy Policy{privacy_policy_link_end} from {enterprise_name}.
ar: لقد تركت موقع {start_bold}{enterprise_name}{end_bold} وأنت الآن على في منصة {platform_name}. تم عقد شراكة بين {enterprise_name} ومنصة {platform_name} لتقديم برامج تعليمية عالية الجودة ومتاحة دائمًا لمساعدتك في تطوير معرفتك وحياتك المهنية.{line_break} يرجى ملاحظة أن منصة {platform_name} لديه {privacy_policy_link_start} سياسة خصوصية {privacy_policy_link_end} مختلفة عن {enterprise_name}.

source: Welcome to %(course_name)s
ar: مرحبا بك في %(course_name)s

source: To get started, please visit https://%(site_name)s.
ar: تُرجى زيارة الموقع https://%(site_name)s للبدء، ثمّ إدخال معلومات الدخول إلى حسابك.

source: The login information for your account follows:
ar: معلومات تسجيل الدخول لحسابك كالآتي:

source: email: %(email_address)s
ar: البريد الإلكتروني: %(email_address)s

source: password: %(password)s
ar: كلمة المرور: %(password)s

source: It is recommended that you change your password.
ar: نوصيك بتغيير كلمة المرور.

source: Sincerely yours, The %(course_name)s Team
ar: المُخلِـصون، فريق %(course_name)s

source: Welcome to %(course_name)s
ar: مرحبًا بك في %(course_name)s

source: To get started, please visit https://%(site_name)s. The login information for your account follows.
ar: تُرجى زيارة الموقع https://%(site_name)s للبدء، ثمّ إدخال معلومات الدخول إلى حسابك.

source: You have been enrolled in %(course_name)s
ar: لقد تم تسجيلك في مساق %(course_name)s

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s
ar: لقد دعاك أحد أعضاء فريق مساق %(course_name)s في %(site_name)s لتكون أحد مختبري الإصدار التجريبيّ للمساق.

source: The invitation has been sent by a member of the course staff.
ar: الدعوة تم إرسالها من قـِبَل أحد أفراد طاقم الساق

source: To start accessing course materials, please visit:
ar: للبدء بالاطلاع على محتويات المساق، تُرجى زيارة

source: To enroll in this course and begin the beta test:
ar: للانضمام للمساق وبدئ الاختبار التجريبي:

source: Visit %(course_name)s
ar: قم بزيارة%(course_name)s

source: Visit %(site_name)s
ar: قم بزيارة %(site_name)s

source: This email was automatically sent from %(site_name)s to %(email_address)s
ar: أُرسِلت هذه الرسالة تلقائيًّا من %(site_name)s إلى %(email_address)s

source: Dear %(full_name)s
ar: حضرة السيد/ة %(full_name)s المحترم/ة،

source: You have been invited to be a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
ar: لقد دعاك أحد أعضاء فريق مساق %(course_name)s في %(site_name)s لتكون أحد مختبري الإصدار التجريبيّ للمساق.

source: To start accessing course materials, please visit %(course_url)s
ar: للبدء بالاطلاع على محتويات المساق، تُرجى زيارة %(course_url)s

source: Visit %(course_about_url)s to enroll in this course and begin the beta test.
ar: قم بزيارة %(course_about_url)sللانضمام للمساق وبدئ الاختبار التجريبي

source: Visit %(site_name)s to enroll in this course and begin the beta test.
ar: قم بزيارة %(site_name)s للانضمام للمساق وبدئ الاختبار التجريبي

source: You have been invited to a beta test for %(course_name)s
ar: لقد دُعيت لاختبار الإصدار التجريبي للمساق %(course_name)s

source: You have been invited to %(course_name)s
ar: لقد تمت دعوتك للانضمام إلى %(course_name)s

source: You have been invited to join %(course_name)s at %(site_name)s by a member of the course staff.
ar: لقد دعاك أحد أفراد طاقم مساق %(course_name)s على %(site_name)s للانضمام إلى المساق.

source: To access this course click on the button below and login:
ar: للوصول إلى هذا المساق، إضغط الزر في الأسفل وقم بتسجيل الدخول:

source: To access this course visit it and register:
ar: للوصول إلى هذا المساق، قم بتسجيل الدخول:

source: Please finish your registration and fill out the registration form making sure to use %(email_address)s in the Email field:
ar: يُرجى إكمال عملية التسجيل ومِلئ النموذج، مع مراعاة استخدام البريد الإلكتروني %(email_address)s :

source: Finish Your Registration
ar: أكمل عمليّة التسجيل

source: Once you have registered and activated your account, you will see %(course_name)s listed on your dashboard.
ar: بمجرد قيامك بالتسجيل وتفعيل حسابك، ستتمكن من رؤية مساق %(course_name)s على صفحة مكتبك.

source: Once you have registered and activated your account, you will be able to access this course:
ar: بمجرد التسجيل وتفعيل الحساب، ستتمكن من الوصول إلى هذا المساق

source: You can then enroll in %(course_name)s.
ar: يمكنك حينئذ التسجيل في مساق %(course_name)s

source: Dear student,
ar: عزيزي الطالب/ عزيزتي الطالبة،

source: To access this course visit %(course_url)s and login.
ar: للوصول إلى هذا المساق، قم بزيارة %(course_url)s ثم الدخول

source: To access this course visit %(course_about_url)s and register for this course.
ar: للوصول إلى هذا المساق، قم بزيارة %(course_about_url)s ثم تسجيل الدخول

source: To finish your registration, please visit %(registration_url)s and fill out the registration form making sure to use %(email_address)s in the Email field.
ar: لإتمام التسجيل، نرجو منك زيارة %(registration_url)s وتعبئة بيانات نموذج التسجيل مع التأكد من استخدام %(email_address)s في حقل البريد الإلكتروني.

source: Once you have registered and activated your account, visit %(course_about_url)s to join this course.
ar: بمجرد التسجيل وتفعيل الحساب، تفضل بزيارة صفحة %(course_about_url)s للانضمام إلى المساق.

source: You have been invited to register for %(course_name)s
ar: لقد دُعيت للتسجيل لمساق %(course_name)s

source: You have been unenrolled from %(course_name)s
ar: تم إلغاء تسجيلك من %(course_name)s
