Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
ar: اضغط هنا لعرض إعدادات التقييم لهذا المساق. تنقسم إعدادات التقييم إلى أقسام المساق المقيَّمة (كالامتحانات أو مجموعات المسائل)، ويمكن تعديلها في صفحة "التقييم" (في الإعدادات) في الاستوديو.

source: Grading Configuration
ar: ضبط التقييم

source: Click to download a CSV of anonymized student IDs:
ar: اضغط هنا لتنزيل ملف بصيغة CSV يضم معرّفات الطلاب المسجّلين دون كشف هويتهم:

source: Get Student Anonymized IDs CSV
ar: احصل على ملف CSV يحوي معرّفات الطلاب دون كشف هويتهم

source: Reports
ar: التقارير

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
ar: يمكن أن يستغرق إنشاء التقارير للمساقات الكبيرة بضع ساعات، وعندما ينتهي إنشاء التقرير سوف يظهر في أسفل الجدول رابط يتضمن تاريخ ووقت إنشاء التقرير. ويتم إنشاء هذه التقارير في الخلفية، أي أن بإمكانك ترك هذه الصفحة أثناء إنشاء التقرير.

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
ar: يرجى الصبر وعدم النقر على الأزرار عدة مرات، لأن تكرار النقر على هذه الأزرار سوف يبطئ عملية إنشاء التقرير كثيرًا.

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
ar: انقر هنا لإعداد ملف CSV يضم كافة الطلاب الملتحقين بهذا المساق، إلى جانب معلومات الملف الشخصي كالبريد الإلكتروني واسم المستخدم:

source: Download profile information as a CSV
ar: تنزيل معلومات الملف الشخصي بشكل ملف بصيغة CSV

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
ar: انقر لإنشاء ملف CSV يحوي أسماء المتعلمين الذين يمكنهم التسجيل في المساق ولكنهم لم يقوموا بالتسجيل بعد.

source: Download a CSV of learners who can enroll
ar: قم بتنزيل ملف CSV بأسماء المتعلمين الذين يمكنهم التسجيل

source: Click to generate a CSV file of all proctored exam results in this course.
ar: انقر لإعداد ملف CSV بجميع نتائج الامتحانات المراقبة لهذا المساق.

source: Generate Proctored Exam Results Report
ar: أنشئ تقريرًا بنتائج الامتحانات المراقبة

source: Click to generate a CSV file of survey results for this course.
ar: انقر لإنشاء ملف CSV بنتائج استبيان هذا المساق.

source: Generate Survey Results Report
ar: أنشئ تقرير نتائج الاستبيانات

source: To generate a CSV file that lists all student answers to a given problem, enter the location of the problem (from its Staff Debug Info).
ar: لتوليد ملف CSV يحوي قائمة بإجابات الطلاب لمسألة معينة، أدخل موقع المسألة (تجده في معلومات التنقيح للطاقم)

source: Problem location:
ar: موقع المسألة:

source: Download a CSV of problem responses
ar: بتنزيل ملف CSV يضم إجابات المسألة

source: Click to list certificates that are issued for this course:
ar: انقر لإظهار قائمة بالشهادات الممنوحة لطلاب هذا المساق:

source: View Certificates Issued
ar: أظهر الشهادات الممنوحة

source: Download CSV of Certificates Issued
ar: بتزيل ملف CSV بالشهادات الممنوحة

source: For smaller courses, click to list profile information for enrolled students directly on this page:
ar: إذا كان هذا المساق يحوي عددًا صغيرًا من المتعلمين، انقر لعرض قائمة بمعلومات الملفات الشخصية للطلاب المسجلين في هذا المساق على هذه الصفحة مباشرةً.

source: List enrolled students' profile information
ar: اعرض قائمة بمعلومات الملف الشخصي للطلاب المسجلين

source: Click to generate a CSV grade report for all currently enrolled students.
ar: انقر هنا لإنشاء ملف لعلامات الطلاب بصيفة CSV لجميع الطلاب المسجلين حاليًا.

source: Generate Grade Report
ar: أنشئ تقرير العلامات

source: Generate Problem Grade Report
ar: أنشئ تقرير علامات المسائل

source: Generate ORA Data Report
ar: أنشئ تقريرَ بيانات ORA

source: Reports Available for Download
ar: التقارير جاهزة للتنزيل

source: The reports listed below are available for download. A link to every report remains available on this page, identified by the UTC date and time of generation. Reports are not deleted, so you will always be able to access previously generated reports from this page.
ar: التقارير المذكورة أدناه متاحة للتنزيل، ويبقى رابط لكل تقرير متاحًا على هذه الصفحة معرَّفًا بتاريخ ووقت الإنشاء بتوقيت UTC. لا يتم حذف التقارير لذا يمكنك دومًا أن تتصفّح التقارير التي تم إنشاؤها سابقًا من خلال هذه الصفحة.

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
ar: يتم إعداد تقرير توزيع الإجابات الظاهر أدناه دوريّاً عبر عمليّة آليّة تعمل في الخلفية. وهذا التقرير تراكمي، لذا فالإجابات التي يتم تقديمها بعد بدء العملية يتم تضمينها في تقرير لاحق. ويتم إنشاء التقرير عدة مراتٍ يومياً.

source: {strong_start}Note{strong_end}: To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.
ar: {strong_start} ملاحظة{strong_end}: للحفاظ على أمن بيانات الطلاب، لا يمكنك إرسال أو حفظ روابط الملفات التالية للوصول إليها بشكل مباشر، حيث إن صلاحيتها تنتهي بعد مرور 5 دقائق.

source: Enrollment Codes
ar: رموز التسجيل

source: Create one or more pre-paid course enrollment codes. Students can use these codes to enroll in the course.
ar: أنشئ رمزًا واحدًا أو أكثر من رموز التسجيل في المساقات مسبقة الدفع. يمكن للطلاب استخدام هذه الرموز للالتحاق بالمساق.

source: Create Enrollment Codes
ar: أنشئ رموز التسجيل

source: Cancel, restore, or mark an enrollment code as unused.
ar: إلغاء أو استرداد أو تحديد رمز تسجيل على أنه غير مستخدم

source: Change Enrollment Code Status
ar: غيّر وضع رمز التسجيل

source: Download a .csv file of all enrollment codes for this course.
ar: تنزيل ملف .csv بجميع رموز التسجيل لهذا المساق.

source: Download All Enrollment Codes
ar: تنزيل جميع رموز التسجيل

source: Download a .csv file of all unused enrollment codes for this course.
ar: تنزيل ملف .csv بجميع رموز التسجيل غير المستخدمة لهذا المساق.

source: Download Unused Enrollment Codes
ar: تنزيل رموز التسجيل غير المستخدمة

source: Download a .csv file of all used enrollment codes for this course.
ar: تنزيل ملف .csv بجميع رموز التسجيل المستخدمة لهذا المساق.

source: Download Used Enrollment Codes
ar: تنزيل رموز التسجيل المستخدمة

source: Course Price
ar: تكلفة المساق

source: Course price per seat:
ar: تكلفة المساق لكل مقعد:

source: Edit Price
ar: تعديل التكلفة

source: Course Seat Purchases
ar: مشتريات مقعد المساق

source: Total Credit Card Purchases:
ar: مجموع مشتريات بطاقة الإئتمان:

source: Download a .csv file for all credit card purchases or for all invoices, regardless of status.
ar: تنزيل ملف .csv بجميع مشتريات بطاقات الائتمان أو لجميع الفواتير بغض النظر عن حالتها.

source: Download All Invoices
ar: تنزيل جميع الفواتير

source: Download All Credit Card Purchases
ar: تنزيل جميع مشتريات البطاقة الائتمانية

source: To cancel or resubmit an invoice, enter the invoice number below.
ar: لإلغاء أو إعادة تقديم فاتورة، أدخِل رقم الفاتورة أدناه,

source: Invoice Number
ar: رقم الفاتورة

source: Cancel Invoice
ar: الغِ الفاتورة

source: Resubmit Invoice
ar: أعِد تقديم الفاتورة

source: Create a .csv file that contains enrollment information for your course.
ar: إنشاء ملف .csv يحوي جميع معلومات التسجيل لمساقك.

source: Create Enrollment Report
ar: أنشئ تقرير الالتحاق

source: Create an HTML file that contains an executive summary for this course.
ar: أنشئ ملف HTML يحوي ملخصًا تنفيذيًا لهذا المساق.

source: Create Executive Summary
ar: أنشئ ملخصًا تنفيذيًا

source: Available Reports
ar: التقارير المتاحة

source: The following reports are available for download. Reports are not deleted. A link to every report remains available on this page, identified by the date and time (in UTC) that the report was generated.
ar: التقارير التالية متاحة للتنزيل. لا يتم حذف التقارير ويبقى على هذه الصفحة رابط لكل تقرير معرَّفًا بالتاريخ والوقت (بتوقيت UTC) الذَين تم فيهما إنشاء التقرير.

source: {strong_start}Note{strong_end}: To help protect learner data, links to these reports that you save outside of this page or that you send or receive in email expire after five minutes.
ar: {strong_start}ملاحظة{strong_end}: للحفاظ على بيانات المتعلمين، فإن روابط هذه التقارير التي تحفظها خارج هذه الصفحة، أو التي ترسلها أو تستلمها في بريد إلكتروني، تنتهي صلاحيتها بعد مرور خمس دقائق.

source: Coupon Code List
ar: قائمة رموز القسائم

source: Download a .csv file of all coupon codes for this course.
ar: بتنزيل ملف .csv بجميع رموز القسائم لهذا المساق.

source: Download Coupon Codes
ar: تنزيل رموز القسائم

source: Coupon Codes
ar: رموز القسائم

source: Coupon (%)
ar: القسيمة (%)

source: Number Redeemed
ar: عدد مرات استخدام القسيمة

source: The Invoice Number field cannot be empty.
ar: لا يمكن ترك حقل رقم الفاتورة فارغًا

source: No Expiration Date
ar: لا يوجد تاريخ انتهاء صلاحية

source: Enter the company name.
ar: أدخل اسم الشركة.

source: The company name cannot be a number.
ar: لا يمكن أن يكون اسم الشركة رقمًا

source: Enter the company contact name.
ar: أدخل اسم مندوب الشركة.

source: The company contact name cannot be a number.
ar: لا يمكن أن يكون اسم مندوب الشركة رقمًا.

source: Enter the email address for the company contact.
ar: أدخل البريد الإلكتروني لمندوب الشركة.

source: Enter a valid email address.
ar: يُرجى إدخال عنوان بريد إلكتروني صالِح.

source: Enter the recipient name.
ar: أدخل اسم المرسَل إليه.

source: The recipient name cannot be a number.
ar: لا يمكن أن يكون اسم المرسَل إليه رقمًا.

source: Enter the recipient email address.
ar: أدخل البريد الإلكتروني للمرسَل إليه.

source: Enter the billing address.
ar: أدخل عنوانًا لإرسال الفواتير إليه.

source: Enter the price per course seat.
ar: أدخل تكلفة كل مقعد في المساق.

source: Enter a numeric value for the price per course seat. Do not include currency symbols.
ar: أدخل تكلفة المقعد في المساق بالأرقام. لا تكتب رموز العملات.

source: Enter the number of enrollment codes.
ar: أدخل عدد رموز التسجيل

source: Enter a numeric value for the number of enrollment codes.
ar: أدخل عدد رموز التسجيل بالأرقام.

source: Select a currency.
ar: اختر عملة.

source: Enter a coupon code.
ar: أدخل رمز قسيمة.

source: The discount percentage must be less than or equal to 100.
ar: يجب أن لا تزيد نسبة الخصم عن 100.

source: Enter a numeric value for the discount amount. Do not include the percent sign.
ar: أدخل قيمة الخصم بالأرقام. لا تكتب رمز النسبة المئوية.

source: Edit Coupon Code
ar: عدِّل رمز القسيمة

source: Edit Coupon Code Information
ar: عدِّل معلومات رمز القسيمة

source: Code
ar: الرمز

source: example: A123DS
ar: مثال: A123DS

source: Percentage Discount
ar: نسبة الخصم

source: Update Coupon Code
ar: حدِّث رمز القسيمة

source: Executive Summary for {display_name}
ar: الملخَّص التنفيذي لـ {display_name}

source: Report Creation Date
ar: تاريخ إنشاء التقرير

source: Number of Seats
ar: عدد المقاعد

source: Number of Enrollments
ar: عدد المسجلين

source: Gross Revenue Collected
ar: إجمالي الإيرادات المحصَّلة

source: Gross Revenue Pending
ar: إجمالي الإيرادات قيد الانتظار

source: Number of Enrollment Refunds
ar: عدد المسجلين الذين أعيدت إليهم الرسوم

source: Amount Refunded
ar: القيمة المستردَّة

source: Average Price per Seat
ar: متوسط تكلفة المقعد

source: Frequently Used Coupon Codes
ar: رموز القسائم متكررة الاستخدام

source: Number of seats purchased using coupon codes
ar: عدد المقاعد المدفوعة باستخدام رموز القسائم

source: Rank
ar: الرُتبة

source: Percent Discount
ar: نسبة الخصم

source: Times Used
ar: عدد مرات الاستخدام

source: Bulk and Single Seat Purchases
ar: مشتريات المقاعد بالجملة وبشكل مفرد

source: Number of seats purchased individually
ar: عدد المقاعد المدفوعة فرديًّا

source: Number of seats purchased in bulk
ar: عدد المقاعد المدفوعة بالجملة

source: Number of seats purchased with invoices
ar: عدد المقاعد المدفوعة بفواتير

source: Unused bulk purchase seats (revenue at risk)
ar: المقاعد المدفوعة بالجملة وغير المستخدمة (مخاطرة في الإيرادات)

source: Percentage of seats purchased individually
ar: نسبة المقاعد المدفوعة فرديًّا

source: Percentage of seats purchased in bulk
ar: نسبة المقاعد المدفوعة بالجملة

source: Percentage of seats purchased with invoices
ar: نسبة المقاعد المدفوعة بفواتير

source: Individual due date extensions
ar: تمديدات تواريخ الاستحقاق كلًّا على حدة

source: In this section, you have the ability to grant extensions on specific units to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
ar: في هذا القسم، يمكنك إعطاء الطلاب كلًّا على حدة تمديدًا للمواعيد المقررة لوحدات معينة. يُرجى العلم بأن الذي يؤخذ به هو التاريخ الأخير؛ فلا يمكنك استخدام هذه الأداة لإعطاء أحد الواجبات المقرّرة تاريخاً أبكر لطالب معيّن.

source: Specify the {platform_name} email address or username of a student here:
ar: حدِّد البريد الالكتروني أ واسم المستخدم الخاص بالطالب في {platform_name} هنا:

source: Student Email or Username
ar: عنوان البريد الإلكتروني أو اسم المستخدم للطالب

source: Choose the graded unit:
ar: اختر الوحدة الخاضعة للتقييم:

source: Specify the extension due date and time (in UTC; please specify {format_string}).
ar: حدّد موعد التسليم الجديد (بتوقيت UTC؛يُرجى استخدام {format_string}).

source: Change due date for student
ar: غيّر موعِد التسليم للطالب

source: Viewing granted extensions
ar: عرض التمديدات الممنوحة

source: Here you can see what extensions have been granted on particular units or for a particular student.
ar: يمكنك هنا رؤية أيٍ من التمديدات تم منحها لوحدات معيّنة ولطالب معيّن.

source: Choose a graded unit and click the button to obtain a list of all students who have extensions for the given unit.
ar: اختر إحدى الوحدات التي تمّ تقييمها وقم بالضغط على الزر للحصول على قائمة بكافة الطلاب الذين تم منحهم تمديدات بالنسبة المحدّدة.

source: List all students with due date extensions
ar: اعرض قائمة بكافة الطلاب الذين تم تمديد موعد التسليم لهم

source: Specify a student to see all of that student's extensions.
ar: حدد طالبًا معيّنًا لرؤية كافة التمديدات الممنوحة له.

source: List date extensions for student
ar: أظهر قائمة بالمواعيد التي تم تمديدها للطالب

source: Resetting extensions
ar: إعادة ضبط التمديدات

source: Resetting a problem's due date rescinds a due date extension for a student on a particular unit. This will revert the due date for the student back to the problem's original due date.
ar: تغيير تاريخ التسليم لمسألة ما يلغي التمديد الممنوح لتاريخ التقديم لطالب لوحدة محدّدة. وسيؤدي هذا إلى إعادة التاريخ المحدّد للطالب إلى التاريخ المحدّد أصلاً لتلك المسألة.

source: Reset due date for student
ar: غيِّر موعد التسليم للطالب

source: Generate Registration Code Modal
ar: أنشئ شروط رمز التسجيل

source: * Required Information
ar: * معلومات مطلوبة

source: The organization that purchased enrollments in the course
ar: المؤسسة التي دفعت للتسجيل في هذا المساق

source: Organization Contact
ar: الموظف المعنيّ في المؤسسة

source: Organization Contact Name
ar: اسم الموظف المعنيّ في المؤسسة

source: The primary contact at the organization
ar: متلقّي الاتصالات الرئيسي في المؤسسة

source: Invoice Recipient
ar: متلقي الفاتورة

source: The contact who should receive the invoice
ar: الشخص الذي يجب أن يستلم الفاتورة

source: Organization Billing Address
ar: عنوان المؤسسة الذي ستُرسل إليه الفواتير

source: Address Line 1
ar: السطر الأول للعنوان

source: Address Line 2
ar: السطر الثاني للعنوان

source: Address Line 3
ar: السطر الثالث للعنوان

source: State/Province
ar: المحافظة/الإمارة

source: Zip
ar: الرمز البريدي

source: Unit Price
ar: تكلفة الوحدة

source: The price per enrollment purchased
ar: التكلفة لكل تسجيل

source: Number of Enrollment Codes
ar: عدد رموز التسجيل

source: The total number of enrollment codes to create
ar: إجمالي عدد رموز التسجيل الواجب إنشاؤها

source: Course Team Internal Reference
ar: الرقم المرجعي الداخلي لفريق المساق

source: Internal reference information for the sale
ar: معلومات الرقم المرجعي الداخلي لعملية البيع

source: Customer Reference
ar: رقم العميل

source: Customer's purchase order or other reference information
ar: أمر الشراء الخاص بالعميل أو غيره من المعلومات المرجعية

source: Send me a copy of the invoice
ar: أرسِل إليّ نسخة من الفاتورة

source: For analytics about your course, go to {link_start}{analytics_dashboard_name}{link_end}.
ar: للحصول على تحليلات لمساقك، تُرجى زيارة الرابط {link_start}{analytics_dashboard_name}{link_end}.

source: Instructor Dashboard
ar: لوحة المدرّس التعليمية

source: View Course in Studio
ar: اعرض المساق في الاستوديو

source: Enrollment Code Status
ar: حالة رمز التسجيل

source: Change the status of an enrollment code.
ar: غيّر حالة رمز التسجيل.

source: Enrollment Code
ar: رمز التسجيل

source: Find Enrollment Code
ar: اعثر على رمز تسجيل

source: Enter email addresses and/or usernames separated by new lines or commas.
ar: أدخِل عناوين البريد الإلكتروني و/أو أسماء المستخدمين مع فصلها بأسطر جديدة أو باستخدام فواصل.

source: You will not get notification for emails that bounce, so please double-check spelling.
ar: لن تتلقّى إشعارًا بعناوين الطلاب الاكترونية الخاطئة التي لم تضف الى الشعبة، لذا يُرجى إعادة التحقّق من عدم وجود أخطاء إملائية.

source: Role of the users being enrolled.
ar: دور المستخدمين المسجِّلين.

source: Enter the reason why the students are to be manually enrolled or unenrolled.
ar: أدخل سبب الحاجة إلى تسجيل أو إلغاء تسجيل الطلاب يدويًا

source: This cannot be left blank and will be recorded and presented in Enrollment Reports.
ar: لا يمكن ترك هذا الحقل فارغًا، وسوف يسجَّل ويعرَض في تقارير التسجيل.

source: Therefore, please give enough detail to account for this action.
ar: لذا يرجى توفير تفاصيل كافية لتبرير هذه الخطوة.

source: Reason
ar: السبب

source: Register/Enroll Students
ar: تسجيل الطلاب

source: To register and enroll a list of users in this course, choose a CSV file that contains the following columns in this exact order: email, username, name, and country. Please include one student per row and do not include any headers, footers, or blank lines.
ar: لتسجيل وإلحاق مجموعة مستخدمين في هذا المساق، يُرجى اختيار ملف CSV يحوي الأعمدة التالية بهذا الترتيب بالضبط: عنوان البريد الإلكتروني، واسم المستخدم، والاسم، والبلد. ويُرجى ذِكر طالب واحد في كل سطر وعدم تضمين أي ترويسات أو حواشي أو أسطر فارغة.

source: Upload a CSV for bulk enrollment
ar: ارفع ملف CSV للتسجيل الجماعي

source: Upload CSV
ar: ارفع ملف CSV

source: Batch Beta Tester Addition
ar: إضافة مختبري الإصدار التجريبيّ للمساق

source: Note: Users must have an activated {platform_name} account before they can be enrolled as beta testers.
ar: ملاحظة: يجب أن يكون للمستخدمين حساب {platform_name} مفعَّل قبل أن يتمكنوا من التسجيل كمختبِرين.

source: If this option is {em_start}checked{em_end}, users who have not enrolled in your course will be automatically enrolled.
ar: إذا كان هذا الخيار {em_start}محددا{em_end}، فسيتم تسجيل المستخدمين الذين لم يسجلوا في الدورة التدريبية تلقائيا.

source: Checking this box has no effect if 'Remove beta testers' is selected.
ar: لا يكون لتفعيل هذا الخيار أي أثر إذا كان خيار "أزِل مختبري الإصدار التجريبيّ" مفعَّلًا.

source: Add beta testers
ar: أضِف مختبري الإصدار التجريبيّ

source: Remove beta testers
ar: أزِل مختبري الإصدار التجريبيّ

source: Course Team Management
ar: إدارة فريق المساق

source: Select a course team role:
ar: اختر دورًا في فريق المساق:

source: Getting available lists...
ar: يجري استعراض القوائم المتاحة...

source: Staff cannot modify these lists. To manage course team membership, a course Admin must give you the Admin role to add Staff or Beta Testers, or the Discussion Admin role to add discussion moderators and TAs.
ar: لا يمكن للطاقم أن يعدّلوا هذه القوائم. لتتمكن من إدارة عضوية فريق المساق، يجب على مدير المساق أن يعطيك دورًا إداريًّا كي تتمكن من إضافة أفراد للطاقم أو مختري إصدار تجربي، أو أن يعطيك دور مدير المناقشات لتتمكن من إضافة مشرفين للمناقشات ومساعدي تدريس.

source: Course team members with the Staff role help you manage your course. Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Staff also have access to your course in Studio and Insights. You can only give course team roles to enrolled users.
ar: يساعدك أعضاء فريق المساق الذين يلعبون دورًا في الطاقم في إدارة مساقك. يمكن للطاقم تسجيل وإلغاء تسجيل المتعلمين كما يمكنهم تعديل علاماتهم والوصول إلى جميع بيانات المساق. يمكن للطاقم أيضًا الوصول إلى مساقك في ’الاستوديو‘ و’إنسايتس‘. يمكنك إعطاء أدوار أعضاء الفريق فقط للمستخدمين المسجلين.

source: Add Staff
ar: أضِف أعضاء فريق

source: Admin
ar: مدير

source: Course team members with the Admin role help you manage your course. They can do all of the tasks that Staff can do, and can also add and remove the Staff and Admin roles, discussion moderation roles, and the beta tester role to manage course team membership. You can only give course team roles to enrolled users.
ar: يساعدك أعضاء فريق المساق الذين لهم دور "مدير" على إدارة المساق. ويمكنهم القيام بجميع المهام التي يقوم بها الطاقم، كما يمكنهم أيضًا إضافة أو إزالة أدوار الطاقم والإداريين وأدوار إدارة المناقشات ومختبري الإصدار التجريبيّ، وذلك ليتمكنوا من إدارة العضويات في فريق المساق. يمكنك أن تعطي أدوار فريق المساق فقط إلى الأعضاء المسجلين.

source: Add Admin
ar: أضِف مديرًا

source: Beta Testers
ar: مختبرو الإصدار التجريبيّ

source: Beta Testers can see course content before other learners. They can make sure that the content works, but have no additional privileges. You can only give course team roles to enrolled users.
ar: يمكن لمختبري الإصدار التجريبيّ أن يروا محتوى المساق قبل باقي المتعلمين، ويمكنهم التأكد من صحة عمل المحتوى، لكنهم لا يملكون أي امتيازات أخرى. يمكنك أن تعطي أدوار أعضاء الفريق فقط للمستخدمين المسجلين.

source: Add Beta Tester
ar: أضِف مختبر إصدار تجريبي

source: Discussion Admins
ar: مديروا النقاشات

source: Discussion Admins can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They can also add and remove the discussion moderation roles to manage course team membership. Only enrolled users can be added as Discussion Admins.
ar: يمكن لمشرفي النقاشات تعديل أو حذف أي منشور وإلغاء الإشارات المستخدمة بشكل خاطئ وإغلاق وإعادة فتح المحادثات وتوثيق الردود والاطّلاع على المنشورات من كافة المجموعات. يتمّ الإشارة إلى منشوراتهم بصفتها تابعةً للطاقم. يمكنهم إضافة وإلغاء أدوار تعديل المناقشات بغرض إدارة عضوية فريق المساق. يمكن إضافة المستخدمين المسجّلين فقط كمشرفي نقاشات.

source: Add Discussion Admin
ar: أضِف مدير مناقشات

source: Discussion Moderators
ar: مشرفو المناقشات

source: Discussion Moderators can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all groups. Their posts are marked as 'staff'. They cannot manage course team membership by adding or removing discussion moderation roles. Only enrolled users can be added as Discussion Moderators.
ar: يمكن لوسطاء النقاشات تعديل أو حذف أي منشور وإلغاء الإشارات المستخدمة بشكل خاطئ وإغلاق وإعادة فتح المحادثات وتوثيق الردود والاطّلاع على المنشورات من كافة المجموعات. يتمّ الإشارة إلى منشوراتهم بصفتها تابعةً للطاقم. لا يحق لهم إدارة عضويات فريق المساق عبر إضافة أو حذف أدوار وسطاء النقاشات. يمكن إضافة المستخدمين المسجّلين فقط كوسطاء نقاشات.

source: Add Moderator
ar: أضِف مشرفًا

source: Group Community TA
ar: مساعد مدرس لمجموعة المنتدى
