Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: To the maximum extent permitted by applicable law, you agree to defend, hold harmless and indemnify {platform_name} and the {platform_name} Participants, and their respective subsidiaries, affiliates, officers, faculty, students, fellows, governing board members, agents and employees from and against any third-party claims, actions or demands arising out of, resulting from or in any way related to your use of the APIs and any API Content, including any liability or expense arising from any and all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature. In such a case, {platform_name} or one of the {platform_name} Participants will provide you with written notice of such claim, action or demand.
ar: إلى أقصى حد يسمح به القانون المعمول به، أنت توافق على أن تدافع عن وتحافظ وتعوض {platform_name} والمشاركين لدى {platform_name}، والشركات التابعة لها، وفروعها، وموظفيها، وجامعتها، وطلابها، وزملائها، والأعضاء التنظيميين لمجلس الإدارة، والوكلاء، والموظفين ضد ومقابل أي مطالبات أو إجراءات أو ادعاءات لأطراف أخرى قد تنتج عن أو ترتبط باستخدامك لواجهات API وأي محتوى من محتويات API بأي شكل من الأشكال، بما في ذلك أي مسؤولية أو مصاريف التي قد تنشأ من أي مصدر وجميع المطالبات والخسائر والأضرار (الفعلية والمترتبة)، والدعاوى، والأحكام، وتكاليف التقاضي، وأتعاب المحاماة، من أي نوع وأياً كانت طبيعتها. وفي مثل هذه الحالة، تقوم {platform_name} أو أحد المشاركين لدى {platform_name} بإرسال إشعار مكتوب إليك لإبلاغك بهذه المطالبة، أو الحكم، أو الإجراء.

source: General Legal Terms
ar: الشروط القانونية العامة

source: The Terms constitute the entire agreement between you and {platform_name} with respect to your use of the APIs and API Content, superseding any prior agreements between you and {platform_name} regarding your use of the APIs and API Content. The failure of {platform_name} to exercise or enforce any right or provision of the Terms shall not constitute a waiver of such right or provision. If any provision of the Terms is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision and the other provisions of the Terms shall remain in full force and effect. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. For any notice provided to you by {platform_name} under these Terms, {platform_name} may notify you via the email address associated with your {platform_name} account.
ar: تمثل الشروط مجمل الاتفاقية بينك وبين {platform_name} فيما يتعلق باستخدامك لواجهات API ومحتوى API، وتكون لها الأولوية على أية اتفاقيات سابقة بينك وبين {platform_name} فيما يتعلق باستخدامك لواجهات API ومحتوى API. عدم قيام {platform_name} بممارسة أو إنفاذ أي حق أو حكم بموجب الشروط لا يعني التنازل عن هذا الحق أو الحكم. إذا اكتشفت محكمة مختصة أن أي نص من نصوص الشروط غير صالح، يتفق الطرفين على الرغم من ذلك على أن المحكمة ينبغي أن تسعى لإنفاذ نوايا الطرفين كما هو مبين في الحكم، ويجب أن تبقى الأحكام الأخرى من هذه الشروط كاملة النفاذ والتأثير. ولا تتضمن الشروط أي حقوق انتفاع لجهات أخرى أو أي وكالة أو شراكة أو مشروع مشترك. بالنسبة لأي إشعار ترسله إليك {platform_name} بموجب هذه الشروط، قد تقوم {platform_name} بإشعارك عبر عنوان البريد الإلكتروني المرتبط بحسابك في {platform_name}.

source: You agree that the Terms, the APIs, and any claim or dispute arising out of or relating to the Terms or the APIs will be governed by the laws of the Commonwealth of Massachusetts, excluding its conflicts of law provisions. You agree that all such claims and disputes will be heard and resolved exclusively in the federal or state courts located in and serving Cambridge, Massachusetts, U.S.A. You consent to the personal jurisdiction of those courts over you for this purpose, and you waive and agree not to assert any objection to such proceedings in those courts (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Notwithstanding the foregoing, you agree that {platform_name} shall still be allowed to apply for injunctive remedies (or an equivalent type of urgent legal relief) in any jurisdiction.
ar: أنت توافق على أن الشروط، وواجهات API، وأية مطالبة أو نزاع قد تنشأ عن أو تتعلق بالشروط أو بواجهات API، ستخضع لقوانين ماساتشوستس، باستثناء التناقُضات بين أحكام القانون. كما توافق على أن جميع هذه المطالبات والمنازعات سوف يتم النظر فيها وحلها بشكل حصري في المحاكم الفدرالية أو محاكم الولاية الواقعة في كامبريدج، ماساتشوستس، الولايات المتحدة الأمريكية وتخدمها. كما أنك توافق على الاختصاص الشخصي لتلك المحاكم وسلطتها عليك في هذا الشأن، وأنت تتنازل وتوافق على عدم إبداء أي اعتراض على هذه الإجراءات في تلك المحاكم (بما في ذلك أي دفاع أو اعتراض على عدم صلاحية السلطة أو الاختصاص المكاني أو الانزعاج من المحكمة). وعلى الرغم مما سبق، فأنت توافق على السماح بقيام {platform_name} بتطبيق تعويضات قضائية (أو أي نوع مماثل من التعويضات القانونية المستعجلة) في أي ولاية قضائية.

source: Termination
ar: إنهاء

source: You may stop using the APIs at any time. You agree that {platform_name}, in its sole discretion and at any time, may terminate your use of the APIs or any API Content for any reason or no reason, without prior notice or liability.
ar: يمكنك التوقف عن استخدام واجهات API في أي وقت. وأنت توافق على أن تقوم {platform_name} وفقاً لتقديرها فقط وفي أي وقت بإنهاء استخدامك لواجهات API أو أي محتوى من محتويات API لأي سبب من الأسباب أو بدون سبب، دون إشعار مسبق أو تحمل أي مسؤولية.

source: {platform_name_capitalized} and the {platform_name} Participants reserve the right at any time in their sole discretion to cancel, delay, reschedule or alter the format of any API or API Content offered through {platform_name}, or to cease providing any part or all of the APIs or API Content or related services, and you agree that neither {platform_name} nor any of the {platform_name} Participants will have any liability to you for such an action.
ar: تحتفظ {platform_name_capitalized} و{platform_name} المشاركون بالحق في إلغاء، أو تأخير، أو إعادة جدولة، أو تغيير نَسَق أي واجهة من واجهات API أو أي محتوى من محتويات API المقدمة من خلال {platform_name} في أي وقت وحسب تقديرهم فقط، وبالحق في التوقف عن تقديم كلّ واجهات API أو محتوى API أو الخدمات ذات الصلة، أو أيّ جزء منها، وأنت توافق على أن لا تتحمل {platform_name} أو أي من المشاركين لدى {platform_name} أي مسؤولية تجاهك عن مثل هذا الإجراء.

source: Upon any termination of the Terms or discontinuation of your access to an API for any reason, your right to use any API and API Content will immediately cease. You will immediately stop using the APIs and delete any cached or stored API Content from Your Application and your networks, systems and servers as soon as reasonably possible. All provisions of the Terms that by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, and limitations of liability. Termination of your access to and use of the APIs and API Content shall not relieve you of any obligations arising or accruing prior to such termination or limit any liability that you otherwise may have to {platform_name}, including without limitation any indemnification obligations contained herein.
ar: عند أي فسخ للشروط أو توقف وصولك إلى واجهات API لأي سبب من الأسباب، فإن حقك في استخدام أي واجهة من واجهات API وأي محتوى من محتويات API سيتوقف فوراً. عليك التوقف فوراً عن استخدام واجهات API وحذف أي محتوى مؤقت أو مخزن لواجهات API من التطبيق والشبكة والانظمة والخوادم في أقرب وقت ممكن في حدود المعقول.جميع أحكام الشروط التي تستمر بطبيعتها رغم الفسخ تظل مستمرة، بما في ذلك، وبدون حصر، أحكام الملكية، وإخلاءات المسؤولية، وتحديد المسؤولية. لا يُعفيك إنهاء وصولك إلى واستخدام واجهات API ومحتوى API من أي التزامات المنبثقة أو الناشئة قبل هذا الإنهاء أو تحديد أية مسؤولية قد تتحملها تجاه {platform_name}، بما في ذلك وعلى سبيل المثال لا الحصر، أي التزامات بتعويضات واردة في هذه الوثيقة.

source: Edit {catalog_name}
ar: تحرير {catalog_name}

source: Download CSV
ar: تنزيل بصيغة CSV

source: Delete this catalog
ar: حذف هذا الدليل

source: Update Catalog
ar: تحديث الدليل

source: Catalogs for {username}
ar: أدلَّة {username}

source: Create new catalog:
ar: إنشاء دليل جديد

source: Create Catalog
ar: أنشئ دليلًا

source: Catalog search
ar: البحث في الأدلّة

source: Catalog Search
ar: البحث في الأدلّة

source: Enter a username to view catalogs belonging to that user.
ar: أدخِل اسم المستخدِم لرؤية أدلّته

source: Open Calculator
ar: افتح الآلة الحاسبة

source: Enter equation
ar: أدخل معادلة

source: Calculator Input Field
ar: حقل الإدخال في الآلة الحاسبة

source: Hints
ar: تلميحات

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
ar: استخدم مفاتيح الأسهم للتنقّل بين النصائح أو استخدام مفتاح tab للعودة إلى الآلة الحاسبة

source: For detailed information, see {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} in the {guide_link_start}edX Guide for Students{guide_link_end}.
ar: لمزيد من التفاصيل، اطلع على {math_link_start}إدخال التعابير الرياضية والعلمية{math_link_end} في {guide_link_start}دليل edX للطلّاب{guide_link_end}.

source: Tips
ar: نصائح

source: Use parentheses () to make expressions clear. You can use parentheses inside other parentheses.
ar: استخدم القوسين () لإيضاح التعابير. يمكنك استخدام زوج من الأقواس داخل آخَر.

source: Do not use spaces in expressions.
ar: لا تستخدم مسافات في التعابير.

source: For constants, indicate multiplication explicitly (example: 5*c).
ar: بالنسبة للثوابت، حدِّد عملية الضرب بوضوح (مثلًا: 5*جـ).

source: For affixes, type the number and affix without a space (example: 5c).
ar: بالنسبة لللاحقات، أَدخِل الرقم والملحق من دون مسافة بينهما (مثلًا: 5جـ).

source: For functions, type the name of the function, then the expression in parentheses.
ar: بالنسبة للوظائف، أدخِل اسم الوظيفة، يتبعه التعبير بين قوسين.

source: To Use
ar: للاستخدام

source: Type
ar: النوع

source: Examples
ar: أمثلة

source: Numbers
ar: أرقام

source: Integers
ar: أعداد صحيحة

source: Fractions
ar: كسور

source: Decimals
ar: كسور عشرية

source: Operators
ar: المعامِلات

source: + - * / (add, subtract, multiply, divide)
ar: + - * / (زائد، ناقص، ضرب، قسمة)

source: ^ (raise to a power)
ar: ^ (أي مرفوع لأُسّ)

source: || (parallel resistors)
ar: || (مقاومات متوازية)

source: Constants
ar: الثوابت

source: Affixes
ar: اللاحقات

source: Percent sign (%) and metric affixes (d, c, m, u, n, p, k, M, G, T)
ar: علامة النسبة (%) واللاحقات المترية (d, c, m, u, n, p, k, M, G, T)

source: Basic functions
ar: الاقترانات الأساسية

source: Trigonometric functions
ar: الاقترانات المثلثية

source: Scientific notation
ar: الكتابة العلميّة للأعداد

source: 10^ and the exponent
ar: 10^ والأُسّ

source: e notation
ar: الترميز الأسّيّ للأعداد

source: 1e and the exponent
ar: ‏1e والأُسّ

source: Calculate
ar: احسب

source: Result
ar: النتيجة

source: CCX Coach Dashboard
ar: مكتب مدرب المساقات المخصّصة

source: Name your CCX
ar: سمِّ مساقك المخصّص

source: Create a new Custom Course for edX
ar: أنشئ مساقك المخصّص

source: Grading Policy
ar: سياسة التقييم

source: Batch Enrollment
ar: تسجيل مجموعة طلاب

source: Student Grades
ar: علامات الطلاب

source: Please enter a valid CCX name.
ar: يُرجى إدخال اسم مساق مخصص صالح.

source: Email Addresses/Usernames
ar: عناوين البريد الإلكتروني/أسماء المستخدمين

source: Enter one or more email addresses or usernames separated by new lines or commas.
ar: أدخل واحدًا أو أكثر من عناوين البريد الإلكتروني أو أسماء المستخدمين مع فصلها على أسطر مختلفة أو باستخدام فواصل.

source: Make sure you enter the information carefully. You will not receive notification for invalid usernames or email addresses.
ar: تأكد من إدخال المعلومات بعناية. لن تتلقى إشعارًا بأسماء المستخدمين أو عناوين البريد الإلكتروني غير الصالحة.

source: Auto Enroll
ar: التسجيل الآلي

source: If this option is {em_start}checked{em_end}, users who have not yet registered for {platform_name} will be automatically enrolled.
ar: في حالة قيامك {em_start}باختيار{em_end} هذا الخيار، فإن المستخدمين الذين لم يتم تسجيلهم بعد في {platform_name} سيتم إدراجهم تلقائياً.

source: If this option is left {em_start}unchecked{em_end}, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
ar: في حالة تركك لهذا الخيار {em_start}بدون اختيار{em_end}، فإن المستخدمين الذين لم يتم تسجيلهم بعد في {platform_name} لن يتم إدراجهم، ولكن سيسمح لهم بالتسجيل بمجرد قيامهم بإنشاء حساب.

source: Checking this box has no effect if 'Unenroll' is selected.
ar: لا يكون لوضع إشارة في هذا المربّع أي أيّ أثر على خيار Unenroll إذا تمّ اختياره.

source: Notify users by email
ar: إعلام المستخدمين عبر البريد الإلكتروني

source: If this option is {em_start}checked{em_end}, users will receive an email notification.
ar: في حالة قيامك {em_start}باختيار{em_end} هذا الخيار، فسوف يتلقى المستخدمون إشعاراً بالبريد الإلكتروني.

# someone
source: Enroll
ar: سجّل

source: Student List Management
ar: إدارة قوائم الطلاب

source: CCX student list management response message
ar: رسالة استجابة إدارة قوائم طلاب المساقات المخصّصة

source: Revoke access
ar: إلغاء صلاحيات الوصول

source: WARNING
ar: تحذير

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
ar: للمستخدمين المتقدمين فقط. قد تؤدي الأخطاء في سياسة التقييم إلى فشل عرض المساق. لا يتحقق هذا النموذج من صلاحية السياسة قبل حفظه.

source: Most coaches should not need to make changes to the grading policy.
ar: لا يحتاج معظم المدربين إلى إجراء أي تغييرات على سياسة التقييم.

source: Save Grading Policy
ar: حفظ سياسة التقييم

source: Date format four digit year dash two digit month dash two digit day
ar: صيغة التاريخ أربع خانات للسنة شَرطة خانتان للشهر شَرطة خانتان لليوم

source: Time format two digit hours colon two digit minutes
ar: صيغة التوقيت خانتان للساعات نقطتان عموديتان خانتان للدقائق

source: Time
ar: الوقت

source: Set date
ar: حدِّد التاريخ

source: You have unsaved changes.
ar: لديك تغييرات غير محفوظة.

source: There was an error saving changes.
ar: حدث خطأ أثناء حفظ التغييرات.

source: Schedule a Unit
ar: جدوِل وِحدة

source: Start Date
ar: تاريخ البدء

source: format four digit year dash two digit month dash two digit day
ar: الصيغة أربع خانات للسنة شَرطة خانتان للشهر شَرطة خانتان لليوم

source: Start time format two digit hours colon two digit minutes
ar: صيغة توقيت البدء خانتان للساعات نقطتان عموديتان خانتان للدقائق

source: time
ar: الوقت

source: (Optional)
ar: (اختياري)

source: Due Time format two digit hours colon two digit minutes
ar: صيغة موعِد التسليم خانتان للساعات نقطتان عموديتان خانتان للدقائق

source: Add Unit
ar: أضِف وِحدة

source: Add All Units
ar: أضِف جميع الوِحدات

source: All units have been added.
ar: تمت إضافة جميع الوحدات

source: View gradebook
ar: اعرض سجل العلامات

source: Download student grades
ar: تنزيل ملف علامات الطلاب

source: Print or share your certificate:
ar: اطبع أو شارك شهادتك:

source: Click the link to see my certificate.
ar: انقر على الرابط لرؤية شهادتي.

source: Post on Facebook
ar: انشر على فيسبوك

source: Share on Twitter
ar: شارك على تويتر

source: Tweet this Accomplishment. Pop up window.
ar: غرّد هذا الإنجاز. نافذة منبثقة.

source: Add to LinkedIn Profile
ar: أضِف إلى ملفي الشخصي على لينكد إن

source: Add to Mozilla Backpack
ar: إضافة إلى حقيبة موزيلا

source: Print Certificate
ar: اطبع الشهادة

source: {platform_name} Home
ar: صفحة {platform_name} الرئيسيّة

source: Noted by
ar: لاحظها

source: Supported by the following organizations
ar: مدعومة من المؤسسات التالية

source: Awarded to:
ar: منحت إلى:

source: For tips and tricks on printing your certificate, view the {link_start}Web Certificates help documentation{link_end}.
ar: للحصول على نصائح وحيل عند طباعة الشهادة، يمكنك الاطلاع على {link_start}مساعدة شهادات الويب{link_end}.

source: Cannot Find Certificate
ar: لم نعثُر على الشهادة

source: We cannot find a certificate with this URL or ID number. If you are trying to validate a certificate, make sure that the URL or ID number is correct. If you are sure that the URL or ID number is correct, contact support.
ar: لم نعثُر على شهادة لها هذا الرابط أو المعرِّف. إذا كنت تحاول توثيق شهادة، نرجو منك التأكّد من صحّة الرابط أو المعرِّف. يمكنك الاتصال بفريق الدعم في حال كنت متأكدّا من صحّة الرابط أو المعرِّف.

source: Invalid Certificate Configuration.
ar: إعدادات الشهادة غير صالحة.

source: There is a problem with this certificate.
ar: توجد مشكلة في هذه الشهادة.

source: To resolve the problem, your partner manager should verify that the following information is correct.
ar: لحلّ المشكلة، يجب أن يثبت مدير الموسسة الشريكة صحّة المعلومات التالية.

source: The institution's logo.
ar: شعار المؤسسة.

source: The institution that is linked to the course.
ar: المؤسسة التعليمية ذات الصلة بالمساق.

source: The course information in the Course Administration tool.
ar: معلومات المساق في أداة إدارة المساقات.

source: If all of the information is correct and the problem persists, contact technical support.
ar: إذا كانت جميع المعلومات صحيحة ومازالت المشكلة موجودة، اتصل بفريق الدعم الفني.

source: About edX Certificates
ar: عن شهادات edX

source: Checkout Cancelled
ar: أُلغي الدفع

source: Your transaction has been cancelled. If you feel an error has occurred, contact {email}.
ar: لقد أُلغيت عمليتك. إذا كنتَ ترى أن خطًأ قد وقع يرجى التواصل معنا على {email}.

source: Checkout Error
ar: خطأ في عملية الدفع

source: An error has occurred with your payment. <b>You have not been charged.</b> Please try to submit your payment again. If this problem persists, contact {email}.
ar: عذرًا، لقد حدث خطأ في تسديد دفعتك. <b> لم تتم عملية الدفع. </b>تُرجى منك إعادة محاولة الدفع. في حال استمرت المشكلة، تواصل معنا على {email}.

source: Loading Order Data...
ar: تحميل بيانات الطلبية...

source: Please wait while we retrieve your order details.
ar: يرجى الانتظار ريثما نحضر تفاصيل طلبيتك.

source: Enroll In {course_name} | Choose Your Track
ar: سجل في {course_name} | اختر مسارك

source: Sorry, there was an error when trying to enroll you
ar: نأسف لحدوث خطأ ما عند محاولة تسجيلك

source: Pursue Academic Credit with a Verified Certificate
ar: السعي للحصول على ساعات معتمدة بشهادة موثَّقة

source: Become eligible for academic credit and highlight your new skills and knowledge with a verified certificate. Use this valuable credential to qualify for academic credit, advance your career, or strengthen your school applications.
ar: تأهَّل للحصول على ساعات معتمدة وسلِّط الضوء على مهاراتك ومعارفك الجديدة من خلال شهادة موثَّقة. استخدم هذه الشهادة لتتأهّل للحصول على ساعات معتمدة، أو تطوّر مهنتك، أو تعزّز طلب تسجيلك في الجامعة.

source: Benefits of a Verified Certificate
ar: فوائد الشهادة الموثَّقة

source: {b_start}Eligible for credit:{b_end} Receive academic credit after successfully completing the course
ar: {b_start} تأهِّلك للحصول على ساعات معتمدة:{b_end} احصل على ساعات أكاديمية معتمدة بعد استكمالك للمساق بنجاح.

source: {b_start}Official:{b_end} Receive an instructor-signed certificate with the institution's logo
ar: {b_start} رسمية:{b_end} احصل على شهادة موقَّعة من المدرِّس وتحمل شعار المؤسّسة.

source: {b_start}Easily shareable:{b_end} Add the certificate to your CV or resume, or post it directly on LinkedIn
ar: {b_start} تسهُل مشاركتها:{b_end} أضِف شهادتك إلى سيرتك الذاتية، أو انشرها مباشرةً على LinkedIn.

source: Pursue a Verified Certificate
ar: اسعَ للحصول على شهادة موثّقة

source: Highlight your new knowledge and skills with a verified certificate. Use this valuable credential to improve your job prospects and advance your career, or highlight your certificate in school applications.
ar: سلِّط الضوء على مهاراتك ومعرفتك الجديدة بالحصول على شهادة موثقة. استخدم هذه الشهادة القيّمة لتحسين فرص عملك والتقدّم في مسيرتك المهنية، أو دعم شهاداتك عند تقديم طلب التحاق في الجامعة.

source: {b_start}Official: {b_end}Receive an instructor-signed certificate with the institution's logo
ar: {b_start} رسمية:{b_end} احصل على شهادة موقَّعة من المدرِّس وتحمل شعار المؤسّسة.

source: {b_start}Easily shareable: {b_end}Add the certificate to your CV or resume, or post it directly on LinkedIn
ar: {b_start} تسهُل مشاركتها:{b_end} أضِف شهادتك إلى سيرتك الذاتية، أو انشرها مباشرةً على LinkedIn.

source: {b_start}Motivating: {b_end}Give yourself an additional incentive to complete the course
ar: {b_start} مشجِّعة: {b_end}أعطِ نفسك حافزًا إضافيًا لإتمام المساق.

source: Audit This Course
ar: سجِّل في هذا المساق كمستمع

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums.
ar: استمع إلى دروس هذا المساق مجّانًا واستمتع بإمكانية استخدام كافة مواد المساق وأنشطته واختباراته ومنتدياته.

source: Audit This Course (No Certificate)
ar: سجِّل في هذا المساق كمستمع (دون شهادة)

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums. {b_start}Please note that this track does not offer a certificate for learners who earn a passing grade.{b_end}
ar: استمع إلى دروس هذا المساق مجّانًا واستمتع بإمكانية استخدام كافة مواد المساق وأنشطته واختباراته ومنتدياته. {b_start} يُرجى الانتباه، لا يُمنح المتعلّمون الحاصلون على درجة النجاح في هذا المساق شهادةً موثّقة. {b_end}

source: {chapter} current chapter
ar: الفصل الحالي {chapter}

source: {span_start}current section{span_end}
ar: {span_start}القسم الحالي{span_end}

source: due {date}
ar: موعِد التسليم {date}

source: {section_format} due {{date}}
ar: يجب تسليم {section_format} في موعد أقصاه {{date}}

source: This content is graded
ar: تم تقييم هذا المحتوى

source: An error occurred. Please try again later.
ar: حدث خطأ. تُرجى إعادة المحاولة فيما بعد.

source: The currently logged-in user account does not have permission to enroll in this course. You may need to {start_logout_tag}log out{end_tag} then try the enroll button again. Please visit the {start_help_tag}help page{end_tag} for a possible solution.
ar: ليس لحساب المستخدم الحاليّ صلاحية الالتحاق بهذا المساق. قد تحتاج إلى {start_logout_tag}الخروج{end_tag} ثمّ إعادة تجربة زرّ الالتحاق. تُرجى زيارة {start_help_tag}صفحة المساعدة{end_tag} للبحث عن الحلول الممكنة.

source: You are enrolled in this course
ar: أنت ملتحق في هذا المساق

source: View Course
ar: اعرض المساق

source: This course is in your <a href="{cart_link}">cart</a>.
ar: هذا المساق موجود في <a href="{cart_link}">سلّتك</a>.

source: Course is full
ar: المساق كامل الآن

source: Enrollment in this course is by invitation only
ar: يجري التسجيل في هذا المساق بموجب دعوة فقط

source: Enrollment is Closed
ar: أُغلِق باب التسجيل

source: Add {course_name} to Cart <span>({price} USD)</span>
ar: أضف {course_name} إلى السلّة <span>({price} دولار أمريكي)</span>

source: Enroll in {course_name}
ar: سجل في {course_name}

source: View About Page in studio
ar: اعرض صفحة اللمحة في استوديو

source: Classes Start
ar: تبدأ الحصص

source: Classes End
ar: تنتهي الحصص

source: Estimated Effort
ar: الجهد المقدَّر

source: Prerequisites
ar: المتطلّبات الأساسية

source: You must successfully complete {link_start}{prc_display}{link_end} before you begin this course.
ar: يجب أن تنجح في {link_start}{prc_display}{link_end} قبل أن تبدأ بهذا المساق.

source: Additional Resources
ar: مصادر إضافية

# self
source: enroll
ar: تسجيل

source: Share with friends and family!
ar: أخبر أصدقاءك وعائلتك!

source: I just enrolled in {number} {title} through {account}: {url}
ar: سجّلتُ لتوّي في {number} {title} باستخدام الحساب {url} :{account}

source: Take a course with {platform} online
ar: التحِق بمساق على منصة {platform} عبر الإنترنت

source: I just enrolled in {number} {title} through {platform} {url}
ar: سجّلتُ لتوّي في {number} {title} من خلال {platform} {url}

source: Tweet that you've enrolled in this course
ar: إرسال تغريدة بأنّك التحقت بهذا المساق
