Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Specify what student can learn from the course.
ar: حدد ما يمكن أن يتعلمه الطلاب في هذا المساق.

source: Edraak University: Enable ID Tab
ar: الرقم الجامعي: فعّل صفحة الرقم الجامعي

source: Set this to "true" (without quotes) to show the University ID tab in this course. However this requires the Edraak University app to be enabled by your system administrator.
ar: اجعل قيمتها "true" (دون علامتي الاقتباس) لإظهار تبويب الرقم الجامعي في هذا المساق. ولكن هذا أن يقوم مدير النظام لديك بتفعيل تطبيق الرقم الجامعي.

source: Course Instructor
ar: مدرِّس المساق

source: Enter the details for Course Instructor
ar: أدخل معلومات مدرس المساق

source: Add Unsupported Problems and Tools
ar: أضف أدوات ومسائل غير مدعومة

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
ar: أدخل true أو false. في حالة true، يمكنك إضافة المسائل والأدوات غير المدعومة لمساقك في Studio. لا ينصح باستخدام المسائل والأدوات غير المدعومة في المساقات بسبب عدم الامتثال لواحد أو أكثر من الشروط الأساسية، مثل الاختبار وسهولة الوصول ودعم اللغات المتعددة والتوثيق.

source: Highlights Enabled for Messaging
ar: النقاط المهمّة مفعلة للرسائل

source: Enter true or false. If true, any highlights associated with content in the course will be messaged to learners at their scheduled time.
ar: أدخِل "true" أو "false" . اذا اخترت الخيار "true" سيتم ارسال رسالة بالنقاط المهمة المرتبطة بالمحتوى للمتعلمين حسب الوقت المجدول

source: Specialization slug (id)
ar: (id) عنوان التخصص

source: Enter the slug (id) for the specialization which this course belongs to.
ar: ادخل (id) Slug التخصص المربوط به المساق

source: General
ar: عام

source: {assignment_type} = {weighted_percent:.2%} of a possible {weight:.2%}
ar: {assignment_type} = {weighted_percent:.2%} من ضمن {weight:.2%} ممكنة.

source: Generated
ar: أُنشئ

source: {section_type} {index} Unreleased - 0% (?/?)
ar: {section_type} {index}غير صادر - 0% (?/?)

source: The lowest {drop_count} {section_type} scores are dropped.
ar: الاقل من {drop_count} {section_type} سيتم الغاؤه

source: {section_type} Average = {percent:.0%}
ar: {section_type}معدل = {percent:.0%}

source: {short_label} Avg
ar: معدل {short_label}

source: Text
ar: نصّ

source: Html contents to display for this module
ar: محتويات HTML التي يجب عرضها لهذه الوحدة

source: Source code for LaTeX documents. This feature is not well-supported.
ar: النصّ المصدري لمستندات LaTeX . هذه الميزة غير مدعومة جيّدًا.

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
ar: يُرجى اختيار ’مرئي‘ أو ’Visual‘ لإدخال المحتوى وتمكين المحرّر من إنشاء نصوص بلغة HTML تلقائيًا. يمكن اختيار "خام" أو ’Raw‘ لتعديل نص HTML مباشرةً. في حال غيّرت هذا الإعداد، يجب حفظ المكوِّن أولًا ثمّ إعادة فتحه لإجراء التعديل.

source: Editor
ar: محرِّر

source: Visual
ar: مرئي

source: Raw
ar: خامْ

source: Hide Page From Learners
ar: اخفِ الصفحة عن أعيُن الطلاب

source: If you select this option, only course team members with the Staff or Admin role see this page.
ar: إذا حددت هذا الخيار، سيتمكن أعضاء فريق الدورة من المشرفين والطاقم فقط برؤية هذه الصفحة.

source: HTML for the additional pages
ar: لغة HTML للصفحات الإضافية

source: List of course update items
ar: قائمة عناصر تحديث المساق

source: Image Annotation
ar: ملاحظات الصورة

source: Tags for Assignments
ar: وسوم الواجبات

source: Add tags that automatically highlight in a certain color using the comma-separated form, i.e. imagery:red,parallelism:blue
ar: أضِف وسومًا للإبراز آليًّا بلون معين وذلك باستخدام الهيئة المفصولة بفاصلة، مثل: imagery:red,parallelism:blue

source: Location of Annotation backend
ar: مكان البرنامج الخلفيّ للملاحظات

source: Url for Annotation Storage
ar: رابط مخزَن الملاحظات

source: Secret string for annotation storage
ar: النص السرّي لمخزَن الملاحظات

source: Secret Token String for Annotation
ar: النص الرمزي السرّي للملاحظات

source: Default Annotations Tab
ar: تبويب الملاحظات الافتراضي

source: Select which tab will be the default in the annotations table: myNotes, Instructor, or Public.
ar: اختر التبويبة التي ستُعتمد كتبويبة افتراضية لجدول الملاحظات: ملاحظاتي، المدرِّس، أو الجميع.

source: Email for 'Instructor' Annotations
ar: البريد الإلكتروني لمدرِّس المساق

source: Email of the user that will be attached to all annotations that will be found in 'Instructor' tab.
ar: بريد المستخدم الإلكتروني الذي سيُرفَق بجميع الملاحظات التوضيحية الموجودة ضمن تبويبة المدرِّس.

source: Mode for Annotation Tool
ar: وضع أداة الملاحظات

source: Type in number corresponding to following modes: 'instructor' or 'everyone'
ar: اكتب الرقم المرتبط بالأوضاع التالية: "المدرِّس" أو "الجميع"

source: No email address found.
ar: لم يُعثر على عنوان بريد الإلكتروني.

source: Any Type
ar: أي نوع

source: Library
ar: مكتبة

source: Select the library from which you want to draw content.
ar: اختَر المكتبة التي ترغب باستخراج محتوىً منها.

source: Library Version
ar: نسخة المكتبة

source: Determines how content is drawn from the library
ar: يُحدّد كيفية استخراج المحتوى من المكتبة

source: Choose n at random
ar: اختر القيمة n عشوائيًّا

source: Count
ar: العدد

source: Enter the number of components to display to each student.
ar: أدخِل عدد المكوِّنات الواجب عرضها على كل طالب.

source: Problem Type
ar: نوع المسألة

source: Choose a problem type to fetch from the library. If "Any Type" is selected no filtering is applied.
ar: اختَر نوع مسألة معيّن لجلبه من المكتبة. لا يجري تطبيق أي ترشيح في حال اخترت "أي نوع" أو ’Any Type‘.

source: This component is out of date. The library has new content.
ar: هذا المكون قديم. حُدّثت المكتبة بمحتوى جديد الآن.

source: {refresh_icon} Update now.
ar: {refresh_icon} حدّث الآن.

source: Library is invalid, corrupt, or has been deleted.
ar: هذه المكتبة غير صالحة، أو تالفة، أو تم حذفها.

source: Edit Library List.
ar: عدِّل قائمة المكتبة.

source: This course does not support content libraries. Contact your system administrator for more information.
ar: لا يدعم هذا المساق مكتبات محتوى. يُرجى الاتّصال بمسؤول النظام للحصول على مزيد من المعلومات.

source: A library has not yet been selected.
ar: لم يتم اختيار مكتبة معيّنة بعد.

source: Select a Library.
ar: اختَر مكتبة.

source: There are no matching problem types in the specified libraries.
ar: لا توجد أنواع مسائل مطابقة في المكتبات المحدَّدة.

source: Select another problem type.
ar: اختَر نوع مسألة آخَر.

source: The specified library is configured to fetch {count} problem,
ar: ضُبِطت إعدادات المكتبات المحدّدة لعدم جلب أيّة مسائل،

source: but there is only {actual} matching problem.
ar: ولكن ليست هناك أيّ مسألة مطابقة.

source: Edit the library configuration.
ar: عدِّل إعدادات المكتبة.

source: Invalid Library
ar: مكتبة غير صالحة

source: No Library Selected
ar: لم يتم اختيار أيّ مكتبة

source: Library Display Name
ar: اسم المكتبة المعروض

source: Enter the names of the advanced components to use in your library.
ar: أدخِل أسماء المكوِّنات المتقدّمة التي ستُستخدم في مكتبتك.

source: The display name for this component. Analytics reports may also use the display name to identify this component.
ar: اسم العرض لهذا المكون. يمكن أيضاً للتقارير التحليلية استخدام اسم العرض لتعريف هذا العنصر.

source: LTI ID
ar: معرِّف LTI

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ar: أدخِل معرِّف LTI لـِمزوِّد LTI الخارجي. يجب ان تكون هذه القيمة نفس معرِّف LTI الذي أدخلته في إعدادات جواز مرور LTI في صفحة الإعدادات المتقدّمة. <br />ألقِ نظرة على {docs_anchor_open}توثيق edX لتكامل أدوات التعليم {anchor_close}LTI لمزيد من المعلومات المتعلقة بهذا الإعداد.

source: LTI URL
ar: رابط ’LTI‘

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ar: أدخِل رابط الأدة الخارجية التي يُطلقها هذا المكوِّن. يُستخدم هذا الإعداد فقط عندما تُضبط خاصية "إخفاء الأداة الخارجية" على القيمة ’false‘.<br />راجِع {docs_anchor_open} توثيق LTI edX{anchor_close} لمزيد من التفاصيل عن هذا الإعداد.

source: Custom Parameters
ar: المعامِلات المخصّصة

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
ar: إضافة زوج مفتاح/قيمة إلى أي معطيات مخصَّصة، مثل الصفحة التي يجب أن تظهر عند فتح كتابك الإلكتروني، أو لون الخلفية لهذا المكوِّن.<br />راجِع {docs_anchor_open}توثيق LTI edX{anchor_close} لمزيد من التفاصيل عن هذا الإعداد.

source: Open in New Page
ar: افتح في صفحة جديدة

source: Select True if you want students to click a link that opens the LTI tool in a new window. Select False if you want the LTI content to open in an IFrame in the current page. This setting is only used when Hide External Tool is set to False.
ar: اختر ’true‘ إذا أردت أن ينقر الطلّاب على رابط يفتح أداة ’LTI‘ في نافذة جديدة، أو اختر ’false‘ إذا أردت فتح محتوى ’LTI‘ داخل إطار ’IFrame‘ ضمن الصفحة الحاليّة. يُستخدَم هذا الإعداد فقط عند ضبط "إخفاء الأداة الخارجية" على القيمة ’false‘.

source: Scored
ar: مُصَحَّح

source: Select True if this component will receive a numerical score from the external LTI system.
ar: يُرجى اختيار ’true‘ إذا كان هذا المكوِّن سيستقبل قيمة عدديّة للنتيجة من نظام ’LTI‘ خارجي.

source: Weight
ar: الوزن

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
ar: أدخِل عدد النقاط المحتملة لهذا المكوِّن. القيمة الافتراضية هي 1.0، ويقتصر استخدام هذا الإعداد على ضبط خاصية ’Scored‘ على القيمة ’true‘.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
ar: أبقيت النتيجة في ’xblock KVS‘ -- مطابقة للنتيجة المنشورة في قاعدة بيانات django

source: Comment as returned from grader, LTI2.0 spec
ar: التعليق العائد من المصحِّح، حسب معيار LTI2.0

source: Hide External Tool
ar: اخفِ الأداة الخارجية

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
ar: اختَر ’true‘ إذا أردت استخدام هذا المكوِّن كحافظة مكان للمزامنة مع نظام تقييم خارجي بدلًا من إطلاق أداة خارجية. يخفي هذا الإعداد زر "إطلاق" وأي إطارات iFrames خاصّة بهذا المكوِّن.

source: Request user's username
ar: اطلب اسم المستخدِم

source: Select True to request the user's username.
ar: اختَر ’true‘ لطلب اسم المستخدم.

source: Request user's email
ar: اطلب البريد الإلكتروني للمستخدِم

source: Select True to request the user's email address.
ar: اختَر ’true‘ لطلب البريد الإلكتروني من المستخدم.

source: LTI Application Information
ar: معلومات تطبيق LTI

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
ar: أدخِل وصفًا لتطبيق الجهة الخارجيّة. وفي حال طلب اسم المستخدم و/أو البريد الإلكتروني، استخدم مربع النص هذا لإعلام المستخدمين عن سبب تمرير اسم المستخدم و/أو البريد الإلكتروني الخاص بهم إلى تطبيق لجهة خارجيّة.

source: Button Text
ar: نص الزر

source: Enter the text on the button used to launch the third party application.
ar: أدخِل نص الزر المستخدم لإطلاق تطبيق الجهة الخارجية.

source: Accept grades past deadline
ar: اقبَل العلامات بعد آخر موعِد للتسليم

source: Select True to allow third party systems to post grades past the deadline.
ar: اختَر ’true‘ للسماح لأنظمة خارجية بنشر العلامات بعد الموعد النهائي.

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
ar: تعذَّر إعراب المُعامِل المخصّص: {custom_parameter}. يجب أن يكون نصًا على شكل "x=y".

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
ar: تعذَّر إعراب جواز مرور LTI التالي: {lti_passport}. يجب أن يكون نصًّا بهيئة "id:key:secret".

source: Due Date
ar: تاريخ التسليم

source: Enter the default date by which problems are due.
ar: أدخِل موعد التسليم الافتراضي المُحدّد لحلّ المسائل.

source: If true, can be seen only by course staff, regardless of start date.
ar: عند اختيارك للقيمة ’true‘، سيُتاح المحتوى لطاقم المساق فقط، بغض النظر عن تاريخ بدء المساق.

source: GIT URL
ar: رابط GIT

source: Enter the URL for the course data GIT repository.
ar: أدخِل رابط مستودع GIT لبيانات المساق.

source: XQA Key
ar: مفتاح ’XQA‘

source: This setting is not currently supported.
ar: هذا الإعداد غير مدعوم حاليًّا.

source: Enter the location of the annotation storage server. The textannotation, videoannotation, and imageannotation advanced modules require this setting.
ar: أدخِل موقع خادم تخزين الملاحظات. هذا الإعداد مطلوب في الوحدات المتعلقة بملاحظات النصوص والفيديو والصور.

source: URL for Annotation Storage
ar: رابط مخزن الملاحظات

source: Enter the secret string for annotation storage. The textannotation, videoannotation, and imageannotation advanced modules require this string.
ar: أدخِل النصّ السريّ لمخزن الملاحظات. تتطلّب هذا النَّصَّ كلٌ من الوحدات المتعلقة بملاحظات النصوص والفيديو والصور.

source: Enter the ids for the content groups this problem belongs to.
ar: أدخِل معرفات مجموعات المحتوى التي تنتمي إليها هذه المسألة.

source: Specify when the Show Answer button appears for each problem. Valid values are "always", "answered", "attempted", "closed", "finished", "past_due", "correct_or_past_due", and "never".
ar: حدِّد متى يظهر زر "اعرض الإجابة" لكل مسألة. والقيم الصالحة هي "دومًا"، و"مُجابة" و"جرت محاولة حلها"، و"أغُلِقت"، و"استُكمِلت"،و"انقضى موعدها" و "صحيحة أو انقضى موعدها"، و"نهائيًّا".

source: Specify when to show answer correctness and score to learners. Valid values are "always", "never", and "past_due".
ar: حدّد وقت الكشف عن صحة الإجابة والتقييم للطلاب. القيم المتاحة هي "دومًا" و"نهائيًا" و"مضى استحقاقها".

source: Specify the default for how often variable values in a problem are randomized. This setting should be set to "never" unless you plan to provide a Python script to identify and randomize values in most of the problems in your course. Valid values are "always", "onreset", "never", and "per_student".
ar: يُرجى تحديد الإعداد الافتراضي للمرّات التي تُرتَّب فيها القيم المتغيِّرة ترتيبًا عشوائيًا. يجب ضبط هذا الإعداد على "نهائيًا" ما لم تكن تخطِّط لتوفير برنامج مبرمج بلغة بايثون لتحديد القيم وترتيبها عشوائيًا في معظم مسائل مساقك. والقيم الصالحة هي "دائمًا" و"عند مسح الإجابة" و"نهائيًا"،و"لكل_طالب".

source: Days Early for Beta Users
ar: الأيّام المبكِرة لمستخدمي بيتا

source: Enter the number of days before the start date that beta users can access the course.
ar: إدخال عدد الأيّام السابقة لتاريخ البدء والتي يمكن لمستخدمي بيتا الدخول فيها إلى المساق.

source: Static Asset Path
ar: مسار الأصول الثابتة

source: Enter the path to use for files on the Files & Uploads page. This value overrides the Studio default, c4x://.
ar: أدخِل المسار الذي يجب استخدامه للملفّات على صفحة "الملفات والمرفوعات". تُلغي هذه القيمة قيمة استوديو الافتراضية، //:c4x.

source: Enable LaTeX Compiler
ar: فعِّل مصرِّف LaTeX

source: Enter true or false. If true, you can use the LaTeX templates for HTML components and advanced Problem components.
ar: أدخِل ’true‘ أو ’false‘. باختيارك للقيمة ’true‘، ستتمكّن من استخدام نماذج ’LaTeX‘ للمكوِّنات المُصاغة بلغة HTML والمكوِّنات المتقدمة للمسائل.

source: Enter the maximum number of times a student can try to answer problems. By default, Maximum Attempts is set to null, meaning that students have an unlimited number of attempts for problems. You can override this course-wide setting for individual problems. However, if the course-wide setting is a specific number, you cannot set the Maximum Attempts for individual problems to unlimited.
ar: أدخِل العدد الأقصى للمحاولات المسموحة للطالب للإجابة عن المسائل. القيمة الافتراضيّة هي "null"، بمعنى أنّه يُتاح للطالب عدد محاولات غير محدود. يمكنك تغيير هذا الإعداد بحيث ينطبق على مسائل محدّدة في المساق دون سواها. في حين أنه، إذا ضُبطت عدد المحاولات لجميع مسائل المساق بقيمة معينة، فلا يمكنك ضبط بعض المسائل ليُسمح فيها بعدد محاولات غير محدود.

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use in this course for the specified duration. Do not share the API key with other courses. Notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ar: أدخِل مفتاح واجهة برمجة التطبيقات، الذي تقدّمه شركة ماثووركس، لاستخدام الخدمة المستضافة للغة MATLAB. ويُمنح هذا المفتاح للاستخدام الحصري في هذا المساق خلال المدّة المحدّدة له. لا تستخدم مفتاح واجهة برمجة التطبيقات هذا في مساقات أخرى. بلِّغ ماثووركس فورًا إذا كنت تعتقد بأنّ المفتاح قد عُرِف أو سُرِق. للحصول على مفتاح لمساقك، أو للإبلاغ عن مشكلة ما، تُرجى مراسلة moocsupport@mathworks.com.

source: Group Configurations
ar: إعدادات المجموعة

source: Enter the configurations that govern how students are grouped together.
ar: أدخِل الإعدادات التي تحكم كيفية جمع الطلاب في مجموعات.

source: Enable video caching system
ar: فعِّل نظام التخزين المؤقّت للفيديوهات

source: Enter true or false. If true, video caching will be used for HTML5 videos.
ar: أدخِل ’true‘ أو ’false‘. اذا اخترت ’true‘، ستُستخدم خاصية التخزين المؤقّت لفيديوهات HTML5.

source: Enable video auto-advance
ar: فعِّل خاصية المستوى المتقدم لأتوماتيكي للفيديوهات

source: Specify whether to show an auto-advance button in videos. If the student clicks it, when the last video in a unit finishes it will automatically move to the next unit and autoplay the first video.
ar: حدد ما إذا كنت تريد إظهار زر التقدم التلقائي في مقاطع الفيديو أم لا. إذا نقر الطالب عليه ، عند انتهاء مقطع الفيديو الأخير في الوحدة ، سينتقل تلقائيًا إلى الوحدة التالية ويقوم بتشغيل الفيديو الأول تلقائيًا

source: Video Pre-Roll
ar: إعلان يسبق الفيديو

source: Identify a video, 5-10 seconds in length, to play before course videos. Enter the video ID from the Video Uploads page and one or more transcript files in the following format: {format}. For example, an entry for a video with two transcripts looks like this: {example}
ar: حدّد فيديو بطول 5-10 ثوانٍ لتشغيله قبل فيديوهات المساق. أدخل معرِّف الفيديو من خلال صفحة رفع الفيديو؛ بالإضافة إلى ملف نصّوص واحد أو أكثر وذلك وفق الصيغة التالية: {format}. فمثلًا، ستبدو الصيغة المُدخلة لملف فيديو ذي ملفّي نصوي بالشكل: {example}.

source: Show Reset Button for Problems
ar: أظهر زر مسح الإجابة للمسائل

source: Enter true or false. If true, problems in the course default to always displaying a 'Reset' button. You can override this in each problem's settings. All existing problems are affected when this course-wide setting is changed.
ar: أدخِل ’true‘ أو ’false‘. باختيارك للقيمة ’true‘، ستعرض مسائل المساق زر مسح الإجابة افتراضيًّا. يمكنك تجاوز هذا الإعداد بتعديل إعدادات كل مسألة على حدة. ستتأثّر جميع المسائل الموجودة بتغيير هذا الإعداد.

source: Enable Student Notes
ar: فعِّل ملاحظات الطلاب

source: Enter true or false. If true, students can use the Student Notes feature.
ar: أدخِل ’true‘ أو ’false‘. يسمح اختيارك للقيمة ’true‘ للطلاب باستخدام ميّزة ’ملاحظات الطلّاب‘.

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
ar: يحدّد فيما إذا كانت ملاحظات الطلّاب مرئيّة في المساق. كما ويمكن للطلّاب اختيار إظهار أو إخفاء ملاحظاتهم في محتويات المساق.

source: Tag this module as part of an Entrance Exam section
ar: أشِر إلى هذه الوحدة على أنّها جزء من قسم خاص بامتحان القبول

source: Enter true or false. If true, answer submissions for problem modules will be considered in the Entrance Exam scoring/gating algorithm.
ar: أدخِل ’true‘ أو ’false‘. باختيارك للقيمة ’true‘، ستُحتسب إجابات وحدات المسائل كجزء من خوارزمية تقييم امتحان القبول في المساق.

source: Enrollment Track Groups
ar: مجموعات تتبع مسارات التسجيل

source: Partition for segmenting users by enrollment track
ar: نظام فواصل يستخدم لتجزئة المستخدمين وفقًا لمسار التسجيل

source: Whether this student has voted on the poll
ar: ما إذا كان هذا الطالب قد صوت في الاستطلاع

source: Student answer
ar: إجابة الطالب

source: Poll answers from all students
ar: إجابات الاستطلاع من جميع الطلاب

source: Poll answers from xml
ar: إجابات الاستطلاع من xml

source: Poll question
ar: سؤال الاستطلاع

source: Enter the date by which problems are due.
ar: أدخِل موعِد تسليم المسائل.

source: Hide sequence content After Due Date
ar: اخفِ محتوى التسلسل بعد التاريخ المحدد

source: If set, the sequence content is hidden for non-staff users after the due date has passed.
ar: عند الضبط، يتم إخفاء محتوى التسلسل للمستخدمين من غير الطاقَم بعد مرور التاريخ المحدد.

source: Is Entrance Exam
ar: امتحان قبول

source: Tag this course module as an Entrance Exam. Note, you must enable Entrance Exams for this course setting to take effect.
ar: حدّد وحدة المساق هذه على أنّها "امتحان قبول". لاحظ أنّ عليك تفعيل خاصية "امتحان القبول" ليعمل هذا الإعداد في المساق.

source: Is Time Limited
ar: محدَّد التوقيت

source: This setting indicates whether students have a limited time to view or interact with this courseware component.
ar: يحدِّد هذا الإعداد ما إذا كان للطلّاب وقت محدود لاستعراض أو التفاعل مع مكوِّنات المادة التعليمية.

source: Time Limit in Minutes
ar: الحدُّ الزمني بالدقائق

source: The number of minutes available to students for viewing or interacting with this courseware component.
ar: عدد الدقائق المُتاحة للطلّاب لعرض أو التفاعل مع مكوِّنات المادة التعليمية.

source: Is Proctoring Enabled
ar: هل المراقَبة مفعَّلة

source: This setting indicates whether this exam is a proctored exam.
ar: يحدِّد هذا الإعداد ما إذا كان هذا الامتحان مراقَبًا.

source: Software Secure Review Rules
ar: قواعد المراجعة الآمنة للبرنامج

source: This setting indicates what rules the proctoring team should follow when viewing the videos.
ar: يُحدّد هذا الإعداد القواعد التي يجب أن يتبعها فريق المراقبة عند عرض مقاطع الفيديو.

source: Is Practice Exam
ar: هل الامتحان تحضيري

source: This setting indicates whether this exam is for testing purposes only. Practice exams are not verified.
ar: يحدِّد هذا الإعداد ما إذا كان هذا الامتحان مخصَّصًا لأغراض الاختبار فقط. الامتحانات التحضيرية غير موثَّقة.

source: This exam is hidden from the learner.
ar: هذا الامتحان لا يظهر للمتعلم

source: Because the course has ended, this assignment is hidden from the learner.
ar: بسبب انتهاء المساق، تم إخفاء هذا الواجب عن الطالب.

source: Because the due date has passed, this assignment is hidden from the learner.
ar: بسبب انتهاء المساق، تم إخفاء هذا الواجب عن الطالب.

source: This subsection is unlocked for learners when they meet the prerequisite requirements.
ar: هذا القسم الفرعي متاح للمتعلمين عند استيفائهم للمتطلبات.

source: This section is a prerequisite. You must complete this section in order to unlock additional content.
ar: هذا القسم متطلب أساسي عليك إتمامه لتتمكن من مشاهدة المزيد من المحتوى

source: A list summarizing what students should look forward to in this section.
ar: قائمة تلخص ما ينبغي أن يتطلع إليه الطلاب في هذا القسم.

source: Group ID {group_id}
ar: معرِّف للمجموعة {group_id}

source: Not Selected
ar: غير محدَّد

source: The display name for this component. (Not shown to learners)
ar: اسم العرض لهذا العنصر. (لا يظهر للطلّاب)

source: Content Experiment
ar: تجربة المحتوى
