Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: You need a computer that has a webcam. When you receive a browser prompt, make sure that you allow access to the camera.
ar: تحتاج إلى حاسوب مزوَّد بكاميرا. وعندما تتلقّى تنبيهًا من المتصفّح، تأكّد من السماح له باستخدام الكامرا.

source: Photo Identification
ar: وثيقة إثبات شخصية فيها صورة

source: You need a driver's license, passport, or other government-issued ID that has your name and photo.
ar: تحتاج إلى هوية أو رخصة قيادة أو جواز سفر أو أيّ وثيقة هويّة أخرى حكومية عليها اسمك وصورتك.

source: Take Your Photo
ar: التقط صورتك

source: When your face is in position, use the camera button {icon} below to take your photo.
ar: عندما يكون وجهك في المكان الصحيح، استخدم أيقونة الكامرا {icon} أدناه لالتقاط صورتك.

source: To take a successful photo, make sure that:
ar: لالتقاط صورة ناجحة، تأكّد من أنّ:

source: Your face is well-lit.
ar: الإضاءة جيّدة على وجهك.

source: Your entire face fits inside the frame.
ar: وجهك بأكمله داخل إطار الصورة.

source: The photo of your face matches the photo on your ID.
ar: الصورة على بطاقتك الشخصية صورة وجهك.

source: To use the current photo, select the camera button {icon}. To take another photo, select the retake button {icon}.
ar: لاستخدام الصورة الحالية، اختر زر الكاميرا {icon}. لالتقاط صورة أخرى، اختر زر إعادة التصوير {icon}

source: Frequently Asked Questions
ar: الأسئلة الشائعة

source: Why does %(platformName)s need my photo?
ar: لماذا تحتاج %(platformName)s إلى صورتي؟

source: As part of the verification process, you take a photo of both your face and a government-issued photo ID. Our authorization service confirms your identity by comparing the photo you take with the photo on your ID.
ar: كجزء من عملية التحقّق، عليك التقاط صورة لكلٍّ من وجهك ووثيقة إثبات شخصية فيها صورة صادرة عن جهة حكومية. ثمّ يعمل قسمنا المسؤول عن خدمة التحقّق على تأكيد هويّتك بمقارنة الصورة التي تلتقطها مع الصورة الموجودة في هذه الوثيقة.

source: What does %(platformName)s do with this photo?
ar: ما ستفعل %(platformName)s بهذه الصورة؟

source: We use the highest levels of security available to encrypt your photo and send it to our authorization service for review. Your photo and information are not saved or visible anywhere on %(platformName)s after the verification process is complete.
ar: نستخدم أعلى مستويات الأمن المتوفّرة لتشفير صورتك وإرسالها إلى قسمنا المسؤول عن عملية التحقّق لمراجعتها. إنّ صورتك ومعلوماتك لا تُحفَّظ أو تظهر في أي مكان في موقع %(platformName)s بعد أن تُستكمل عملية التحقّق.

source: Next: %(nextStepTitle)s
ar: التالي: %(nextStepTitle)s

source: Take a Photo of Your ID
ar: التقط صورة لبطاقتك الشخصية

source: Use your webcam to take a photo of your ID. We will match this photo with the photo of your face and the name on your account.
ar: استخدم الكامرا لالتقاط صورة لهويتك. ثمّ سنطابق هذه الصورة مع صورة وجهك واسمك الموجودين في حسابك.

source: You need an ID with your name and photo. A driver's license, passport, or other government-issued IDs are all acceptable.
ar: تحتاج إلى وثيقة شخصية تحمل اسمك وصورتك. يمكنك استخدام رخصة القيادة، أو جواز السفر، أو بطاقة شخصية أخرى صادرة عن الحكومة، فجميع هذه الوثائق مقبولة.

source: Tips on taking a successful photo
ar: نصائح لالتقاط صورة جيّدة

source: Ensure that you can see your photo and read your name
ar: تأكّد من أنّ بإمكانك أن ترى صورتك وتقرأ اسمك

source: Make sure your ID is well-lit
ar: تأكّد من أنّ الإضاءة جيّدة على بطاقتك الشخصية

source: Once in position, use the camera button {icon} to capture your ID
ar: استخدم زر الكاميرا {icon} لالتقاط صورة بطاقتك الشخصية

source: Use the retake photo button if you are not pleased with your photo
ar: استخدم زر إعادة التقاط الصورة إذا لم تكن راضيًا عن جودة صورتك.

source: Preview of uploaded image
ar: عاين الصورة التي قمت برفعها

source: Upload an image or capture one with your web or phone camera.
ar: ارفع أو التقط صورة بكامرا الويب أو كامرا الهاتف.

source: Use your webcam to take a photo of your face. We will match this photo with the photo on your ID.
ar: استخدم كامرا الويب لالتقاط صورة لوجهك. سنطابق هذه الصورة مع الصورة الموجودة على بطاقتك الشخصية.

source: Make sure your face is well-lit
ar: تأكّد من أنّ الإضاءة جيّدة على وجهك

source: Be sure your entire face is inside the frame
ar: تأكّد من أنّ وجهك بأكمله داخل إطار الصورة

source: Once in position, use the camera button {icon} to capture your photo
ar: عندما تكون بوضع مناسب، استخدم زر الكامرا {icon} لالتقاط صورتك الشخصية

source: Can we match the photo you took with the one on your ID?
ar: هل يمكننا مطابقة الصورة التي التقطتها مع صورتك الموجودة على بطاقتك الشخصية؟

source: Thanks for returning to verify your ID in: {courseName}
ar: شكراً لعودتك لتأكيد هويّتك في : {courseName}

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email. After you complete activation you can return and refresh this page.
ar: تحتاج إلى تفعيل حسابك قبل أن تتمكّن من التسجيل في المساقات. تفقّد صندوق بريدك الإلكتروني باحثًا عن رسالة تفعيل. وبعد أن تنتهي من التفعيل، يمكنك العودة وإعادة فتح هذه الصفحة.

source: Activate Your Account
ar: فعِّل حسابك

source: Photo ID
ar: بطاقة هوية تحمل صورة

source: A driver's license, passport, or other government-issued ID with your name and photo
ar: يمكنك استخدام رخصة القيادة، أو جواز السفر، أو بطاقة شخصية أخرى صادرة عن الحكومة تحوي اسمك وصورتك

source: You are enrolling in: {courseName}
ar: أنت بصدد التسجيل في: {courseName}

source: You are upgrading your enrollment for: {courseName}
ar: أنت بصدد التسجيل للحصول على شهادة موثقة لمساق: {courseName}

source: You can now enter your payment information and complete your enrollment.
ar: يمكنك الآن إدخال معلومات الدفع واستكمال تسجيلك.

source: You can pay now even if you don't have the following items available, but you will need to have these by {date} to qualify to earn a Verified Certificate.
ar: يمكنك أن تدفع الآن وإن لم تكن لديك العناصر التالية، ولكن سيكون عليك توفيرها في موعد أقصاه {date} من أجل التأهّل لنيل "شهادة موثّقة".

source: An email has been sent to {userEmail} with a link for you to activate your account.
ar: أُرسِل رابط تفعيل الحساب إلى البريد الإلكتروني {userEmail}.

source: Why activate?
ar: لماذا أفعِّل حسابي؟

source: We ask you to activate your account to ensure it is really you creating the account and to prevent fraud.
ar: نطلب تفعيل الحساب لنتأكد من أن صاحب الحساب هو من يقوم بإنشائه، وذلك يساعد كثيراً في تجنب الاحتيال الإلكتروني.

source: You can pay now even if you don't have the following items available, but you will need to have these to qualify to earn a Verified Certificate.
ar: يمكنك أن تدفع الآن وإن لم تكن لديك العناصر التالية، لكن يجب عليك توفيرها من أجل التأهّل لنيل "شهادة موثّقة".

source: Government-Issued Photo ID
ar: بطاقة هوية تحمل صورة صادرة عن جهة حكومية

source: ID-Verification is not required for this Professional Education course.
ar: التحقّق من الهوية الشخصية غير مطلوب لمساق التعليم المهني هذا.

source: All professional education courses are fee-based, and require payment to complete the enrollment process.
ar: إنّ جميع مساقات التعليم المهني لها رسوم وتتطلّب الدفع لاستكمال عملية التسجيل.

source: You have already verified your ID!
ar: سبق أن قمنا بالتحقّق من هويتك!

source: Your verification status is good until {verificationGoodUntil}.
ar: حالة التحقق منك سليمة حتى {verificationGoodUntil}.

source: price
ar: التكلفة

source: Account Not Activated
ar: الحساب غير مفعّل

source: Upgrade to a Verified Certificate for {courseName}
ar: التسجيل للحصول على شهادة موثّقة لمساق {courseName}

source: Before you upgrade to a certificate track, you must activate your account.
ar: يجب عليك تفعيل حسابك أولًا قبل أن تسجّل للحصول على شهادة موثقة.

source: Check your email for an activation message.
ar: تفقّد حساب بريدك الإلكتروني بحثّا عن رسالة التفعيل.

source: Professional Certificate for {courseName}
ar: شهادة مهنية لمساق {courseName}

source: Verified Certificate for {courseName}
ar: شهادة موثّقة لمساق {courseName}

source: To receive a certificate, you must also verify your identity before {date}.
ar: لا بدّ من إثبات هويّتك قبل تاريخ {date} من أجل الحصول على شهادة.

source: To receive a certificate, you must also verify your identity.
ar: لا بدّ من إثبات هويّتك أيضًا للحصول على شهادة.

source: To verify your identity, you need a webcam and a government-issued photo ID.
ar: لتأكيد صحّة هويّتك، أنت بحاجة لكامرا وبطاقة هويّة حكومية تحمل صورة شخصيّة.

source: Your ID must be a government-issued photo ID that clearly shows your face.
ar: يجب أن تكون هويّتك بطاقة حكوميّة فيها صورة واضحة لوجهك.

source: You will use your webcam to take a picture of your face and of your government-issued photo ID.
ar: ستستخدم كامرة الويب لالتقاط صورة لوجهك ولهويّتك الشخصية.

source: Thank you! We have received your payment for {courseName}.
ar: شكراً لك! لقد استلمنا الرسوم التي دفعتها لمساق {courseName}

source: Next Step: Confirm your identity
ar: الخطوة التالية: تأكيد هويّتك

source: Check your email
ar: تفقَّد بريدك الإلكتروني

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email.
ar: تحتاج إلى تفعيل حسابك قبل أن تتمكّن من التسجيل في المساقات. تفقّد صندوق بريدك الإلكتروني بحثًا عن رسالة تفعيل.

source: A driver's license, passport, or government-issued ID with your name and photo.
ar: رخصة القيادة، أو جواز السفر، أو بطاقة شخصية صادرة عن الحكومة فيها اسمك وصورتك.

source: If you don't verify your identity now, you can still explore your course from your dashboard. You will receive periodic reminders from %(platformName)s to verify your identity.
ar: إذا لم تقم بتأكيد هويتك الآن، سيبقى بإمكانك استكشاف مساقك من خلال لوحتك التعليمية. ستتلقّى رسائل تذكيرية دوريًّا من %(platformName)sلتأكيد هويّتك.

source: Identity Verification In Progress
ar: يجري التحقّق من الهوية

source: We have received your information and are verifying your identity. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days). In the meantime, you can still access all available course content.
ar: لقد استلمنا معلوماتك ونتولّى حاليًا التحقّق من هويتك. ستجد رسالة على مكتبك عند اكتمال عملية التحقّق (عادةً خلال يوم أو اثنين). ويمكنك في الوقت الراهن الوصول إلى كافة محتويات المساق المُتاحة.

source: Return to Your Dashboard
ar: العودة إلى "لوحتي التعليمية"

source: Review Your Photos
ar: راجع صورك

source: Make sure we can verify your identity with the photos and information you have provided.
ar: يُرجى التأكّد من أنّ الصور والمعلومات التي قدّمتها تمكّننا من التحقّق من هويّتك.

source: Photo of %(fullName)s
ar: صورة لـ %(fullName)s

source: Photo of %(fullName)s's ID
ar: صورة البطاقة الشخصية لـ %(fullName)s

source: Photo requirements:
ar: متطلّبات الصورة:

source: Does the photo of you show your whole face?
ar: هل يظهر كلّ وجهك في صورتك؟

source: Does the photo of you match your ID photo?
ar: هل تتطابق صورتك مع الصورة التي تحملها بطاقتك الشخصية؟

source: Is your name on your ID readable?
ar: هل اسمك الموجود على بطاقتك الشخصية سهل القراءة؟

source: Does the name on your ID match your account name: %(fullName)s?
ar: هل يتطابق الاسم الذي تحمله بطاقتك الشخصية مع اسمك في الحساب: %(fullName)s؟

source: Edit Your Name
ar: عدِّل اسمك

source: Make sure that the full name on your account matches the name on your ID.
ar: تأكّد من أنّ الاسم الكامل الموجود في حسابك يتطابق مع الاسم الموجود على بطاقتك الشخصية.

source: Photos don't meet the requirements?
ar: ألا تلبّي الصور المتطلّبات؟

source: Retake Your Photos
ar: أعد التقاط صورك

source: Before proceeding, please confirm that your details match
ar: قبل المتابعة، يُرجى التأكّد من تطابق بياناتك

source: Don't see your picture? Make sure to allow your browser to use your camera when it asks for permission.
ar: ألا يمكنك رؤية صورتك؟ تأكّد من السماح لمتصفّحك باستخدام الكامرا عندما يطلب الإذن منك.

source: Live view of webcam
ar: عرض مباشر عبر الكاميرا

source: Retake Photo
ar: أعِد التقاط الصورة

source: Take Photo
ar: التقط الصورة

source: Bookmarked on
ar: تمّ وضع علامة مرجعيّة بتاريخ

source: You have not bookmarked any courseware pages yet
ar: لم تقم بإضافة أيٍ من صفحات البرامج التعليمية كإشارات مرجعية بعد

source: Use bookmarks to help you easily return to courseware pages. To bookmark a page, click "Bookmark this page" under the page title.
ar: استخدم الإشارات المرجعية لتساعدك في العودة إلى صفحات البرامج التعليمية بسهولة. لإضافة صفحة كإشارة مرجعية، قم بالنقر على "أضف الصفحة كإشارة مرجعية" تحت عنوان الصفحة.

source: Load next {num_items} result
ar: حمّل التالي {num_items} نتائج

source: Sorry, no results were found.
ar: عذرًا، لا توجد أي نتائج.

source: Share your "%(display_name)s" award
ar: شارك "%(display_name)s" جائزتك

source: Share
ar: شارك

source: Earned %(created)s.
ar: حصلت على %(created)s.

source: What's Your Next Accomplishment?
ar: ماهو إنجازك القادم؟

source: Start working toward your next learning goal.
ar: ابدأ العمل على تحقيق هدفك التالي.

source: Find a course
ar: ابحث عن مساق

source: You are currently sharing a limited profile.
ar: أنت حاليًّا تشارك ملفًّا شخصيًّا محدودًا.

source: This learner is currently sharing a limited profile.
ar: هذا المتعلم يشارك ملفاً شخصياً محدوداً.

source: Share on Mozilla Backpack
ar: شارك على حقيبة موزيلا

source: To share your certificate on Mozilla Backpack, you must first have a Backpack account. Complete the following steps to add your certificate to Backpack.
ar: لمشاركة شهادتك على حقيبة موزيلا، عليك أولاً إنشاء حساب حقيبة موزيلا. أكمل الخطوات التالية لإضافة شهادتك إلى الحقيبة.

source: Create a %(link_start)sMozilla Backpack%(link_end)s account, or log in to your existing account
ar: أنشئ حساب %(link_start)s حقيبة موزيلا %(link_end)s جديد، أو ادخل إلى حسابك

source: %(download_link_start)sDownload this image (right-click or option-click, save as)%(link_end)s and then %(upload_link_start)supload%(link_end)s it to your backpack.</li>
ar: %(download_link_start)s حمّل هذه الصورة (اضغط زر الفأرة الأيمن، ثم اختر حفظ باسم) %(link_end)s ومن ثم %(upload_link_start)sارفع الصورة%(link_end)s إلى حقيبة موزيلا.</li>

source: Limit Access
ar: حدّ من صلاحية الوصول

source: Select a prerequisite subsection and enter a minimum score percentage and minimum completion percentage to limit access to this subsection. Allowed values are 0-100
ar: اختر قسم متطلّب أساسي فرعي وأدخل النسبة المئوية الدنيا للعلامة للحّد من إمكانية الوصول إلى هذا القسم الفرعي.القيم المسموحة بين 0-100

source: Prerequisite:
ar: المتطلّب:

source: No prerequisite
ar: لا توجد متطلّبات

source: Minimum Score:
ar: الحدّ الأدنى للعلامة:

source: Minimum Completion:
ar: الحد الادني للاستكمال

source: The minimum score percentage must be a whole number between 0 and 100.
ar: يجب أن تكون النسبة المئوية الدنيا للمجموع عددّا صحيحًا بين 0 و 100.

source: The minimum completion percentage must be a whole number between 0 and 100.
ar: يجب ان تكون النسبة المئوية للحد الادنى لعلامة الاتمام عددا صحيحا بين 0 و100

source: Use as a Prerequisite
ar: استخدمه كمتطلّب

source: Make this subsection available as a prerequisite to other content
ar: اجعل من محتوى هذه القسم الفرعي متوفرًا كمتطلب لمحتوى آخر.

source: Active Uploads
ar: عمليات الرَفع النشطة

source: Read More
ar: اقرأ المزيد

source: details about the failure
ar: تفاصيل عن الفشل

source: Add Component:
ar: إضافة مكوِّن:

source: %(type)s Component Template Menu
ar: قائمة قوالِب مكوّنات %(type)s

source: Common Problem Types
ar: أنواع المسائل الشائعة

source: Supported
ar: مدعوم

source: Provisional
ar: مؤقت

source: Not Supported
ar: غير مدعوم

source: Fully Supported
ar: مدعوم تماماً

source: Provisionally Supported
ar: مدعوم مؤقتاً

source: Add New Component
ar: أضِف مكوِّنًا جديدًا

source: Deprecated
ar: أثريّ

source: List of uploaded files and assets in this course
ar: قائمة الملفات المرفوعة والمحتويات في هذا المساق

source: - Sortable
ar: - قابل للتصنيف

source: Show All
ar: أظهِر الكُل

source: Other
ar: غير ذلك

source: You haven't added any assets to this course yet.
ar: لم تُضِف أي محتوى إلى هذا المساق بعد.

source: Upload your first asset
ar: ارفع أول محتوى لك

source: close
ar: أغلِق

source: No description available
ar: لا يتوفّر أي وصف.

source: Open/download this file
ar: فتح/تنزيل هذا الملفّ

source: Studio:
ar: استوديو:

source: Web:
ar: الويب:

source: Delete this asset
ar: احذف هذ المحتوى

source: Lock this asset
ar: اقفل هذا المحتوى

source: Lock/unlock file
ar: اقفل/الغِ قفل الملفّ

source: ID
ar: المعرِّف

source: Certificate Details
ar: تفاصيل الشهادة

source: Course Title
ar: عنوان المساق

source: Course Title Override
ar: عنوان المساق كما سيظهر في الشهادة

source: Course Number
ar: رقم المساق

source: Course Number Override
ar: رقم المساق كما سيظهر في الشهادة

source: Certificate Signatories
ar: الموقّعون على الشهادة

source: It is strongly recommended that you include four or fewer signatories. If you include additional signatories, preview the certificate in Print View to ensure the certificate will print correctly on one page.
ar: يُوصى بشدة بتضمين 4 موقعيّن على الأكثر. راجع الشهادة في وضع ’مراجعة الطباعة‘ في حال إضافتك لمزيد من الموقعّين، لضمان طباعة الشهادة بالشكل الصحيح على صفحة واحدة.

source: Certificate Information
ar: معلومات الشهادة

source: Certificate Name
ar: اسم الشهادة

source: Name of the certificate
ar: اسم الشهادة

source: Description of the certificate
ar: وصف الشهادة

source: Course title
ar: عنوان المساق

source: Specify an alternative to the official course title to display on certificates. Leave blank to use the official course title.
ar: حدد بديلًا للعنوان الرسمي للمساق ليظهر على الشهادات. اتركه فارغًا لاستخدام العنوان الرسمي للمساق.

source: Add Additional Signatory
ar: أضِف مُوَقّعًا إضافيًا

source: (Add signatories for a certificate)
ar: (أضِف موقِّعين على شهادة)

source: Choose mode
ar: اختر الوضع

source: Preview Certificate
ar: معاينة الشهادة

source: Activate
ar: فعِّل

source: Deactivate
ar: عطِّل

source: component
ar: مكوِّن

source: Access to this {blockType} is restricted to: {selectedGroupsLabel}
ar: الوصول إلى {blockType} مقتصر على : {selectedGroupsLabel}

source: Access to some content in this {blockType} is restricted to specific groups of learners.
ar: الوصول إلى بعض المحتوى في هذا {blockType} يقتصر على مجموعات محددة من الطلّاب.

source: Caution: The last published version of this unit is live. By publishing changes you will change the student experience.
ar: تحذير: إن آخر إصدار منشور من هذه الوحدة متاحة للطلاب، ستغيّرمن تجربة الطالب بمجرّد نشرك للتغييرات.

source: Content Group Name
ar: اسم مجموعة المحتوى

source: Content Group ID
ar: معرِّف مجموعة المحتوى

source: This is the name of the group
ar: هذا هو اسم المجموعة

source: This content group is used in one or more units.
ar: مجموعة المحتوى هذه مستخدمة في وحدة واحدة أو أكثر.

source: Cannot delete when in use by a unit
ar: يتعذّر حذفه عندما يكون قيد الاستخدام في وِحدة

source: Subsection Visibility
ar: ظهور القسم الفرعي

source: Show entire subsection
ar: عرض القسم الفرعي بأكمله

source: Learners see the published subsection and can access its content.
ar: المتعلمون يرون القسم الفرعي المنشور ويمكنهم الوصول إلى محتواه.

source: Hide content after course end date
ar: إخفاء المحتوى بعد تاريخ انتهاء المساق

source: Hide content after due date
ar: اخفِ المحتوى بعد تاريخ التسليم

source: After the course\'s end date has passed, learners can no longer access subsection content. The subsection remains included in grade calculations.
ar: بعد مرور تاريخ انتهاء المساق/ات، لن يتمكن الطلّاب من الدخول إلى المحتوى الفرعي. يبقى القسم الفرعي مدرجاً في حساب العلامة.

source: After the subsection\'s due date has passed, learners can no longer access its content. The subsection remains included in grade calculations.
ar: بعد مرور تاريخ التسليم للقسم الفرعي، لن يبقى المتعلمون قادرين على الوصول إلى محتواه. يظل القسم الفرعي مشمولًا في احتساب العلامة النهائية.

source: Hide entire subsection
ar: اخفِ القسم الفرعي بأكمله

source: Learners do not see the subsection in the course outline. The subsection is not included in grade calculations.
ar: لا يرى المتعلمون القسم الفرعي في الخطة الدراسيّة للمساق. القسم الفرعي غير مشمول في احتساب العلامة النهائية.

source: If you select an option other than "%(hide_label)s", published units in this subsection become available to learners unless they are explicitly hidden.
ar: إذا قمت بتحديد خيار آخر غير "%(hide_label)s"، ستصبح الوحدات المنشورة في هذا القسم الفرعي متاحة للطلّاب إلا إذا تم اخفائها عمداً.

source: Weekly Highlight Emails
ar: إبراز الرسائل الإلكترونية الأسبوعية

source: Enabled
ar: فعّال

source: Enable Now
ar: فعِّل الآن

source: Instructor Name
ar: اسم المدرِّس

source: Please add the instructor's name
ar: تُرجى إضافة اسم المدرِّس

source: Instructor Title
ar: لقب المدرِّس

source: Please add the instructor's title
ar: تُرجى إضافة اسم المدرِّس

source: Organization
ar: المؤسّسة

source: Organization Name
ar: اسم المؤسسة

source: Please add the institute where the instructor is associated
ar: تُرجى إضافة المؤسسة التعليمية التي ينتسب إليها المدرِّس

source: Biography
ar: السيرة الذاتية

source: Instructor Biography
ar: السيرة الذاتية للمدرِّس

source: Please add the instructor's biography
ar: تُرجى إضافة السيرة الذاتية للمدرِّس

source: Photo
ar: صورة

source: Instructor Photo
ar: صورة المدرِّس

source: Instructor Photo URL
ar: رابط صورة المدرِّس

source: Please add a photo of the instructor (Note: only JPEG or PNG format supported)
ar: تُرجى إضافة صورة للمدرِّس (ملاحظة: الصور بصيغة JPEG أو PNG هي فقط المدعومة)

source: Upload Photo
ar: ارفع صورة

source: Prerequisite: %(prereq_display_name)s
ar: المتطلّب: %(prereq_display_name)s

source: Contains staff only content
ar: يحوي محتوى حصريًّا لطاقم المساق

source: Unpublished changes to live content
ar: تغييرات غير منشورة للمحتوى الحيّ

source: Unpublished units will not be released
ar: الوحدات غير المنشورة لن يتم إصدارها

source: Unpublished changes to content that will release in the future
ar: التغييرات غير المنشورة في المحتوى والتي سيجري إصدارها مستقبلًا

source: Access to this unit is restricted to: {selectedGroupsLabel}
ar: يقتصر الوصول إلى هذه الوحدة على: {selectedGroupsLabel}

source: Access to some content in this unit is restricted to specific groups of learners
ar: الولوج لبعض محتويات هذه الوحدة محصور على مجموعة محدّدة من الطلّاب.

source: Ungraded
ar: غير مقيّم

source: Practice proctored Exam
ar: امتحان مُراقَب تدريبيّ

source: Proctored Exam
ar: امتحان مراقَب

source: Timed Exam
ar: امتحان مؤقت

source: Collapse/Expand this %(xblock_type)s
ar: إظهار/إخفاء بقية هذا الـ%(xblock_type)s

source: Display Name
ar: الاسم الظاهِر

source: Configure
ar: اضبط الإعدادات

source: Duplicate
ar: استنسِخ

source: Drag to reorder
ar: اسحب لإعادة الترتيب

source: Release Status:
ar: حالة الإصدار:

source: Released:
ar: صَدَر:

source: Scheduled:
ar: مجدوَل:

source: Section Highlights
ar: النقاط المهمة في القسم

source: Graded as:
ar: مقيَّم كَـ:

source: Due:
ar: موعده النهائيّ:

source: Subsection is hidden after course end date
ar: إخفاء القسم الفرعي بعد تاريخ انتهاء المساق

source: Subsection is hidden after due date
ar: القسم الفرعي مخفي بعد التاريخ النهائيّ

source: You haven't added any content to this course yet.
ar: لم تُضِف أي محتوى إلى هذا المساق بعد.

source: Click to add a new %(xblock_type)s
ar: انقر لإضافة وحدات %(xblock_type)s جديدة

source: Learning Outcome
ar: نتيجة التعلم

source: Add a learning outcome here
ar: أضِف نتيجة تعلُّم هنا

source: Press discard changes to discard your changes.
ar: لتجاهل التغيرات اضغط على زر تجاهل التغيرات

source: Update Settings
ar: إعدادات التحديث

source: Press update settings to update the information for your organization.
ar: اضغط على إعدادات التحديث لتحديث معلومات المؤسسة

source: Press discard changes to discard changes.
ar: لتجاهل التغيرات اضغط على زر تجاهل التغيرات

source: Press update settings to update course video settings
ar: اضغط على إعدادات التحديث لتحديث إعدادات فيديو المساق

source: Press close to hide course video settings
ar: اضغط على إغلاق لإخفاء إعدادات فيديو المساق
