Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Add image
ar: إضافة صورة

source: You do not have permissions to add images.
ar: ليس لديك أذونات لإضافة الصور.

source: How to use images
ar: كيفية استخدام الصور

source: After uploading an image, it is attached to this particular artice and can be used only here. Other users may replace the image, but older versions are kept. You probably want to show the image with a nice caption. To achieve this, press the Insert button and fill in the caption fields and possibly choose to have you image floating right or left of the content. You can use Markdown in the caption. The markdown code syntax for images looks like this, possible values for align are left/center/right:
ar: بعد تحميل صورة ، يتم إرفاقها بهذه التقنية المعينة ويمكن استخدامها هنا فقط. يمكن للمستخدمين الآخرين استبدال الصورة ، ولكن يتم الاحتفاظ بالإصدارات القديمة. ربما تريد أن تظهر الصورة مع تعليق لطيف. لتحقيق ذلك ، اضغط على الزر &quot;إدراج&quot; وقم بملء حقول التسمية التوضيحية ، وربما اخترت جعل الصورة تطفو يمينًا أو يسارًا من المحتوى. يمكنك استخدام تخفيض السعر في التسمية التوضيحية. يشبه بناء جملة كود تخفيض السعر للصور ، والقيم المحتملة للمحاذاة هي يسار / وسط / يمين:

source: Links
ar: روابط

source: Link to another wiki page
ar: رابط إلى صفحة ويكي أخرى

source: Type in something from another wiki page's title and auto-complete will help you create a tag for you wiki link. Tags for links look like this:
ar: اكتب شيئًا من عنوان صفحة wiki أخرى وسيساعدك الإكمال التلقائي في إنشاء علامة لرابط wiki. علامات الروابط تبدو كالتالي:

source: You can link to another website simply by inserting an address example.com or http://example.com or by using the markdown syntax:
ar: يمكنك الارتباط بموقع ويب آخر ببساطة عن طريق إدخال عنوان example.com أو http://example.com أو باستخدام بناء الجملة markdown:

source: Notifications
ar: إشعارات

source: When this article is edited
ar: وقت تعديل هذا المقال

source: Also receive emails about article edits
ar: تلقّى أيضًا رسائل تتعلق بالتعديلات على هذا المقال

source: Your notification settings were updated.
ar: تم تحديث إعدادات إشعاراتك.

source: Your notification settings were unchanged, so nothing saved.
ar: لم تتغير إعدادات إشعاراتك، ولهذا لم يُحفَظ شيء.

source: %(user)s subscribing to %(article)s (%(type)s)
ar: تسجيل %(user)s في %(article)s (%(type)s)

source: Article deleted: %s
ar: حُذِف المقال: %s

source: Article modified: %s
ar: عُدِّل المقال: %s

source: New article created: %s
ar: أُنشئ مقال جديد: %s

source: notifications
ar: إشعارات

source: No notifications
ar: لا إشعارات

source: Clear notifications list
ar: مسح قائمة الإخطارات

source: Search...
ar: بحث...

source: Log out
ar: تسجيل خروج

source: Sign up
ar: التسجيل

source: Article deleted
ar: تم حذف المادة

source: Article Deleted
ar: المادة المحذوفة

source: The article you were looking for has been deleted.
ar: تم حذف المقال الذي كنت تبحث عنه.

source: You may restore this article and its children by clicking restore.
ar: يمكنك استعادة هذه المقالة وأطفالها بالنقر فوق استعادة.

source: You may remove this article and any children permanently and free their slugs by clicking the below button. This action cannot be undone.
ar: يمكنك إزالة هذه المقالة وأي الأطفال بشكل دائم وتحرير الرخويات الخاصة بهم عن طريق النقر فوق الزر أدناه. لا يمكن التراجع عن هذا الإجراء.

source: Listing articles in
ar: ادراج المقالات في

source: Up one level
ar: مستوى واحد أعلى

source: clear
ar: واضح

source: article,articles
ar: المادة، مقالات

source: matches,match
ar: مباريات، مباراة

source: %(cnt)s %(articles_plur)s in this level %(match_plur)s your search.
ar: %(cnt)s %(articles_plur)s في هذا المستوى %(match_plur)s بحثك.

source: is,are
ar: هو، هي

source: There %(articles_plur_verb)s %(cnt)s %(articles_plur)s in this level.
ar: هناك %(articles_plur_verb)s %(cnt)s %(articles_plur)s في هذا المستوى.

source: Last modified
ar: آخر تعديل

source: no log message
ar: لا يوجد رسائل في السجل

source: Permission Denied
ar: طلب الاذن مرفوض

source: Sorry, you don't have permission to view this page.
ar: عذرا ، ليس لديك إذن لعرض هذه الصفحة.

source: Previewing revision
ar: معاينة النسخة المنقحة

source: Previewing merge between
ar: معاينة الدمج بين

source: and
ar: و

source: Source of
ar: مصدر

source: This article is currently locked for editing.
ar: هذه المقالة مقفلة حاليًا للتحرير.

source: Log me in...
ar: تسجيل الدخول لي ...

source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign me up...
ar: أشركني...

source: Create root article
ar: إنشاء مقالة الجذر

source: Congratulations!
ar: تهانينا!

source: You have django-wiki installed... but there are no articles. So it's time to create the first one, the root article. In the beginning, it will only be editable by administrators, but you can define permissions after.
ar: لقد قمت بتثبيت django-wiki ... لكن لا توجد مقالات. لذلك حان الوقت لإنشاء أول واحد ، المادة الجذر. في البداية ، سيتم تعديله فقط من قبل المسؤولين ، ولكن يمكنك تحديد الأذونات بعد ذلك.

source: Root article
ar: المادة الجذر

source: Create root
ar: إنشاء الجذر

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
ar: تحتاج إلى <a href="%(login_url)s">تسجيل الدخول</a> أو <a href="%(signup_url)s">التسجيل</a> لاستخدام هذه الوظيفة.

source: You need to log in og sign up to use this function.
ar: تحتاج إلى تسجيل الدخول og التسجيل لاستخدام هذه الوظيفة.

source: View Source
ar: أنظر المصدر

source: Sub-articles for
ar: مقالات فرعية لـ

source: No sub-articles
ar: لا مقالات فرعية

source: ...and more
ar: ...و اكثر

source: Browse articles in this level
ar: تصفح المقالات في هذا المستوى

source: New article next to
ar: مقال جديد بجوار

source: New article below
ar: مقالة جديدة أدناه

source: by
ar: بواسطة

source: restored
ar: رمم

source: unlocked
ar: مفتوحة

source: You are now sign up... and now you can sign in!
ar: اكتملت عملية تسجيلك... وأصبح بإمكانك الدخول الآن!

source: You are no longer logged in. Bye bye!
ar: لقد خرجت. مع السلامة!

source: You are now logged in! Have fun!
ar: لقد دخلت! أهلًا وسهلًا!

source: New article '%s' created.
ar: أُنشئ مقال جديد ’%s‘.

source: There was an error creating this article: %s
ar: حدث خطأ أثناء إنشاء هذا المقال: %s

source: There was an error creating this article.
ar: حدث خطأ أثناء إنشاء هذا المقال.

source: This article cannot be deleted because it has children or is a root article.
ar: لا يمكن حذف هذا المقال لأنّه يتضمّن مقالات فرعية أو لأنّه مقال جذري.

source: This article together with all its contents are now completely gone! Thanks!
ar: تم الآن التخلّص تمامًا من هذا المقال وكافة محتوياته! شكرًا لك!

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
ar: أُشير الآن إلى المقال "%s" بأنّه محذوف! نشكرك على إبقاء الموقع خاليًا من المواد غير المرغوب فيها!

source: Your changes were saved.
ar: حُفّظت التغييرات التي أجريتها.

source: A new revision of the article was successfully added.
ar: تمت إضافة تنقيح جديد لهذا المقال بنجاح.

source: Restoring article
ar: تجري استعادة المقال

source: The article "%s" and its children are now restored.
ar: استُعيد الآن المقال "%s" وكافة مقالاته الفرعية.

source: The article %(title)s is now set to display revision #%(revision_number)d
ar: جرى الآن إعداد المقال %(title)s لعرض المراجعة #%(revision_number)d

source: New title
ar: عنوان جديد

source: Merge between Revision #%(r1)d and Revision #%(r2)d
ar: الدمج بين المراجعة #%(r1)d والمراجعة #%(r2)d

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
ar: أُنشئت مراجعة جديدة: الدمج بين المراجعة #%(r1)d والمراجعة #%(r2)d
