Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: Course Video Settings
ar: إعدادات فيديو المساق

source: Transcript Turnaround
ar: تحويل النص

source: Transcript Fidelity
ar: دقة التفريغ النصي

source: Video Source Language
ar: مصدر لغة الفيديو

source: Transcript Languages
ar: لغة التفريغ النصي

source: Add
ar: أضِف

source: Press Add to language
ar: اضغط على إضافة إلى اللغة

source: Automated Transcripts
ar: تفريغ النصي آلي

source: Transcript Provider
ar: مزوّد التفريغ النصي

source: Change
ar: تغيير

source: Press change to change selected transcript provider.
ar: لتغير مزود لنص المٌختار قم بلضغط على تغيير

source: Assignment Type Name
ar: اسم نوع الواجب

source: The general category for this type of assignment, for example, Homework or Midterm Exam. This name is visible to learners.
ar: فئة التصنيف العامّة لمهذا النوع من المهمات، مثلًا: واجب بيتي أو امتحان نصفي. سيكون هذا الاسم ظاهرًا للمتعلمين.

source: Abbreviation
ar: الاختصار

source: This short name for the assignment type (for example, HW or Midterm) appears next to assignments on a learner's Progress page.
ar: يظهر الاسم المختصر لنوع المهمّة (مثل "واجِب" أو "امتحان نصفيّ") بجانب المهام في صفحة تقدُّم المتعلّم.

source: Weight of Total Grade
ar: وزن العلامة النهائية

source: The weight of all assignments of this type as a percentage of the total grade, for example, 40. Do not include the percent symbol.
ar: وزن جميع المهام من هذا النوع كنسبة مئوية للعلامة النهائية، مثلًا 40. لا تستخدم رمز النسبة المئوية.

source: Total Number
ar: العدد الإجمالي

source: The number of subsections in the course that contain problems of this assignment type.
ar: عدد الأقسام الفرعية لهذا المساق، التي تتضمن مسائل لمهمّة من هذا النوع.

source: Number of Droppable
ar: عدد ما يمكن إلغاؤها

source: The number of assignments of this type that will be dropped. The lowest scoring assignments are dropped first.
ar: عدد المهام من هذا النوع التي سيتم إلغاؤها. سيتم إلغاء المهام ذات أقل مجموع علامات أولًا.

source: Course Handouts
ar: أوراق عمل المساق

source: You have no handouts defined
ar: ليست لديك أية اوراق عمل محدّدة

source: There is invalid code in your content. Please check to make sure it is valid HTML.
ar: هناك تعليمات برمجية غير صحيحة في المحتوى الذي قدمته. يُرجى التأكّد من صحّة تعليمات HTML المستخدمة.

source: Send push notification to mobile apps
ar: أرسِل إشعارات لحظية إلى تطبيقات الهاتف النقّال

source: Send notification to mobile apps
ar: أرسِل تنبيهات إلى تطبيقات الهاتف النقّال

source: Post
ar: انشر

source: Due Date:
ar: التاريخ النهائي للتسليم:

source: Due Time in UTC:
ar: موعد التسليم بتوقيت UTC:

source: Clear Grading Due Date
ar: امسَح التاريخ النهائي للتقييم

source: Chapter Name
ar: اسم الفصل

source: Chapter {order}
ar: فصل {order}

source: provide the title/name of the chapter that will be used in navigating
ar: حدّد عنوان/ اسم الفصل الذي سيُستخدم في جدول المحتويات

source: Chapter Asset
ar: محتوى فصل

source: upload a PDF file or provide the path to a Studio asset file
ar: ارفع ملفًا بصيغة PDF أو حدد مسار ملف محتوى استوديو

source: Upload PDF
ar: ارفع ملف PDF

source: delete chapter
ar: احذف الفصل

source: Textbook information
ar: معلومات عن الكتاب

source: Textbook Name
ar: اسم الكتاب

source: Introduction to Cookie Baking
ar: مقدّمة في طريقة خَبز الكعك

source: provide the title/name of the text book as you would like your students to see it
ar: حدّد عنوان/اسم الكتاب كما تريد أن يراه طلابّك

source: Chapter information
ar: معلومات عن الفصل

source: Add a Chapter
ar: أضِف فصلًا

source: Grading
ar: التقييم

source: Grade as:
ar: قيّمه كـ:

source: Not Graded
ar: غير مقيَّم

source: Cannot delete when in use by an experiment
ar: لا يمكن الحذف أثناء الاستخدام في أحد الاختبارات

source: This Group Configuration is used in:
ar: إعدادات المجموعة هذه مستخدمة في:

source: This Group Configuration is not in use. Start by adding a content experiment to any Unit via the {linkStart}Course Outline{linkEnd}.
ar: لم يُستخدم إعداد المجموعة هذا. ابدأ بإضافة تجربة محتوى إلى أي وحدة بزيارة {linkStart}خطة المساق{linkEnd}.

source: Group Configuration information
ar: معلومات إعدادات المجموعة

source: Group Configuration Name
ar: اسم إعدادات المجموعة

source: Group Configuration ID
ar: معرِّف إعدادات المجموعة

source: This is the Name of the Group Configuration
ar: هذا هو اسم إعدادات المجموعة

source: Name or short description of the configuration
ar: اسم الإعدادات أو وصف موجَز عنها

source: This is the Description of the Group Configuration
ar: هذا وصف إعدادات المجموعة

source: Optional long description
ar: وصف اختياري مطوَّل

source: Group information
ar: معلومات المجموعة

source: Name of the groups that students will be assigned to, for example, Control, Video, Problems. You must have two or more groups.
ar: اسم المجموعات التي سيُوزَّع عليها الطلاب، مثلاً ’التحكّم‘، أو ’الفيديو‘، أو ’المسائل‘. يجب أن تتوفر لديك مجموعتان أو أكثر.

source: Add another group
ar: أضف مجموعة أخرى

source: This configuration is currently used in content experiments. If you make changes to the groups, you may need to edit those experiments.
ar: هذا الإعداد مستخدم حاليًّا في تجربة المحتوى. قد تحتاج لتعديل هذه الإختبارات إذا أدخلت أي تعدّيلات على المجموعات.

source: delete group
ar: احذف المجموعة

source: This feature is currently in testing. Course teams can enter highlights, but learners will not receive email messages.
ar: هذه الميزة حاليا في مرحلة الاختبار،يمكن لفريق المساق اضافة مقتطفات لكن لن تصل رسائل البريد الالكتروني للطلاب

source: Enter 3-5 highlights to include in the email message that learners receive for this section (250 character limit).
ar: أدخل 3-5 مقتطفات لتضمينها في رسالة البريد الإلكتروني التي يتلقاها المتعلمون لهذا القسم (250 حرفًا كحد أقصى).

source: Highlight {highlight_index}
ar: نقطة مظلِّلة {highlight_index}

source: A highlight to look forward to this week.
ar: مقتطفات من هذا الاسبوع.

source: License Type
ar: نوع الترخيص

source: Learn more about {license_name}
ar: اعرف المزيد عن {license_name}

source: Options for {license_name}
ar: خيارات {license_name}

source: The following options are available for the {license_name} license.
ar: تتوفّر الخيارات التالية لرخصة {license_name}

source: License Display
ar: اعرض الرخصة

source: The following message will be displayed at the bottom of the courseware pages within your course:
ar: ستُعرَض الرسالة التالية في أسفل صفحات محتويات مساقك:

source: Creative Commons licensed content, with terms as follow:
ar: محتوى مرخَّص كمشاع إبداعي وفق الشروط التالية:

source: Some Rights Reserved
ar: بعض الحقوق محفوظة

source: New %(item_type)s
ar: %(item_type)s جديد

source: Clear Value
ar: امسح القيمة

source: Component Location ID
ar: معرف موقع العناصر

source: Download
ar: تنزيل

source: {categoryText} in {parentDisplayname}
ar: {categoryText} في {parentDisplayname}

source: Current location
ar: الموقع الحالي

source: View child items
ar: استعراض بنود الأطفال

source: Currently selected
ar: منتقاة حاليًا

source: You haven't added any textbooks to this course yet.
ar: لم تُضِف بعد أي كتب إلى هذا المساق.

source: Add your first textbook
ar: أضِف أوّل كتاب لك.

source: This group controls access to:
ar: هذه المجموعة تتحكم بالولوج إلى:

source: In the {linkStart}Course Outline{linkEnd}, use this group to control access to a component.
ar: في {linkStart}خطة المساق{linkEnd}، استخدم هذه المجموعة للتحكم بالوصول لمكونات المساق.

source: Previous Uploads
ar: المرفوعات السابقة

source: Download available encodings (.csv)
ar: تنزيل الترميزات المتاحة (بصيغة csv.)

source: Thumbnail
ar: صورة مصغرة

source: Video ID
ar: مُعرِّف الفيديو

source: Transcripts
ar: النصوص

source: Video Status
ar: حالة الفيديو

source: Remove this video
ar: أزِل هذا الفيديو

source: Remove {video_name} video
ar: أزِل فيديو {video_name}

source: Never published
ar: لم تُنشَر قطّ

source: Last published %(last_published_date)s by %(publish_username)s
ar: نُشرت آخر مرّة في %(last_published_date)s على يد %(publish_username)s.

source: Previously published
ar: نُشرت سابقًا

source: Draft (Never published)
ar: مسودّة (لم تُنشَر قطّ)

source: Visible to Staff Only
ar: مرئيّة لطاقم المساق فقط

source: Published and Live
ar: نُشرت ومتاحة الآن عبر الإنترنت

source: Published (not yet released)
ar: نُشرت (لم تُصدر بعد)

source: Draft (Unpublished changes)
ar: مسودّة (تغييرات غير منشورة)

source: Release:
ar: الإصدار:

source: Publishing Status
ar: حالة النشر

source: Draft saved on {lastSavedStart}{editedOn}{lastSavedEnd} by {editedByStart}{editedBy}{editedByEnd}
ar: مسودّة محفوظة على {lastSavedStart}{editedOn}{lastSavedEnd} من قبل {editedByStart}{editedBy}{editedByEnd}

source: Last published {lastPublishedStart}{publishedOn}{lastPublishedEnd} by {publishedByStart}{publishedBy}{publishedByEnd}
ar: نشرت آخر مرّة في {lastPublishedStart}{publishedOn}{lastPublishedEnd} من قبل {publishedByStart}{publishedBy}{publishedByEnd}

source: with %(release_date_from)s
ar: مع %(release_date_from)s

source: Is Visible To:
ar: ظاهِر لِـ:

source: Will Be Visible To:
ar: سيكون ظاهرًا لِـ:

source: Staff Only
ar: الطاقم فقط

source: with %(section_or_subsection)s
ar: مع %(section_or_subsection)s

source: Staff and Learners
ar: الطاقم والمتعلمون

source: Hide from learners
ar: اخفِ عن المتعلمين

source: Note: Do not hide graded assignments after they have been released.
ar: ملاحظة: لا تُخفِ الواجبات المقيّمة بعد إصدارها.

source: Release Date and Time
ar: تاريخ ووقت الإصدار

source: Release Date:
ar: تاريخ الإصدار:

source: Release Time in UTC:
ar: وقت الإصدار بتوقيت UTC:

source: Clear Release Date/Time
ar: امسَح تاريخ/وقت الإصدار

source: Assessment Results Visibility
ar: مرئيّة نتائج امتحان التقييم

source: Always show assessment results
ar: دومًا أظهر نتائج امتحان التقييم

source: When learners submit an answer to an assessment, they immediately see whether the answer is correct or incorrect, and the score received.
ar: عندما يقوم أحد الطلّاب بتقديم إجابة على أحد أسئلة امتحان التقييم، سيحصلون فورًا على نتيجة توضح ما إذا كانت الإجابة صحيحة أم لا، وسيتلقون نتيجتهم.

source: Never show assessment results
ar: لا تظهر نتائج امتحان التقييم قطّ

source: Learners never see whether their answers to assessments are correct or incorrect, nor the score received.
ar: لا يحصل الطلّاب على نتيجة توضح ما إذا كانت الإجابة صحيحة أم لا، ولا يتلقون نتيجتهم.

source: Show assessment results when subsection is past due
ar: أظهر نتائج امتحان التقييم عندما تنقضي مدّة البند الفرعيّ

source: Learners do not see whether their answers to assessments were correct or incorrect, nor the score received, until after the course end date has passed.
ar: لا يحصل الطلّاب على نتيجة توضح ما إذا كانت الإجابة صحيحة أم لا، ولا يتلقون نتيجتهم حتى ينقضي وقت المساق.

source: If the course does not have an end date, learners always see their scores when they submit answers to assessments.
ar: إن لم يكن هناك وقت انتهاء موضح للمساق، فسيحصل الطلّاب دومًا على نتائجهم عندما يقدمون إجاباتهم على امتحانات التقييم.

source: Learners do not see whether their answers to assessments were correct or incorrect, nor the score received, until after the due date for the subsection has passed.
ar: لا يحصل الطلّاب على نتيجة توضح ما إذا كانت الإجابة صحيحة أم لا، ولا يتلقون نتيجتهم حتى ينقضي وقت البند الفرعيّ المخصص.

source: If the subsection does not have a due date, learners always see their scores when they submit answers to assessments.
ar: إن لم يكن هناك وقت انتهاء موضح للبند الفرعيّ، فسيحصل الطلّاب دومًا على نتائجهم عندما يقدمون إجاباتهم على امتحانات التقييم.

source: Signatory
ar: المُوقّع

source: Signature Image
ar: صورة التوقيع

source: Certificate Signatory Configuration
ar: إعدادات الموقِّع على الشهادة

source: Name
ar: الاسم

source: Name of the signatory
ar: اسم الموقِّع

source: The name of this signatory as it should appear on certificates.
ar: اسم هذا الموقّع كما يجب أن يظهر على الشهادات

source: Title
ar: اللقب

source: Title of the signatory
ar: لقب الموقِّع

source: Titles more than 100 characters may prevent students from printing their certificate on a single page.
ar: يمكن أن تمنع الألقاب - التي تزيد عن 100 حرف - الطلاب من طباعة شهادتهم على صفحة واحدة

source: Organization
ar: المؤسسة

source: Organization of the signatory
ar: مؤسّسة الموقِّع

source: The organization that this signatory belongs to, as it should appear on certificates.
ar: المؤسّسة التي ينتمي إليها هذا الموقِّع، كما يفترض بها أن تظهر على الشهادات.

source: Path to Signature Image
ar: مسار صورة التوقيع

source: Image must be in PNG format
ar: يجب أن تكون الصورة بصيغة PNG

source: Upload Signature Image
ar: ارفع صورة التوقيع

source: Unit Visibility
ar: ظهور الوحدة

source: Section Visibility
ar: ظهور القسم

source: If the unit was previously published and released to learners, any changes you made to the unit when it was hidden will now be visible to learners.
ar: إذا كان قد تم نشر الوحدة وإصدارها للمتعلمين في وقت سابق، فإن أي تغييرات إجريتها على الوحدة عندما كانت مخفية ستكون مرئية للمتعلمين الآن.

source: If you make this %(xblockType)s visible to learners, learners will be able to see its content after the release date has passed and you have published the unit. Only units that are explicitly hidden from learners will remain hidden after you clear this option for the %(xblockType)s.
ar: إذا جعلت هذا الـ%(xblockType)s ظاهرًا للمتعلمين، فسيكونون قادرين على رؤية محتواه بعد انقضاء تاريخ الإصدار وبعد أن تنشُر الوحدة؛ وستبقى فقط الوحدات المخفية عن المتعلمين صراحةً مخفية بعد أن تمسح هذا الخيار لـ%(xblockType)s.

source: Current Role:
ar: الدور الحالي:

source: You!
ar: أنت!

source: send an email message to {email}
ar: أرسل رسالة إلى {email}

source: Promote another member to Admin to remove your admin rights
ar: رقِّ عضوًا آخر إلى مدير لتتمكّن من إلغاء صلاحياتك كمدير

source: Add {role} Access
ar: أضف صلاحية الوصول إلى {role}

source: Remove {role} Access
ar: أزِل صلاحية الوصول إلى {role}

source: Delete the user, {username}
ar: احذف المستخدم، {username}

source: Set as a Special Exam
ar: عيّن امتحانًا مخصّصًا

source: Exam Types
ar: أنواع الامتحان

source: Timed
ar: محدد بوقت

source: Use a timed exam to limit the time learners can spend on problems in this subsection. Learners must submit answers before the time expires. You can allow additional time for individual learners through the Instructor Dashboard.
ar: استخدم امتحانًا مؤقتاً لتحديد الوقت الذي يمكن للمتعلّمين قضاؤه في حل مسائل هذا القسم الفرعي. يجب أن يقوم المتعلّمون بتسليم الإجابات قبل انتهاء الوقت المحدّد. يمكنك منح متعلّمين محددين وقتاً إضافياً باستخدام صفحة "اللوحة التعليمية" الخاصة بالمدرِّسين.

source: Proctored
ar: مُراقب

source: Proctored exams are timed and they record video of each learner taking the exam. The videos are then reviewed to ensure that learners follow all examination rules.
ar: الامتحانات المراقبة محدّدة التوقيت، وتُسجّل مقطع فيديو لكل متعلّم يُجري امتحانًا. تُراجع مقاطع الفيديو هذه بعد ذلك بهدف ضمان التزام المتعلّمين بجميع القواعد الامتحانية.

source: Practice Proctored
ar: تدرَّب على الامتحان المراقَب

source: Use a practice proctored exam to introduce learners to the proctoring tools and processes. Results of a practice exam do not affect a learner's grade.
ar: استخدم امتحانًا تدريبيًا مراقبًا لتعريف المتعلّمين بإجراءات وأدوات المراقبة. لن تؤثر نتائج الامتحان التدريبي على العلامة النهائية للمتعلّم.

source: Time Allotted (HH:MM):
ar: الوقت المخصَّص (HH:MM):

source: Select a time allotment for the exam. If it is over 24 hours, type in the amount of time. You can grant individual learners extra time to complete the exam through the Instructor Dashboard.
ar: اختر مدة زمنية مخصّصة لإجراء الامتحان. إذا كانت المدة أكثر من 24 ساعة،أدخل مقدار الوقت. يمكنك منح متعلّمين محددين زمنًا إضافيًا لإتمام الامتحان من خلال صفحة "اللوحة التعليمية" الخاصة بالمدرسين.

source: Review Rules
ar: قواعد المراجعة

source: Specify any rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed. These specified rules are visible to learners before the learners start the exam, along with the {linkStart}general proctored exam rules{linkEnd}.
ar: حدد أية قواعد أو استثناءات يجب أن يفرضها فريق مراجعة المراقبة عند مراجعة مقاطع الفيديو. على سبيل المثال، يمكنك تحديد أن الآلات الحاسبة مسموح بها. هذه القواعد ستكون ظاهرة للطلّاب قبل أن يبدؤوا الاختبار، إلى جانب {linkStart}القواعد العامة للإمتحان المراقب{linkEnd}.

source: General Proctored Exam Rules
ar: القواعد العامة للإمتحان المراقب

source: Specify any rules or rule exceptions that the proctoring review team should enforce when reviewing the videos. For example, you could specify that calculators are allowed. These specified rules are visible to learners before the learners start the exam.
ar: حدد أية قواعد أو استثناءات يجب أن يفرضها فريق مراجعة المراقبة عند مراجعة مقاطع الفيديو. على سبيل المثال، يمكنك تحديد أن الآلات الحاسبة مسموح بها. هذه القواعد ستكون ظاهرة للطلّاب قبل أن يبدؤوا الاختبار.

source: Account
ar: حساب

source: This action updates the {provider} information for your entire organization.
ar: يعمل هذا الإجراء على تحديث معلومات {provider} لمؤسستك بالكامل

source: Enter the account information for your organization.
ar: ادخل معلومات حساب المؤسسة

source: API Key
ar: مفتاح عميل واجهة برمجة التطبيقات

source: API Secret
ar: كلمة سر الAPI

source: Unit Access
ar: الوصول إلى الوحدة

source: Restrict access to:
ar: احصر الوصول على:

source: Select a group type
ar: حدّد نوع المجموعة

source: Select one or more groups:
ar: حدّد مجموعة واحدة أو أكثر:

source: Deleted Group
ar: مجموعة محذوفة

source: This group no longer exists. Choose another group or do not restrict access to this unit.
ar: لم تعد هذه المجموعة موجودة. اختر مجموعة أخرى أو لا تقيّد الوصول إلى هذه الوحدة.

source: File upload succeeded
ar: نجح رفع الملف

source: Please check the following validation feedbacks and reflect them in your course settings:
ar: يُرجى التحقق من ملاحظات التوثيق التالية، وأن تعتمد عليها في ضبط إعدادات مساقك:

source: Verification Checkpoint
ar: نقطة التحقق من التوثيق

source: Must complete verification checkpoint
ar: يجب أن تتم نقطة التحقق من التوثيق

source: Verification checkpoint to be completed
ar: نقطة التحقق من التوثيق التي يجب إتمامها

source: Learners who require verification must pass the selected checkpoint to see the content in this unit. Learners who do not require verification see this content by default.
ar: يجب أن يجتاز المتعلمون الطالبين للتوثيق نقاط التحقق المحددة ليروا محتوى هذه الوحدة. أما المتعلمون الذين لا يحتاجون للتوثيق، فيمكنهم رؤية هذا المحتوى بالأصل.

source: Recommended image resolution is {imageResolution}, maximum image file size should be {maxFileSize} and format must be one of {supportedImageFormats}.
ar: دقة الصورة الموصى بها {imageResolution} ، يجب أن يكون الحد الأقصى لحجم ملف الصورة {maxFileSize} ويجب أن يكون التنسيق ضمن {supportedImageFormats}.

source: Read more
ar: اقرأ المزيد

source: Show transcripts ({totalTranscripts})
ar: اظهر النص ({totalTranscripts})

source: No transcript uploaded.
ar: لم يتم تحميل النص

source: Set Access
ar: ضع صلاحيات للوصول

source: Edit %(display_name)s (required)
ar: عدِّل %(display_name)s (مطلوب)

source: You have done a dry run of force publishing the course. Nothing has changed. Had you run it, the following course versions would have been change.
ar: لقد قمت ببتجربة نشر المساق إجباريًّا. لم يتغير شيء. لو قمت بالنشر فعليًّا، لتغيرت إصدارات المساقات التالية.

source: The published branch version, {published}, was reset to the draft branch version, {draft}.
ar: تمت إعادة تعيين الإصدار الفرعي المنشور ({published}) إلى مسودة الإصدار الفرعي ({draft}).

source: Add URLs for additional versions
ar: أضِف روابط للإصدارات الإضافية

source: To be sure all students can access the video, we recommend providing both an .mp4 and a .webm version of your video. Click below to add a URL for another version. These URLs cannot be YouTube URLs. The first listed video that's compatible with the student's computer will play.
ar: لتتأكّد من تمكّن جميع الطلاب من الوصول إلى هذا الفيديو، نوصي بتوفير الفيديو ذاته بصيغتَي mp4. و webm. انقر أدناه لإضافة رابط لصيغة أخرى. لا يمكن لهذه الروابط أن تشير إلى موقع يوتيوب. وسيُعرَض أوّل فيديو متوافق مع حاسوب الطالب.

source: Default Timed Transcript
ar: تفريغ نصيّ موقوت افتراضي

source: Timed Transcript Conflict
ar: تضارب في التفريغ النصي الموقوت

source: The timed transcript for the first video file does not appear to be the same as the timed transcript for the second video file.
ar: يبدو أنّ التفريغ النصي الموقوت لملف الفيديو الأوّل يختلف عن التفريغ النصي الموقوت لملف الفيديو الثاني.

source: Which timed transcript would you like to use?
ar: ما هو التفريغ النصي الموقوت الذي ترغب باستخدامه؟

source: Error.
ar: خطأ.

source: Timed Transcript from %(filename)s
ar: تفريغ نصي موقوت من %(filename)s

source: Timed Transcript Found
ar: عُثِرَ على تفريغ نصي موقوت

source: EdX has a timed transcript for this video. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript. If you want to replace this transcript, upload a new .srt transcript file.
ar: لدى EdX تفريغ نصي موقوت لهذا الفيديو. إذا رغبت في تعديل هذا التفريغ النصي، فيمكنك تنزيل النص الحالي، وتعديله، وإعادة رفعه. أمّا إذا رغبت في استبداله، فارفع ملف تفريغ نصي جديد بصيغة srt.

source: Upload New Transcript
ar: ارفع تفريغًا نصيًّا جديدًا

source: Upload New .srt Transcript
ar: ارفع ملف srt. جديد

source: Download Transcript for Editing
ar: تنزيل التفريغ النصّيّ لتعديله

source: No EdX Timed Transcript
ar: لا يوجد تفريغ نصيّ محدد التوقيت في إدراك

source: EdX doesn't have a timed transcript for this video in Studio, but we found a transcript on YouTube. You can import the YouTube transcript or upload your own .srt transcript file.
ar: ليس لدى إدراك تفريغ نصيّ محدَّد التوقيت لهذا الفيديو في الاستديو، لكنّنا وجدنا نصًّا على اليوتيوب يمكنك استيراده أو تحميل ملف لنصّك الخاص بصيغة srt.

source: Import YouTube Transcript
ar: استيراد تفريغ نصيّ من يوتيوب

source: No Timed Transcript
ar: لا يوجد تفريغ نصي محدَّد التوقيت

source: EdX doesn\'t have a timed transcript for this video. Please upload an .srt file.
ar: ليس لدى إدراك نص محدَّد التوقيت لهذا الفيديو. يُرجى رفع ملف بصيغة srt.

source: The timed transcript for this video on edX is out of date, but YouTube has a current timed transcript for this video.
ar: التفريغ النصيّ الموقوت لهذا الفيديو في إدراك قديم، وهناك تفريغ نصيّ موقوت حديث على يوتيوب لهذا الفيديو.

source: Do you want to replace the edX transcript with the YouTube transcript?
ar: هل ترغب في تغيير التفريغ النصي على ادراك ليكون نسخة عن ذاك الذي على يوتيوب؟

source: Yes, replace the edX transcript with the YouTube transcript
ar: نعم، استخدم النسخة التي على يوتيوب كبديل عن النسخة الحالية للتفريغ النصي

source: Timed Transcript Uploaded Successfully
ar: تم رفع التفريغ النصي محدد التوقيت بنجاح

source: EdX has a timed transcript for this video. If you want to replace this transcript, upload a new .srt transcript file. If you want to edit this transcript, you can download, edit, and re-upload the existing transcript.
ar: يوجد لدى إدراك تفريغ نصي موقوت لهذا الفيديو. إذا رغبت في استبدال هذا النص، ارفع ملفًا جديدًا بصيغة srt. أمّا إذا رغبت في تعديل هذا النصّ، فيمكنك تنزيل النص الموجود وتعديله ومن ثمّ إعادة رفعه.

source: Confirm Timed Transcript
ar: أكّد التفريغ النصي الموقوت

source: You changed a video URL, but did not change the timed transcript file. Do you want to use the current timed transcript or upload a new .srt transcript file?
ar: لقد قُمت بتغيير رابط الفيديو دون أن تغيّر ملف التفريغ النصي الموقوت المرتبط به. هل ترغب في استخدام التفريغ النصي الموقوت الحالي أم رفع ملف تفريغ نصي srt. جديد؟

source: Use Current Transcript
ar: استخدم التفريغ النصي الحالي
