Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: The file must be smaller than {size} in size.
ar: يجب ألّا يزيد حجم الملف عن {size}.

source: Upload is in progress. To avoid errors, stay on this page until the process is complete.
ar: يجري التحميل. يُرجى البقاء في هذه الصفحة إلى حين استكمال العملية لتفادي وقوع أخطاء.

source: Removal is in progress. To avoid errors, stay on this page until the process is complete.
ar: تجري الإزالة. يُرجى البقاء في هذه الصفحة إلى حين استكمال العملية لتفادي وقوع أخطاء.

source: bytes
ar: بايت

source: KB
ar: كيلو بايت

source: MB
ar: ميغا بايت

source: Course is not yet visible to students.
ar: المساق غير مرئي للطلّاب بعد.

source: You cannot view the course as a student or beta tester before the course release date.
ar: لا يمكنك استعراض هذا المساق كطالب أو كمختبر للإصدار التجريبي قبل حلول تاريخ إصدار المساق.

source: %(num_students)s student opened Subsection
ar: قام %(num_students)s طالب بفتح قسم فرعيّ

source: %(num_students)s student
ar: %(num_students)s طالب

source: %(num_questions)s question
ar: %(num_questions)s سؤال

source: Number of Students
ar: عدد الطلّاب

source: Overall Score
ar: العلامة النهائيّة

source: {total_results} result
ar: {total_results} النتائج

source: Profile Visibility:
ar: قابلية رؤية الملف الشخصي:

source: Limited Profile
ar: الملفّ الشخصي المحدود

source: Full Profile
ar: الملفّ الشخصي الكامل

source: Joined
ar: منْضَم

source: Joined Date
ar: تاريخ الإنضمام

source: Location
ar: الموقع

source: Add Country
ar: أضِف بلدًا

source: Add language
ar: أضِف لغةً

source: About me
ar: نبذة عني

source: Tell other learners a little about yourself: where you live, what your interests are, why you're taking courses, or what you hope to learn.
ar: أخبر المتعلمين الآخرين ببعض الأمور عن نفسك: مكان سكنك، اهتماماتك، سبب التحاقك بهذه المساقات، أو ما ترغب في تعلّمه.

source: Accomplishments Pagination
ar: ترقيم صفحات الإنجازات

source: Account Settings page.
ar: صفحة إعدادات الحساب

source: You must specify your birth year before you can share your full profile. To specify your birth year, go to the {account_settings_page_link}
ar: يجب أن تحدّد سنة ميلادك قبل أن تتمكّن من مشاركة صفحتك الشخصية الكاملة. ولتحدّد سنة ميلادك، اذهب إلى صفحة إعدادات الحساب {account_settings_page_link}.

source: You must be over 13 to share a full profile. If you are over 13, make sure that you have specified a birth year on the {account_settings_page_link}
ar: يجب أن يكون عمرك أكثر من 13 سنة لتتمكّن من مشاركة صفحتك الشخصية الكاملة. إذا كان عمرك أكثر من 13 سنة، تأكّد من أنّك حدّدت سنة ميلادك في صفحة الإعدادات {account_settings_page_link}.

source: Profile Image
ar: صورة الملف الشخصي

source: Profile image for {username}
ar: صورة الملف الشخصي للمستخدم {username}

source: About Me
ar: نبذة عنّي

source: Accomplishments
ar: الإنجازات

source: Profile
ar: الملف الشخصي

source: Could not parse certificate JSON. %(message)s
ar: تعذّر تفسير JSON الشهادة. %(message)s

source: Certificate name is required.
ar: اسم الشهادة مطلوب.

source: Signatory field(s) has invalid data.
ar: يحوي حقل/حقول الموقِّع على بيانات غير صالحة.

source: Edit this certificate?
ar: أتريد تعديل هذه الشهادة؟

source: This certificate has already been activated and is live. Are you sure you want to continue editing?
ar: لقد فُعِّلَت هذه الشهادة من قَبل، وهي نشِطة. هل أنت متأكد من رغبتك في الاستمرار بالتعديل؟

source: Yes, allow edits to the active Certificate
ar: نعم، اقبل التعديل على الشهادة النشطة.

source: certificate
ar: الشهادة

source: Set up your certificate
ar: أعدّ شهادتك

source: You have not created any certificates yet.
ar: لم تُنشِئ أي شهادات بعد.

source: Delete "<%= signatoryName %>" from the list of signatories?
ar: هل تريد حذف "<%= signatoryName %>" من لائحة الموقّعين؟

source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.

source: Upload signature image.
ar: ارفع صورة التوقيع.

source: Image must be in PNG format.
ar: يجب أن تكون الصورة بصيغة PNG.

source: Group %s
ar: المجموعة %s

source: Your export has failed.
ar: لم تنجح عملية التصدير الخاصة بك.

source: Already a course team member
ar: عضو في فريق المساق أصلًا

source: Are you sure you want to delete {email} from the course team for “{container}”?
ar: هل أنت متأكّد من رغبتك في حذف {email} من فريق المساق لـ "{container}"؟

source: Staff
ar: الطاقم

source: Admin
ar: مدير

source: Already a library team member
ar: عضو في فريق المكتبة أصلًا

source: Are you sure you want to delete {email} from the library “{container}”?
ar: هل أنت متأكّد من رغبتك في حذف {email} من مكتبة "{container}"؟

source: Library User
ar: مستخدم المكتبة

source: Hide Deprecated Settings
ar: اخفِ الإعدادات الأثرية

source: Show Deprecated Settings
ar: أظهِر الإعدادات الأثريّة

source: You have unsaved changes. Do you really want to leave this page?
ar: لديك تغييرات غير محفوظة. هل تريد حقًّا أن مغادرة هذه الصفحة؟

source: Internal Server Error.
ar: خطأ داخلي في الخادم

source: Queued
ar: في طابور الانتظار

source: Upload completed
ar: تم الرفع

source: Upload failed
ar: فشِل الرفع

source: Action required: Enter a valid date.
ar: إجراء مطلوب: أدخِل تاريخًا صالحًا.

source: Group name is required
ar: اسم المجموعة مطلوب

source: Group A
ar: المجموعة أ

source: Group B
ar: المجموعة ب

source: Group Configuration name is required.
ar: اسم إعدادات المجموعة مطلوب

source: There must be at least one group.
ar: يجب أن تتوفّر مجموعة واحدة على الأقل.

source: All groups must have a name.
ar: يجب أن يتوفّر اسم لكلّ مجموعة.

source: All groups must have a unique name.
ar: يجب أن يكون لكل مجموعة اسمٌ فريد.

source: The course must have an assigned start date.
ar: يجب أن يكون للمساق تاريخ بدء معيّن.

source: The course end date must be later than the course start date.
ar: يجب أن يأتي تاريخ انتهاء المساق بعد تاريخ بدئه.

source: The course start date must be later than the enrollment start date.
ar: يجب أن يأتي تاريخ بدء المساق بعد تاريخ التسجيل فيه.

source: The enrollment start date cannot be after the enrollment end date.
ar: لا يمكن لتاريخ بدء التسجيل في المساق أن يأتي بعد تاريخ انتهاء التسجيل فيه.

source: The enrollment end date cannot be after the course end date.
ar: لا يمكن لتاريخ انتهاء التسجيل في المساق أن يأتي بعد تاريخ انتهاء المساق.

source: The certificate available date must be later than the course end date.
ar: يجب أن يكون تاريخ الشهادة المتاح في موعد أقصاه تاريخ انتهاء المساق.

source: Key should only contain letters, numbers, _, or -
ar: يجب أن لا يحتوي المفتاح إلا على حروف وأرقام و _ و-

source: Please enter an integer between %(min)s and %(max)s.
ar: يُرجى إدخال عدد صحيح يتراوح بين %(min)s و%(max)s.

source: The assignment type must have a name.
ar: يجب أن يكون لنوع الواجب اسما.

source: There's already another assignment type with this name.
ar: يوجد مسبقًا نوع آخر من الواجبات بهذا الاسم.

source: Please enter an integer between 0 and 100.
ar: يُرجى إدخال عدد صحيح بين 0 و 100.

source: Please enter an integer greater than 0.
ar: يُرجى إدخال عدد صحيح أكبر من 0.

source: Please enter non-negative integer.
ar: يُرجى إدخال عدد صحيح غير سالب.

source: Cannot drop more <%= types %> assignments than are assigned.
ar: لا يمكن إتاحة مهام <%= types %> أكثر مما تمّ تعيينه.

source: Grace period must be specified in HH:MM format.
ar: يجب تحديد فترة السماح بصيغة HH:MM.

source: Not able to set passing grade to less than %(minimum_grade_cutoff)s%.
ar: تعذَّر تحديد علامة النجاح عند أقلّ من %(minimum_grade_cutoff)s%.

source: Your file could not be uploaded
ar: تعذَّر رفع ملفك

source: Upload Videos
ar: تحميل مقاطع الفيديو

source: Drag and drop or {spanStart}browse your computer{spanEnd}.
ar: اسحب وأفلت أو {spanStart}تصفح الكمبيوتر{spanEnd}.

source: Maximum file size: {maxFileSize} GB
ar: الحد الأقصى لحجم الملف: {maxFileSize} غيغابايت

source: Supported file types: {supportedVideoTypes}
ar: أنواع الملفات المدعومة: {supportedVideoTypes}

source: Your video uploads are not complete.
ar: ملفات الفيديو المرفوعة من طرفك غير مكتملة.

source: Upload completed for video {fileName}
ar: تم رفع مقطع الفيديو {fileName}

source: Upload failed for video {fileName}
ar: فشِل رفع مقطع الفيديو {fileName}

source: {filename} is not in a supported file format. Supported file formats are {supportedFileFormats}.
ar: صيغة الملف {filename} غير مدعومة. صيغ الملفات المدعومة هي {supportedFileFormats}.

source: {filename} exceeds maximum size of {maxFileSizeInGB} GB.
ar: يتجاوز حجم الملف {filename} الحدّ الأقصى المسموح به وهو {maxFileSizeInGB} جيجابايت.

source: : video upload complete.
ar: : تم تحميل الفيديو.

source: Previous Uploads table has been updated.
ar: تم تحديث جدول التحميلات السابقة.

source: Delete File Confirmation
ar: تأكيد حذف الملف

source: Are you sure you wish to delete this item. It cannot be reversed! Also any content that links/refers to this item will no longer work (e.g. broken images and/or links)
ar: هل أنت واثق من رغبتك في حذف هذا الموضوع؟ لا يمكن التراجع عن هذا لاحقًا! كما أنّ أي محتوى يتضمّن رابطًا أو مرجعًا لهذا الموضوع لن يعمل بعد الآن (مثلًا صور و/أو روابط تالفة)

source: Your file has been deleted.
ar: حُذِف ملفّك.

source: Date Added
ar: تاريخ الإضافة

source: Type
ar: النوع

source: File {filename} exceeds maximum size of {maxFileSizeInMBs} MB
ar: يتجاوز حجم الملف {filename} الحدّ الأقصى المسموح به وهو {maxFileSizeInMBs} ميجابايت

source: Please follow the instructions here to upload a file elsewhere and link to it: {maxFileSizeRedirectUrl}
ar: يُرجى اتّباع التعليمات الواردة هنا لرفع الملف في مكان آخر وضع رابط له هنا: {maxFileSizeRedirectUrl}

source: Max file size exceeded
ar: تم تجاوز الحدّ الأقصى المسموح به لحجم الملف.

source: Upload New File
ar: ارفع ملفًا جديدًا

source: Load Another File
ar: حمِّل ملفًا آخَر

source: Are you sure you want to delete this update?
ar: هل أنت واثق من رغبتك في حذف هذا التحديث؟

source: Create Re-run
ar: أعِد طرح المساق

source: Processing Re-run Request
ar: تجري معالجة إعادة طرح المساق

source: An error has occurred. Wait a few minutes, and then try again.
ar: حدث خطأ. انتظر بضع دقائق ، ثم حاول مرة أخرى

source: Select turnaround
ar: اختر مخطط الانجاز

source: Select fidelity
ar: حدد الدقة

source: Select language
ar: حدد اللغة

source: Press Remove to remove language
ar: اضغط على إزالة لإزالة اللغة

source: Settings updated
ar: تم تحديث الإعدادات

source: Last updated
ar: آخر تحديث

source: Required
ar: مطلوب

source: Automatic transcripts are disabled.
ar: تم تعطيل النصوص التلقائية

source: {selectedProvider} credentials saved
ar: تم حفظ بيانات اعتماد {selectedProvider}

source: There has been an error while exporting.
ar: حدث خطأ أثناء التصدير.

source: There has been a failure to export to XML at least one component. It is recommended that you go to the edit page and repair the error before attempting another export. Please check that all components on the page are valid and do not display any error messages.
ar: حصل فشلٌ تصدير مكوِّن واحد على الأقل إلى صيغة XML. يُنصَح بالذهاب إلى صفحة التعديل وإصلاح الخطأ قبل محاولة التصدير مرة أخرى. ويُرجى التحقق من صحّة جميع المكوّنات الموجودة في الصفحة ومن أنّها لا تحوي أيّ رسائل خطأ.

source: Correct failed component
ar: صَحِّح المكوِّن الذي فشل

source: Return to Export
ar: عُد إلى التصدير

source: Your library could not be exported to XML. There is not enough information to identify the failed component. Inspect your library to identify any problematic components and try again.
ar: تعذر تصدير مكتبتك إلى ملف XML، ولا تتوفّر معلومات كافية لتحديد المكوِّن الذي فشِل. تفقَّد مكتبتك لتحديد أي مكوِّنات خاطئة ثمّ حاول مرّة أخرى.

source: Take me to the main library page
ar: خذني إلى صفحة المكتبة الرئيسية

source: Your course could not be exported to XML. There is not enough information to identify the failed component. Inspect your course to identify any problematic components and try again.
ar: تعذّر تصدير مساقك إلى ملف XML، لا تتوفر معلومات كافية لتحديد المكوّن الذي فشِل. تحقق من مساقك لتحديد أي مكوّنات خاطئة ثم حاول مرة أخرى.

source: Take me to the main course page
ar: خذني إلى صفحة المساق الرئيسية

source: The raw error message is:
ar: نص رسالة الخطأ:

source: There has been an error with your export.
ar: لقد حدث خطأ في التصدير.

source: Contains {count} group
ar: يحوي {count} مجموعة

source: Not in Use
ar: ليس قيد الاستخدام

source: Used in {count} location
ar: المستخدمة في {count} مواقع

source: group configuration
ar: إعدادات المجموعة

source: Add your first group configuration
ar: أضِف أول إعدادات مجموعة

source: You have not created any group configurations yet.
ar: لم تنشئ أي إعدادات للمجموعات بعد.

source: Upload instructor image.
ar: ارفع صورة للمدرِّس.

source: Files must be in JPEG or PNG format.
ar: يجب أن تكون الملفّات بصيغة JPEG أو PNG.

source: Delete this %(item_display_name)s?
ar: هل تريد حذف هذا الـ%(item_display_name)s؟

source: Deleting this %(item_display_name)s is permanent and cannot be undone.
ar: حذف هذا الـ %(item_display_name)s دائم المفعول وغير قابل للرجوع عنه.

source: There was an error changing the user's role
ar: حدث خطأ في تغيير دور المستخدم

source: Error adding user
ar: حدث خطأ في إضافة المستخدم

source: Error removing user
ar: حدث خطأ في إزالة المستخدم

source: A valid email address is required
ar: يجب إدخال عنوان بريد إلكتروني صالِح.

source: You must enter a valid email address in order to add a new team member
ar: يجب عليك أن تُدخِل عنوان صحيح للبريد الإلكتروني لتتمكّن من إضافة عضو جديد إلى الفريق.

source: Return and add email address
ar: ارجِع وأضف عنوان البريد الإلكتروني.

source: Already a member
ar: عضو مسجَّل من قبل

source: {email} is already on the {container} team. Recheck the email address if you want to add a new member.
ar: {email} هو عضو مسجَّل من قبل في فريق {container}.أعِد التحقّق من عنوان البريد الإلكتروني إذا أردت إضافة عضو جديد.

source: Return to team listing
ar: عُد إلى قائمة الفِرَق

source: Are you sure you want to restrict {email} access to “{container}”?
ar: هل أنت متأكّد من رغبتك في حذف {email} من مكتبة "{container}"؟

source: {display_name} Settings
ar: إعدادات {display_name}

source: Publish {display_name}
ar: انشر {display_name}

source: Publish all unpublished changes for this {item}?
ar: نشر جميع التغييرات غير المنشورة لهذا الـ{item}؟

source: Publish
ar: انشر

source: Highlights for {display_name}
ar: مقتطفات ل{display_name}

source: Enable Weekly Highlight Emails
ar: تفعيل رسائل بريد المقتطفات الاسبوعية

source: Enable
ar: تفعيل

source: Not yet
ar: ليس بعد

source: All Learners and Staff
ar: جميع المتعلّمين والطاقم

source: Basic
ar: أساسي

source: Visibility
ar: قابلية الرؤية

source: Validation Error While Saving
ar: حدثث خطأ أثناء الحفظ

source: Undo Changes
ar: تراجع عن التغييرات

source: Change Manually
ar: غيِّر يدويًّا

source: Course Index
ar: فهرس المساق

source: There were errors reindexing course.
ar: حدث خطاء في إعادة فهرسة المساق.

source: content group
ar: مجموعة المحتوى

source: Add your first content group
ar: أضف مجموعة المحتوى الأولى

source: You have not created any content groups yet.
ar: لم تنشئ أي مجموعات للمحتوى بعد.

source: Are you sure you want to remove this video from the list?
ar: هل أنت واثقٌ من رغبتك في حذف هذا الفيديو من القائمة؟

source: Removing a video from this list does not affect course content. Any content that uses a previously uploaded video ID continues to display in the course.
ar: لا يؤثر حذف فيديو من هذه القائمة على محتوى المقرر. ويستمر عرض أي محتوى يستخدم معرف فيديو مرفوع سابقًا في هذا المساق.

source: Your changes will not take effect until you save your progress. Take care with key and value formatting, as validation is not implemented.
ar: لن تعمل التغييرات التي أجريتها إلى أن تحفّظ تقدّمك فيها. تُرجى مراعاة الدقة في صياغة المفتاح والقيمة، حيث لا توجد آلية للتحقق منها.

source: Your policy changes have been saved.
ar: حُفّظت التغييرات التي أدخلتها على سياسة مساقك.

source: No validation is performed on policy keys or value pairs. If you are having difficulties, check your formatting.
ar: لم يتم تنفيذ عملية تحقّق من صحّة زوج القيم أو مفاتيح السياسة. إذا كنت تواجه أي صعوبات، تفقد صياغتها.

source: For grading to work, you must change all {oldName} subsections to {newName}.
ar: يجب أن تقوم بتغيير كل الأقسام الفرعية في {oldName} إلى {newName} كي يعمل التقييم.

source: Course Credit Requirements
ar: متطلّبات الساعات المعتمدة للمساق

source: The minimum grade for course credit is not set.
ar: لم تُحدَّد الحدّ الأدنى لعلامة التأهل للحصول على ساعات معتمدة للمساق.

source: Course pacing cannot be changed once a course has started.
ar: لا يمكن تغيير نوع المساق من حيث الجدول الزمني بعد بدئه.

source: {hours}:{minutes} (current UTC time)
ar: {hours}:{minutes} (توقيت غرينتش الحالي)

source: Upload your course image.
ar: ارفع صورة مساقك.

source: Upload your banner image.
ar: ارفع صورة ترويستك.

source: Upload your video thumbnail image.
ar: ارفع صورة الفيديو المصغرة.

source: The combined length of the organization, course number, and course run fields cannot be more than <%=limit%> characters.
ar: لا يمكن أن يزيد مجموع المحارف في حقول المؤسسة ورقم المساق وفترة طرح المساق عن <%=limit%> محرفًا.

source: The combined length of the organization and library code fields cannot be more than <%=limit%> characters.
ar: لا يمكن أن يزيد مجموع المحارِف في حقلي المؤسسة ورمز المكتبة عن <%=limit%> محرفًا.

source: You've made some changes
ar: لقد أجريت بعض التغييرات.

source: Your changes will not take effect until you save your progress.
ar: لن تصبح التغييرات التي أجريتها نافذة حتى تحفّظ خطوات التقدّم التي اتّخذتها.

source: You've made some changes, but there are some errors
ar: لقد أجريت بعض التغييرات، ولكن هناك أخطاء

source: Please address the errors on this page first, and then save your progress.
ar: يُرجى تصحيح الأخطاء في هذه الصفحة أوّلًا، ثم حفّظ تقدّمك.

source: Save Changes
ar: احفظ التغييرات

source: Add Thumbnail
ar: إضافة صورة مصغرة

source: Edit Thumbnail
ar: تحرير الصورة المصغرة

source: Image upload failed
ar: خطأ عند تحميل الصورة

source: {maxWidth}x{maxHeight} pixels
ar: {maxWidth}x{maxHeight} بكسل

source: Thumbnail for {videoName}
ar: صورة مصغرة لـ{videoName}

source: Add Thumbnail - {videoName}
ar: أضف صورة مصغرة - {videoName}

source: Video duration is {humanizeDuration}
ar: مدة الفيديو {humanizeDuration}

source: minutes
ar: دقائق

source: minute
ar: دقيقة

source: seconds
ar: ثواني

source: second
ar: ثانية

source: and
ar: و

source: Video image upload started
ar: بدأ تحميل صورة الفيديو

source: Video image upload completed
ar: اكتمل تحميل صورة الفيديو

source: This image file type is not supported. Supported file types are {supportedFileFormats}.
ar: نوع ملف الصورة هذا غير مدعوم. أنواع الملفات المدعومة هي {supportedFileFormats}.

source: The selected image must be smaller than {maxFileSizeInMB}.
ar: يجب أن تكون الصورة المحددة أصغر من {maxFileSizeInMB}.

source: The selected image must be larger than {minFileSizeInKB}.
ar: يجب أن تكون الصورة المحددة أكبر من {minFileSizeInKB}.

source: Could not upload the video image file
ar: لم نتمكّن من تحميل ملف صورة الفيديو.

source: Image upload failed.
ar: خطأ عند تحميل الصورة

source: The file could not be uploaded.
ar: لا يمكن تحميل الملف.

source: Hide transcripts ({transcriptCount})
ar: إخفاء النصوص ({transcriptCount})

source: Show transcripts ({transcriptCount})
ar: إظهار النصوص ({transcriptCount})

source: This file type is not supported. Supported file type is {supportedFileFormat}.
ar: نوع الملف هذا غير مدعوم. يمكن استخدام {supportedFileFormat}.

source: If you remove this transcript, the transcript will not be available for any components that use this video.
ar: إذا قمت بإزالة هذا النص ، فلن يكون النص متاحًا لأي مكوّن يستخدم هذا الفيديو.

source: Updating Tags
ar: يجري تحديث الوسوم

source: Actions
ar: الإجراءات

source: Unscheduled
ar: غير مجدوَل

source: Date
ar: التاريخ

source: Previous
ar: السابق

source: Action
ar: الإجراء

source: Large
ar: كبير

source: Zoom In
ar: تكبير

source: Zoom Out
ar: تصغير

source: Page number out of %(total_pages)s
ar: رقم الصفحة من أصل %(total_pages)s

source: Enter the page number you'd like to quickly navigate to.
ar: أدخل رقم الصفحة التي تريد الوصول إليها

source: Sorted by
ar: الترتيب حسب:

source: Clear search
ar: مسح البَحث

source: Mark as Answer
ar: عيِّن كإجابة

source: Unmark as Answer
ar: الغِ تعيينها كإجابة

source: Open
ar: افتح

source: Endorse
ar: أيِّد

source: Unendorse
ar: الغ التأييد

source: Follow
ar: متابعة

source: Unfollow
ar: الغِ المتابعة

source: Pin
ar: ثبِّت

source: Unpin
ar: الغِ التثبيت

source: Report abuse
ar: بلِّغ عن إساءة

source: Report
ar: بلِّغ

source: Unreport
ar: الغِ التبليغ

source: Vote for this post,
ar: صوِّت لهذا الموضوع

source: Load more
ar: حمِّل المزيد

source: Error posting your message.
ar: حدث خطأ في نشر رسالتك.

source: This post will be visible only to %(group_name)s.
ar: هذا المنشور مرئيٌّ فقط ل%(group_name)s

source: This post will be visible to everyone.
ar: هذا المنشور مرئيٌّ للجميع.

source: Add a Post
ar: أضف منشوراً

source: Visible to
ar: مرئي لـ

source: Discussion admins, moderators, and TAs can make their posts visible to all students or specify a single group.
ar: مدراء المناقشة والمنسقون ومجموعة مساعدي هيئة التدريس المجتمعية يستطيعون جعل منشوراتهم مرئيّة لجميع الطلّاب أو لمجموعة محددة.

source: All Groups
ar: كلّ المجموعات

source: Add a clear and descriptive title to encourage participation. (Required)
ar: أضف عنوان واضح ومفصل لتشجيع المشاركة. (مطلوب)

source: follow this post
ar: تابِع هذا المنشور

source: post anonymously
ar: انشُر من دون الكشف عن الهوية

source: post anonymously to classmates
ar: انشر أمام الزملاء من دون الكشف عن الهوية

source: Community TA
ar: مساعد تدريس متطوّع

source: This thread is closed.
ar: هذا الموضوع مُغلَق.

source: View discussion
ar: اعرِض المناقشة

source: Editing comment
ar: تعديل التعليق

source: Update comment
ar: تحديث التعليق

source: posted %(time_ago)s by %(author)s
ar: نشره %(author)s %(time_ago)s

source: Reported
ar: مبلَّغ عنه

source: Editing post
ar: تعديل الموضوع

source: Edit your post below.
ar: عدِّل موضوعك في الأسفل.

source: Update post
ar: تحديث المنشور

source: discussion
ar: مناقشة

source: answered question
ar: سؤال مُجاب

source: unanswered question
ar: سؤال غير مُجاب

source: Pinned
ar: مُثَبَّت

source: Following
ar: تحت المتابعة

source: {unread_comments_count} new
ar: الجديد: {unread_comments_count}

source: %(comments_count)s %(span_sr_open)scomments (%(unread_comments_count)s unread comments)%(span_close)s
ar: %(comments_count)s %(span_sr_open)sتعليقات (%(unread_comments_count)s تعليقات غير مقروءة)%(span_close)s

source: %(comments_count)s %(span_sr_open)scomments %(span_close)s
ar: %(comments_count)s %(span_sr_open)sتعليقات %(span_close)s

source: Editing response
ar: تعديل الرد

source: Update response
ar: تحديث الرد

source: marked as answer %(time_ago)s by %(user)s
ar: حدّدها %(user)s كإجابة %(time_ago)s

source: marked as answer %(time_ago)s
ar: حُدِّدَت كإجابة %(time_ago)s

source: endorsed %(time_ago)s by %(user)s
ar: أقرّها %(user)s كإجابة %(time_ago)s

source: endorsed %(time_ago)s
ar: أُقِرَّت %(time_ago)s

source: Show Comment (%(num_comments)s)
ar: أظهر (%(num_comments)s) تعليق

source: Add a comment
ar: أضِف تعليقًا

source: discussion posted %(time_ago)s by %(author)s
ar: موضوع نشره %(author)s %(time_ago)s

source: question posted %(time_ago)s by %(author)s
ar: سؤال نشره %(author)s %(time_ago)s

source: Closed
ar: مُغلق

source: Related to: %(courseware_title_linked)s
ar: متعلِّقٌ بِـ: %(courseware_title_linked)s

source: This post is visible only to %(group_name)s.
ar: هذا الموضوع مرئيٌّ فقط لـ %(group_name)s.

source: This post is visible to everyone.
ar: هذا الموضوع مرئيٌّ للجميع.

source: Post type
ar: نوع الموضوع

source: Questions raise issues that need answers. Discussions share ideas and start conversations. (Required)
ar: أسئلة التي تثير قضايا التي تحتاج إلى إجابات. مناقشات تبادل الأفكار وبدء المحادثات. (مطلوب)

source: Question
ar: سؤال

source: Discussion
ar: المناقشة

source: Add a Response
ar: أضف رداً

source: Add a response:
ar: أضف رداً:

source: Topic area
ar: مجال الموضوع
