Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
ar: إذا كانت الشعب مفعَّلة في مساقك، يمكنك استخدام مجموعات المحتوى لإنشاء محتوى تعليمي مخصص لشعب بعينها. وبتعبير آخر، يمكنك تخصيص المحتوى الذي تراه شعب معيَّنة في مساقك.

source: Each content group that you create can be associated with one or more cohorts. In addition to making course content available to all learners, you can restrict access to some content to learners in specific content groups. Only learners in the cohorts that are associated with the specified content groups see the additional content.
ar: كلّ مجموعة محتوى تقوم بإنشائها، تستطيع ربطها مع شعبة واحدة أو أكثر من شعبة. بالإضافة إلى إتاحة محتوى المساق لجميع المتعلّمين، تستطيع حصر الدخول إلى بعض من المحتوى على متعلّمين ضمن مجموعات محتوى معيّنة. وحدهم المتعلّمون ضمن الشُعب التي تمّ ربطها بمجموعات المحتوى المعيّنة يستطيعون رؤية المحتوى الإضافي.

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
ar: انقر على {em_start}مجموعة محتوى جديدة{em_end} لإضافة مجموعة محتوى جديدة. ولتعديل اسم مجموعة محتوى، أشِر إليها ثم انقر على {em_start}عدِّل{em_end}. لا يمكن حذف مجموعة محتوى إلا إذا لم تكن هناك أيُّ وِحدة تستخدمها. ولحذفها، أَشِر بالفأرة على خانتها وانقر على أيقونة الحذف.

source: Use experiment group configurations if you are conducting content experiments, also known as A/B testing, in your course. Experiment group configurations define how many groups of learners are in a content experiment. When you create a content experiment for a course, you select the group configuration to use.
ar: استخدم إعدادات المجموعة الخاصّة بالاختبار إن كنت تجري اختبارات المحتوى، والمتعارف عليها باسم اختبارات أ/ب ضمن مساقك. تحدّد إعدادات المجموعة الخاصّة بالاختبار عدد مجموعات المتعلّمين المدرجين ضمن اختبارات المحتوى. عندما تقوم بإنشاء اختبار محتوى لمساقك، تقوم بتحديد الإعدادات التي ستستخدمها للمجموعة.

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
ar: انقر على {em_start}إعدادات مجموعة جديدة{em_end} لإضافة إعدادات جديدة. ولتعديل الإعدادات، أشِر بالفأرة على خانتها وانقر على {em_start}عدِّل{em_end}.لا يمكن حذف مجموعة محتوى إلا إذا لم تكن مستخدمة في أيّ تجربة. ولحذفها، أَشِر بالفأرة على خانتها وانقر على أيقونة الحذف.

source: Details & Schedule
ar: التفاصيل والجدول الزمني

source: Welcome
ar: أهلًا بك

source: Welcome to {studio_name}
ar: أهلًا بك في {studio_name}

source: {studio_name} helps manage your online courses, so you can focus on teaching them
ar: يساعد {studio_name} على إدارة مساقاتك المتاحة عبر الإنترنت، حتى تركّز أنت على تدريسها.

source: {studio_name}'s Many Features
ar: الخصائص الكثيرة لـ {studio_name}

source: {studio_name} Helps You Keep Your Courses Organized
ar: يساعدك {studio_name} على إبقاء مساقاتك منظّمة

source: Enlarge image
ar: تكبير الصورة

source: Keeping Your Course Organized
ar: إبقاء مساقك منظّمًا

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
ar: تعد طريقة تنظيم لمساقك بمثابة العمود الفقري لهذا المساق. يتيح لك {studio_name} محرر {strong_start}خطة دراسية{strong_end}، مما يوفر هيكلية بسيطة، وآلية سهلة تعتمد على السحب والإفلات، لمساعدتك وطلابك على البقاء منظمين.

source: Simple Organization For Content
ar: تنظيم بسيط للمحتوى

source: {studio_name} uses a simple hierarchy of {strong_start}sections{strong_end} and {strong_start}subsections{strong_end} to organize your content.
ar: يستخدم {studio_name} هيكلية بسيطة تتكون من {strong_start}أقسام{strong_end} و {strong_start}أقسام فرعية{strong_end} لتنظيم المحتوى.

source: Change Your Mind Anytime
ar: غيّر رأيك في أيّ وقت

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
ar: يمكنك صياغة الخطة الدراسية وبناء المحتوى في أيّ مكان. تسمح لك الأدوات السهلة المعتمدة على السحب والإفلات بإعادة ترتيب المحتوى بسرعة.

source: Go A Week Or A Semester At A Time
ar: قسّم عملك بحيث تنتقل من أسبوع أو فصل إلى الآخر

source: Build and release {strong_start}sections{strong_end} to your students incrementally. You don't have to have it all done at once.
ar: ابنِ وانشُر {strong_start}الأقسام{strong_end} لطلابك تدريجيًا، حيث أن توفيرها كلها دُفعة واحدة ليس ضروريًّا.

source: Learning is More than Just Lectures
ar: التعلّم هو أكثر من مجرّد محاضرات

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
ar: يسمح لك {studio_name} بأن تبني محتوى مساقك بطريقة تعزّز التعلُّم. أدرِج محتوى الفيديو، والمناقشات، والعديد العديد من التمارين بنقرات قليلة وحَسب.

source: Create Learning Pathways
ar: إنشاء مسارات تعلّم

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
ar: ساعد طلّابك على استيعاب المفاهيم واحدًا تلو الآخَر، باستخدام الوسائط المتعدّدة، ولغة HTML، والتمارين.

source: Work Visually, Organize Quickly
ar: اعمل بالوسائل المرئية لتضمن تنظيمًا سريعًا

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
ar: اعتمد الوسائل المرئية في عملك وشاهد بالضبط ما سيراه طلّابك. وأعد تنظيم المحتوى كلّه عُبر السحب والإفلات.

source: A Broad Library of Problem Types
ar: مكتبة كبيرة تضمّ مختلف أنواع المسائل

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
ar: لا يقتصر {studio_name} على أسئلة متعددة الخيارات، بل ويدعم أيضًا أكثر من عشرة أنواع من المسائل لتتحدى قدرات طلابك.

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
ar: يوفر لك {studio_name} طريقة نشر بسيطة، وسريعة، وتدريجية. برفقة الأصدقاء.

source: Simple, Fast, and Incremental Publishing. With Friends.
ar: النشر السهل، والسريع، والمتزايد. مع الأصدقاء.

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
ar: يعمل {studio_name} كتطبيقات الويب المألوفة لديك، إلّا أنّه يفهم كيفية بنائك للمنهج التعليمي. يمكنك النشر إلى الوِب فور رغبتك في ذلك، أو أن تضيف المحتوى تدريجيًّا متى بدا ذلك مناسبًا. ومع المؤلّفين المشاركين، فبإمكانك تشكيل فريق متكامل ليبني مساقًا.

source: Instant Changes
ar: تغييرات فورية

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
ar: هل واجهت عطلًا؟ لا تقلق. فإنّ التغييرات التي تجريها تُنشر على الإنترنت عندما تنقر "حفظ"، أي وقتما أردت.

source: Release-On Date Publishing
ar: إطلاق النشر في وقت محدد مسبقًا

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
ar: عندما تنهي {strong_start}قسمًا{strong_end}، اختر متى ترغب بإطلاقه، وسيتكفل {studio_name} بالباقي. ابنِ مساقك تدريجيًّا.

source: Work in Teams
ar: اعمل ضمن فِرَق

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
ar: للمؤلفين المشاركين وصول كامل إلى كل أدوات التأليف نفسها. اجعل مساقك أفضل بالاعتماد على العمل الجماعي.

source: Sign Up for {studio_name} Today!
ar: سجّل عضويتك الآن في {studio_name}!

source: Sign Up & Start Making Your {platform_name} Course
ar: سجِّل الآن وابدأ في إنشاء مساقك على {platform_name}

source: Already have a {studio_name} Account? Sign In
ar: هل لديك مسبقًا حساب في {studio_name}؟ تفضل بالدخول

source: Outlining Your Course
ar: إنشائ خطة دراسية لمساقك

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
ar: خطة دراسية ثنائيّة المستوى بسيطة لتنظيم مساقك. استخدم السحب والإفلات، وشاهد مساقك في لحظة.

source: More than Just Lectures
ar: أكثر من مجرّد محاضرات

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
ar: أَنشئ بسرعة فيديوهات، ومقتطفات نصّية، ومناقشات ضمنية، ومختلف أنواع المسائل.

source: Publishing on Date
ar: النشر في التاريخ المحدّد

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
ar: حدّد ببساطة تاريخ القسم أو القسم الفرعي، وسيتولّى {studio_name} مهمّة نشره لطلّابك بالنيابة عنك.

source: We're having trouble rendering your component
ar: نواجه مشكلة في معالجة المكون الذي أضفته

source: Students will not be able to access this component. Re-edit your component to fix the error.
ar: لن يتمكّن الطلّاب من الوصول إلى هذا المكوِّن. إعِد تحرير مكوِّنك لتصحيح الخطأ.

source: Library Import
ar: استيراد مكتبة

source: Course Import
ar: استيراد مساق

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
ar: تأكّد من رغبتك في استيراد مكتبة قبل المتابعة. محتوى المكتبة المستوردة سيحلّ محلّ محتوى المكتبة القائمة. {em_start}لا يمكنك التراجع عن استيراد المكتبة{em_end}. قبل أن تتابع، نوصيك بتصدير المكتبة الحالية أوّلًا لتكون لديك نسخة احتياطية منها.

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
ar: يجب أن تكون المكتبة التي تستوردها ملف tar.gz. (أي ملف tar. مضغوط ببرنامج GNU Zip). ويجب أن يحوي ملفُ tar.gz. ملفَ library.xml، ويمكن أيضًا أن يحوي ملفات أخرى إلى جانبه.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
ar: تمرّ عملية الاستيراد بخمس مراحل. يجب أن تبقى في هذه الصفحة أثناء المرحلتين الأولَيَين. يمكنك مغادرة هذه الصفحة بعد أن تتم مرحلة الاستخراج. ولكنّنا نوصيك بعدم إجراء تغييرات هامَّة في مكتبتك إلى أن تتم عملية الاستيراد.

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
ar: تأكّد من رغبتك في استيراد مشاق قبل المتابعة. محتوى المساق المستورد سيحلّ محلّ محتوى المساق القائم. {em_start}لا يمكنك التراجع عن استيراد المساق{em_end}. قبل أن تتابع، نوصيك بتصدير المساق الحالي أوّلًا لتكون لديك نسخة احتياطية منه.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
ar: يجب أن يكون المساق الذي تستورده ملف tar.gz. (أي ملف tar. مضغوط ببرنامج GNU Zip). ويجب أن يحوي ملفُ tar.gz. ملفَ course.xml، ويمكن أيضًا أن يحوي ملفات أخرى إلى جانبه.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
ar: تمرّ عملية الاستيراد بخمس مراحل. يجب أن تبقى في هذه الصفحة أثناء المرحلتين الأولَيَين. يمكنك مغادرة هذه الصفحة بعد أن تتم مرحلة الاستخراج. ولكنّنا نوصيك بعدم إجراء تغييرات هامَّة في مساقك إلى أن تتم عملية الاستيراد.

source: Select a .tar.gz File to Replace Your Library Content
ar: اختر ملف tar.gz. لاستبدال محتوى مكتبتك

source: Select a .tar.gz File to Replace Your Course Content
ar: اختر ملفّ tar.gz. لاستبدال محتوى مساقك

source: Choose a File to Import
ar: اختر ملفًّا لاستيراده

source: File Chosen:
ar: الملف المختار:

source: Replace my library with the selected file
ar: استخدم الملف الذي اخترته ليحل محل مكتبتي

source: Replace my course with the selected file
ar: استخدم الملف الذي اخترته ليحل محل مساقي

source: Library Import Status
ar: حالة استيراد المكتبة

source: Course Import Status
ar: حالة استيراد المساق

source: Transferring your file to our servers
ar: يجري إرسال ملفك إلى خوادمنا

source: Unpacking
ar: يجري استخراجه

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
ar: إظهار وإعداد هيكلية الملفات/المجلّدات (يمكنك الآن مغادرة هذه الصفحة بأمان، لكن تجنّب إجراء تغييرات جذرية في المحتوى إلى أن يتم هذا الاستيراد)

source: Verifying
ar: يجري التحقق

source: Reviewing semantics, syntax, and required data
ar: استعراض الدلالات، والصياغة، والبيانات المطلوبة

source: Updating Library
ar: يجري تحديث المكتبة

source: Updating Course
ar: يجري تحديث المساق

source: Integrating your imported content into this library. This process might take longer with larger libraries.
ar: يجري ربط المحتوى الذي استوردته في هذه المكتبة. وقد تستغرق هذه العملية وقتًا أطول في المكتبات كبيرة.

source: Integrating your imported content into this course. This process might take longer with larger courses.
ar: يجري ربط المحتوى الذي استوردته في هذا المساق. وقد تستغرق هذه العملية وقتًا أطول في المساقات كبيرة.

source: Your imported content has now been integrated into this library
ar: لقد تم الآن ربط المحتوى الذي استوردته بهذه المكتبة

source: Your imported content has now been integrated into this course
ar: لقد تم الآن ربط المحتوى الذي استوردته بهذا المساق

source: View Updated Library
ar: شاهد المكتبة المحدَّثة

source: View Updated Outline
ar: شاهد الخطة الدراسيّة المحدَّثة

source: Why import a library?
ar: ما الهدف من استيراد مكتبة؟

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
ar: قد ترغب في تحديث إصدار إحدى المكتبات القائمة أو استبدالها بالكامل. وقد تكون أنشأت أيضًا مكتبة خارج {studio_name}.

source: Note: Library content is not automatically updated in courses
ar: ملاحظة: لا يجري تحديث محتوى المكتبة تلقائيًا في المساقات.

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
ar: إذا غيّرت واستوردتَ مكتبةً مشارًا إليها في كتل عشوائية من المحتويات في مساقٍ واحد أو أكثر، فإنّ هذه المساقات لن تستخدم المحتوى المحدَّث تلقائيًّا، بل عليك تحديث الكتل العشوائية للمحتوى يدويًّا لجعلها مواكبة لأحدث محتوى في المكتبة.

source: Learn more about importing a library
ar: اعرف المزيد عن استيراد مكتبة

source: Why import a course?
ar: ما الهدف من استيراد مساق؟

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
ar: قد ترغب في تشغيل إصدار جديد من مساق قائم، أو استبدال مساق قائم بالكامل، أو ربما طوّرت مساقًا خارج {studio_name}.

source: What content is imported?
ar: ما هو المحتوي الذي يُستورد؟

source: The following content is imported.
ar: هذا المحتوى مستورد

source: The following content is not imported.
ar: هذا المحتوى غير مستورد

source: Warning: Importing while a course is running
ar: تحذير: الاستيراد أثناء تشغيل المساق

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
ar: إذا أجريت عملية استيراد أثناء تشغيل مساقك وأقدمت على تغيير أسماء الروابط (أو عقد url_name) لأيّ مكوِّنات تتعلق بالمسائل، فإنّ بيانات الطلاب المرتبطة بهذه المكوِّنات قد تُفقَد، بما فيها علامات الطلّاب في المسائل.

source: Learn more about importing a course
ar: اعرف المزيد عن استيراد مساق

source: {studio_name} Home
ar: الصفحة الرئيسية لـ{studio_name}

source: New Course
ar: مساق جديد

source: Email staff to create course
ar: مراسلة فريق العمل لإنشاء مساق

source: New Library
ar: مكتبة جديدة

source: Please correct the highlighted fields below.
ar: يُرجى تصحيح الحقول الموضّحة أدناه.

source: Create a New Course
ar: أنشئ مساقًا جديدًا

source: Required Information to Create a New Course
ar: المعلومات المطلوبة لإنشاء مساق جديد

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
ar: اسم الظاهر للعموم لمساقك. لا يمكن تغيير هذا الاسم ولكن يمكنك لاحقًا تحديد اسم ظاهر مختلف من خلال "الإعدادات المتقدّمة".

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
ar: اسم المؤسسة الراعية للمساق. {strong_start}ملاحظة: اسم المؤسسة هو جزء من رابط المساق.{strong_end} لا يمكن تغيير هذا إلا أن بإمكانك تحديد اسم ظاهر مختلف لاحقًا من خلال "الإعدادات المتقدّمة".

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ar: المعرِّف الفريد لمساقك في مؤسستك. {strong_start} ملاحظة: هذا جزء من رابط مساقك، لذا لا يُسمح باستخدام فراغات أو محارف خاصة، ولا يمكن تغييره.{strong_end}

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
ar: الفصل الذي سيُطرح فيه مساقك. {strong_start} ملاحظة: هذا جزء من رابط مساقك، لذا لا يُسمح باستخدام فراغات أو محارف خاصة، ولا يمكن تغييره.{strong_end}

source: Create
ar: أنشئ

source: Create a New Library
ar: أنشئ مكتبة جديدة

source: Required Information to Create a New Library
ar: المعلومات المطلوبة لإنشاء مكتبة جديدة

source: Library Name
ar: اسم المكتبة

source: e.g. Computer Science Problems
ar: مثلًا، مسائل علم الحاسوب

source: The public display name for your library.
ar: الاسم الظاهر للعموم لمكتبتك

source: The public organization name for your library.
ar: الاسم العلني للمؤسسة لمكتبتك

source: This cannot be changed.
ar: لا يمكنك تغييرها.

source: Library Code
ar: رمز المكتبة

source: e.g. CSPROB
ar: مثلًا، CSPROB

source: The unique code that identifies this library. {strong_start}Note: This is part of your library URL, so no spaces or special characters are allowed.{strong_end} This cannot be changed.
ar: يُعرف الرمز الفريد هذه المكتبة. {strong_start} ملاحظة: هذا جزء من رابط مكتبتك، بل يُسمح باستخدام الفراغات أو المحارف الخاصّة.{strong_end} لا يمكن تغيير هذا الجزء.

source: Organization and Library Settings
ar: المؤسّسة وإعدادات المكتبة

source: Show all courses in organization:
ar: إظهار كل المساقات في المؤسسة:

source: For example, MITx
ar: مثلًا، MITx

source: Courses Being Processed
ar: المساقات الجاري معالجتها

source: This course run is currently being created.
ar: يجري حاليًّا إنشاء طرح لهذا المساق.

source: Configuring as re-run
ar: الضبط كإعادة طرح

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
ar: سيُضاف المساق الجديد إلى قائمة مساقاتك في غضون 5-10 دقائق. عُد إلى هذه الصفحة أو {link_start}حدِّثها{link_end} لتحديث قائمة المساقات. وسيتطلّب المساق الجديد ضبط بعض الإعدادات يدويًّا.

source: This re-run processing status:
ar: حالة معالجة طلب إعادة الطرح هذه:

source: Configuration Error
ar: خطأ في الإعدادات

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
ar: حدث خطأ في النظام أثناء معالجة مساقك. يُرجى الذهاب إلى المساق الأساسي وتجربة إعادة الطرح مرة أخرى، أو الاتصال بمدير مشروعك للحصول على المساعدة.

source: Archived Courses
ar: الساقات المؤرشفة

source: Libraries
ar: المكتبات

source: Are you staff on an existing {studio_name} course?
ar: هل تنتمي إلى طاقم مساق قائم في {studio_name}؟

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
ar: يجب أن يضيفك منشئ المساق إلى المساق. تواصل معه أو مع مدير المساق الذي تساعد على تأليفه.

source: Create Your First Course
ar: أنشئ أول مساق لك

source: Your new course is just a click away!
ar: ستجد مساقك الجديد على بعد نقرة واحدة فقط!

source: Becoming a Course Creator in {studio_name}
ar: ستغدو "منشئ مساق" في {studio_name}

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
ar: إنَّ {studio_name} مستضاف لدى شركائنا في xConsortium وبعض الضيوف. وتظهر أعلاه المساقات التي أنت عضو فيها ويمكنك تعديلها، في حين أنّ صلاحيات منشئ المساق تمنحها {platform_name}. وسوف يقيِّم فريقنا طلبك ويزوّدك بالملاحظات والآراء في غضون 24 ساعة خلال أسبوع العمل.

source: Your Course Creator Request Status:
ar: حالة الطلب الذي قدّمته لتكون مُنشئ مساق:

source: Request the Ability to Create Courses
ar: اطلب صلاحية إنشاء المساقات

source: Your Course Creator Request Status
ar: حالة الطلب الذي قدّمته لتكون مُنشئ مساق

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
ar: إنَّ {studio_name} مستضاف لدى شركائنا في xConsortium وبعض الضيوف. وتظهر أعلاه المساقات التي أنت عضو فيها ويمكنك تعديلها، في حين أنّ صلاحيات منشئ المساق تمنحها {platform_name}. لقد أتمَّ فريقنا تقييم طلبك.

source: Your Course Creator request is:
ar: الطلب الذي قدّمته لتكون مُنشئ مساق:

source: Your request did not meet the criteria/guidelines specified by {platform_name} Staff.
ar: لم يلبِّ طلبك المعايير/الإرشادات التي حدّدها طاقم {platform_name}.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
ar: إنَّ {studio_name} مستضاف لدى شركائنا في xConsortium وبعض الضيوف. وتظهر أعلاه المساقات التي أنت عضو فيها ويمكنك تعديلها، في حين أنّ صلاحيات منشئ المساق تمنحها {platform_name}. يعمل فريقنا الآن على تقييم طلبك.

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
ar: يقوم طاقم {platform_name} بمراجعة طلبك حاليًّا، وسيقومون بتحديثه قريبًا.

source: Were you expecting to see a particular library here?
ar: هل كنتَ تتوقّع رؤية مكتبة معيَّنة هنا؟

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
ar: يجب أن يمنحك منشئ المكتبة صلاحية الوصول إلى المكتبة. تواصل معه أو مع مدير المكتبة التي تساعد على تأليفها.
