Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Log into My {platform_name} Account
ar: الدخول إلى حسابي في {platform_name}

source: Access My Courses
ar: الوصول إلى مساقاتي

source: Processing your account information
ar: تجري معالجة معلومات حسابك

source: Please log in
ar: يُرجى الدخول

source: to access your account and courses
ar: للوصول إلى حسابك ومساقاتك

source: We're Sorry, {platform_name} accounts are unavailable currently
ar: عذرًا، إنّ حسابات {platform_name} غير متاحة حاليًّا

source: We couldn't log you in.
ar: لم نتمكّن من إدخالك.

source: Your email or password is incorrect
ar: قيمة غير صحيحة في عنوان بريدك الإلكتروني أو كلمة المرور

source: An error occurred when signing you in to {platform_name}.
ar: حدث خطأ أثناء دخولك إلى {platform_name}.

source: Please provide the following information to log into your {platform_name} account. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ar: يُرجى إدخال المعلومات التالية لتتمكّن من الدخول إلى حسابك في {platform_name}. ويُشار إلى الحقول الإلزامية باستخدام <strong class="indicator">نصوص بالخطّ العريض وعلامة النجمة (*)</strong> .

source: Account Preferences
ar: تفضيلات الحساب

source: Sign in with {provider_name}
ar: الدخول باستخدام حساب {provider_name}

source: External resource
ar: مصدر خارجي

source: {points} / {total_points} points
ar: علامتك هي {points} / {total_points}

source: {total_points} points possible
ar: العلامة العليا {total_points}

source: View resource in a new window
ar: اعرض المصدر في نافذة جديدة

source: Please provide launch_url. Click "Edit", and fill in the required fields.
ar: يُرجى توفير رابط التشغيل. انقر على "تعديل"، ثمّ املأ الحقول المطلوبة.

source: Feedback on your work from the grader:
ar: آراء و ملاحظات المسؤول عن التقييم حول عملك:

source: Press to Launch
ar: يُرجى الضغط للتشغيل

source: Manage student accounts
ar: إدارة حسابات الطلاب

source: Username:
ar: اسم المستخدم:

source: Profile:
ar: الملف الشخصي:

source: Image:
ar: الصورة:

source: Name:
ar: الاسم:

source: Choose an action:
ar: اختر إجراءً:

source: View Profile
ar: اعرض الملف الشخصي

source: Disable Account
ar: عطِّل الحساب

source: Reenable Account
ar: أعد تفعيل الحساب

source: Remove Profile Image
ar: أزِل صورة الملف الشخصي

source: Students whose accounts have been disabled
ar: الطلّاب الذين عُطِّلَت حساباتهم

source: (reload your page to refresh)
ar: (أعِد تحميل صفحتك لتحديثها)

source: working
ar: يجري العمل

source: There has been an error on the {platform_name} servers
ar: حدث خطأ ما في خوادم منصّة {platform_name}

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
ar: عذرًا، إنّ هذه الوحدة غير متوفّرة مؤقّتًا. ويعمل طاقمنا على إصلاحها في أقرب وقت ممكن. تُرجى مراسلتنا على البريد الإلكتروني {tech_support_email} للإبلاغ عن أي مشاكل أو فترات تعطّل.

source: Raw data:
ar: البيانات الأوّلية:

source: You do not have any notes.
ar: ليست لديك أي ملاحظات.

source: Course View
ar: عرض المساق

source: View this course as:
ar: اعرض هذا المساق كـ:

source: Learner
ar: متعلّم

source: Specific learner
ar: متعلّم محدد

source: Learner in {content_group}
ar: متعلّم ضمن {content_group}

source: Username or email:
ar: اسم المستخدم أو البريد الإلكتروني:

source: Set preview mode
ar: اضبط وضعية المعاينة

source: You are now viewing the course as {i_start}{user_name}{i_end}.
ar: أنت الآن تعرض المساق بصفتك {i_start}{user_name}{i_end}.

source: You have used {num_used} of {num_total} attempt
ar: لم تستخدم أيّ محاولات من أصل {num_total}

source: Some problems have options such as save, reset, hints, or show answer. These options follow the Submit button.
ar: تحوي بعض المسائل خيارات مثل "حفظ" أو "إعادة تعيين" أو "تلميحات" أو "إظهار الإجابة". وتتبع هذه الخيارات زر "إرسال".

source: Hint
ar: تلميح

source: Save
ar: حفظ

source: Save your answer
ar: إحفظ إجابتك

source: Reset your answer
ar: تغيير إجابتك

source: Answers are displayed within the problem
ar: ستظهر الإجابات داخل المسألة

source: Next Hint
ar: التلميح التالي

source: Review
ar: مراجعة

source: Log In
ar: الدخول

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
ar: سيُرسَل اسم المستخدم، والبريد الإلكتروني، والاسم الكامل إلى {destination}، حيث ستخضع عمليّة جمع هذه المعلومات واستخدامها لشروط الخدمة وسياسة الخصوصية المعتمدة هناك.

source: Return To %s
ar: العودة إلى %s

source: We're sorry, but this version of your browser is not supported. Try again using a different browser or a newer version of your browser.
ar: عذرًا، هذا الإصدار من متصفّحك غير مدعومة. أعِد المحاولة إما باستخدام متصفّح آخر أو بتحديث إصدار متصفّحك الحالي.

source: The following errors occurred while processing your registration:
ar: حدثت الأخطاء التالية أثناء معالجة عملية تسجيلك:

source: Sign up with {provider_name}
ar: سجِّل باستخدام حساب {provider_name}

source: Create your own {platform_name} account below
ar: أنشِئ حسابًا لك في {platform_name} أدناه

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ar: يُشار إلى الحقول الإلزامية باستخدام <strong class="indicator">نصّ بالخط العريض وعلامة النجمة (*)</strong>.

source: You've successfully signed in with {selected_provider}.
ar: نجحت بالدخول باستخدام حساب {selected_provider}.

source: We just need a little more information before you start learning with {platform_name}.
ar: نحتاج فقط إلى القليل من المعلومات الإضافية قبل أن تبدأ التعلّم في {platform_name}.

source: Please complete the following fields to register for an account.
ar: يُرجى إكمال الحقول التالية للتسجيل وإنشاء حساب.

source: Your legal name, used for any certificates you earn.
ar: اسمك القانوني، المستخدم في أيّ شهادة تحصل عليها.

source: Will be shown in any discussions or forums you participate in
ar: سيظهر في أي نقاشات أو منتديات تشارك فيها

source: cannot be changed later
ar: لا يمكن تغييره لاحقًا

source: Welcome {username}
ar: مرحبًا يا {username}

source: Enter a Public Display Name:
ar: أدخِل اسمك الذي سيظهر للآخرين:

source: Public Display Name
ar: الاسم العلني

source: Additional Personal Information
ar: معلومات شخصية إضافية

source: example: New York
ar: مثال: مكة المكرمة

source: Highest Level of Education Completed
ar: أعلى درجة علمية حصلت عليها

source: Please share with us your reasons for registering with {platform_name}
ar: نرجو منك مشاركتنا الأسباب التي دفعتك للتسجيل في {platform_name}

source: Account Acknowledgements
ar: الإقرارات الخاصة بالحساب

source: I agree to the {link_start}Terms of Service{link_end}
ar: أوافق على {link_start} شروط الخدمة {link_end}

source: I agree to the {link_start}Honor Code{link_end}
ar: أوافق على {link_start}ميثاق الشرف{link_end}

source: Register
ar: أنشئ حساب

source: Create My Account
ar: أنشئ حسابي

source: Preferences for {platform_name}
ar: تفضيلات {platform_name}

source: Update my {platform_name} Account
ar: حدِّث حسابي في {platform_name}

source: Welcome {username}! Please set your preferences below
ar: مرحبًا يا {username}! نرجومنك أن تحدِّد ما تفضِّله أدناه

source: Enter a public username:
ar: أدخِل اسم المستخدم العلنيّ:

source: Update My Account
ar: حدِّث حسابي

source: Registration Help
ar: المساعدة في التسجيل

source: Already registered?
ar: هل لديك حساب؟

source: Log in
ar: الدخول

source: Welcome to {platform_name}
ar: أهلًا وسهلًا بك في {platform_name}

source: Registering with {platform_name} gives you access to all of our current and future free courses. Not ready to take a course just yet? Registering puts you on our mailing list - we will update you as courses are added.
ar: يمنحك حسابك في {platform_name} صلاحية الوصول إلى جميع مساقاتنا المجّانية الحالية والمستقبلية. ألم تستعدّ بعد للتسجيل في أحد المساقات؟ يضعك الحساب في {platform_name}على قائمة مراسلاتنا، بحيث سنبقيك على اطّلاع على المساقات التي تُضاف.

source: Next Steps
ar: الخطوات التالية

source: As part of joining {platform_name}, you will receive an email message with instructions for activating your account. Don't see the email? Check your spam folder and mark {platform_name} emails as 'not spam'. At {platform_name}, we communicate mostly through email.
ar: كجزءٍ من عملية التسجيل في {platform_name}، ستصلك رسالة تفعيل عبر البريد الإلكتروني مع تعليمات لكيفية تفعيل الحساب. إن لم تجد هذه الرسالة، فتحقّق من صندوق البريد المهمل أو الرسائل غير المرغوب فيها، وحدد الرسائل الواردة من {platform_name} على أنّها ’ليست رسائل غير مرغوبة‘. إنّنا في {platform_name} نستخدم البريد الإلكتروني في غالب مراسلاتنا.

source: Need help registering with {platform_name}?
ar: هل تحتاج إلى المساعدة في فتح التسجيل في {platform_name}؟

source: View our FAQs for answers to commonly asked questions.
ar: تفضَّل بزيارة صفحة الأسئلة الشائعة لتجد الإجابات على الأسئلة الأكثر شيوعًا.

source: You can find the answers to most of your questions in our list of FAQs. After you enroll in a course, you can also find answers in the course discussions.
ar: بإمكانك أن تجد إجابات لمعظم أسئلتك في صفحة الأسئلة الشائعة. كما تستطيع بعد انضمامك لمساق ما أن تجد بعض الإجابات لأسئلة أخرى في قسم المناقشات في المساق.

source: Register for {platform_name}
ar: أنشئ حساباً في {platform_name}

source: Create My {platform_name} Account
ar: إنشاء حسابي في {platform_name}

source: Welcome!
ar: أهلًا بك!

source: Register below to create your {platform_name} account
ar: سجِّل أدناه لإنشاء حسابك في {platform_name}

source: Re-subscribe Successful!
ar: نجحت إعادة الاشتراك!

source: You have re-enabled forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}.
ar: لقد أعدتَ تفعيل رسائل البريد الإلكتروني الواردة من {platform_name} بشأن إشعارات المنتدى. يمكنك {dashboard_link_start} العودة إلى صفحة "لوحتي التعليمية"الخاصّة بك {link_end}.

source: Important!
ar: هام!

source: Previous
ar: السابق

source: Next
ar: التالي

source: Sequence
ar: تسلسل

source: Sign Up for {platform_name}
ar: التسجيل في {platform_name}

source: e.g. yourname@domain.com
ar: مثلًا، yourname@domain.com

source: e.g. yourname (shown on forums)
ar: مثلًا، اسمك (كما يظهر في المنتديات)

source: e.g. Your Name (for certificates)
ar: مثلًا، اسمك (كما سيظهر على الشهادات)

source: <i>Welcome</i> {name}
ar: <i>مرحبًا بك يا</i> {name}

source: Full Name *
ar: الاسم الكامل *

source: Ed. Completed
ar: استُكمِل التعديل

source: Goals in signing up for {platform_name}
ar: هدفك من التسجيل في {platform_name}

source: Already have an account?
ar: ألديك حساب مسبقاً؟

source: Login.
ar: الدخول.

source: This content experiment uses group configuration '{group_configuration_name}'.
ar: ترتكز تجربة المحتوى هذه على إعدادات المجموعة '{group_configuration_name}'

source: Active Groups
ar: المجموعات النشطة

source: Inactive Groups
ar: المجموعات غير النشطة

source: Staff Debug Info
ar: معلومات تصحيح الأخطاء لطاقم المساق

source: Submission history
ar: تاريخ التقديمات

source: {platform_name} Content Quality Assessment
ar: تقييم جودة محتوى {platform_name}

source: Comment
ar: تعليق

source: comment
ar: تعليق

source: Tag
ar: وسم

source: Optional tag (eg "done" or "broken"):
ar: وسم اختياري (مثلًا "انتهى" أو "لا يعمل"):

source: tag
ar: وسم

source: Add comment
ar: أضِف تعليقًا

source: Staff Debug:
ar: تصحيح طاقم العمل:

source: Actions
ar: الإجراءات

source: Score (for override only)
ar: النتيجة (للتجاوز فقط)

source: Reset Learner's Attempts to Zero
ar: صفِّر عدّاد محاولات المتعلمين

source: Delete Learner's State
ar: احذف حالة الطالب

source: Rescore Learner's Submission
ar: أعِد تصحيح ما سلّمه الطالب

source: Rescore Only If Score Improves
ar: احتسب العلامة الجديدة فقط إذا كانت أعلى من سابقتها

source: Override Score
ar: تجاوز النتيجة

source: Module Fields
ar: حقول الوحدة

source: XML attributes
ar: خصائص XML

source: Submission History Viewer
ar: عارِض سجلّ التقديمات

source: User:
ar: المستخدم:

source: View History
ar: اعرِض السجلّ

source: {course_number} Textbook
ar: كتاب المساق رقم {course_number}

source: Textbook Navigation
ar: تصفّح الكتاب

source: Page
ar: الصفحة

source: Previous page
ar: الصفحة السابقة

source: Next page
ar: الصفحة التالية

source: Sysadmin Dashboard
ar: صفحة إدارة النظام

source: Users
ar: المستخدمون

source: Staffing and Enrollment
ar: التوظيف والتسجيل

source: Git Logs
ar: سجلّات Git

source: User Management
ar: إدارة المستخدمين

source: Email or username
ar: عنوان البريد الإلكتروني أو اسم المستخدم

source: Delete user
ar: احذف مستخدِمًا

source: Create user
ar: أنشئ مستخدمًا

source: Download list of all users (csv file)
ar: تنزيل قائمة بكافة المستخدمين (ملف بصيغة csv)

source: Check and repair external authentication map
ar: التحقّق من خارطة الاستيثاق الخارجية وإصلاحها

source: Go to each individual course's Instructor dashboard to manage course enrollment.
ar: اذهب إلى صفحة مكتب مدرِّس كلّ مساق لإدارة عمليات الالتحاق بالمساق

source: Manage course staff and instructors
ar: إدارة طاقم المساق وأساتذته

source: Download staff and instructor list (csv file)
ar: تنزيل قائمة بطاقم المساق وأساتذته (ملف بصيغة csv)

source: Administer Courses
ar: إدارة المساقات

source: Repo Location
ar: موقع المستودع

source: Repo Branch (optional)
ar: فرع المستودع (اختياري)

source: Load new course from GitHub
ar: تحميل مساق جديد من موقع "github"

source: Course ID or dir
ar: معرِّف المساق أو مكانه

source: Delete course from site
ar: حذف المساق من الموقع

source: Platform Version
ar: إصدار المنصّة

source: previous
ar: السابق

source: Page {current_page} of {total_pages}
ar: الصفحة {current_page} من {total_pages}

source: next
ar: التالي

source: Recent git load activity for {course_id}
ar: أحدث نشاطات تحميل git لمساق {course_id}

source: Date
ar: التاريخ

source: Git Action
ar: عملية Git

source: No git import logs have been recorded.
ar: لم تُحفَّظ أي سجلّات استيراد git.

source: No git import logs have been recorded for this course.
ar: لم تُحفَّظ أي سجلّات استيراد git لهذا المساق.

source: Text Me The App
ar: راسلني عبر التطبيق

source: Source:
ar: المصدر:

source: Tracking Log
ar: سجل التتبّع

source: datetime
ar: الموعِد

source: ipaddr
ar: عنوان IP

source: source
ar: المصدر

source: type
ar: النوع

source: Unsubscribe Successful!
ar: نجح إلغاء الاشتراك!

source: You will no longer receive forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}. If you did not mean to do this, {undo_link_start}you can re-subscribe{link_end}.
ar: لن تتلقّى بعد الآن أي رسائل بريد إلكتروني تخص إشعارات منتدى من {platform_name}. يُمكنك {dashboard_link_start}العودة إلى صفحة "لوحتي التعليمية" الخاصّة بك {link_end}. أما إذا لم تقصد القيام بذلك، {undo_link_start}يُمكنك إعادة التسجيل{link_end}.

source: Dashboard for:
ar: صفحة "لوحتي التعليمية" لـ:

source: More options
ar: المزيد من الخيارات

source: More Options
ar: المزيد من الخيارات

source: Using the system
ar: باستخدام النظام

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
ar: أثناء تشغيل الفيديو، استخدِم العناوين الفرعية وشريط التمرير للتصفّح. ويُعدّ النقر على العناوين الفرعية طريقة سريعة للانتقال إلى الأمام أو الخلف في الفيديو بمسافات قليلة.

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
ar: إذا كانت شاشتك قليلة الدقّة، يمكن إخفاء شريط التصفّح الأيسر عبر النقر على مجموعة الأسهم الثلاثة اليسرى المجاورة له.

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
ar: إذا احتجت إلى خطوط أكبر أو أصغر، فاستخدم إعدادات متصفّحاتك لتكبيرها أو تصغيرها. وبإمكانك أن تفعل هذا في متصفّح جوجل كروم عبر الضغط على زر Ctrl مع إشارة الجمع أو الطرح.

source: Loading video player
ar: تحميل مشغّل الفيديو

source: Play video
ar: شغِّل الفيديو

source: No playable video sources found.
ar: لم يُعثر على مصادر فيديو قابلة للتشغيل.

source: Your browser does not support this video format. Try using a different browser.
ar: متصفحك لا يدعم صيغة هذا الفيديو. يُرجى محاولة استخدام متصفّح آخر.

source: Downloads and transcripts
ar: التنزيلات والنصوص

source: Download video file
ar: تنزيل ملف الفيديو

source: Transcripts
ar: التفريغ النصيّ

source: Download {file}
ar: تنزيل {file}

source: Download transcript
ar: تنزيل التفريغ النصيّ

source: Handouts
ar: أوراق العمل

source: Download Handout
ar: تنزيل أوراق العمل

source: {num} of {total}
ar: {num} من {total}

source: Your words were:
ar: كلماتك كانت:

source: API Access Request
ar: طلب وصول إلى واجهة برمجة التطبييقات

source: {platform_name} API Access Request
ar: طلب وصول لواجهة برمجة تطبيقات {platform_name}

source: Request API Access
ar: طلب وصول لواجهة برمجة التطبيقات

source: API Access Request Status
ar: حالة طلب الوصول إلى واجهة برمجة التطبيقات

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
ar: تجري معالجة طلبك للوصول إلى واجهة برمجة تطبيقات مساقات {platform_name}. ستصلك رسالة على عنوان البريد الإلكتروني الموجود في ملفك الشخصي عند اكتمال عملية المعالجة. يمكنك أيضاً الرجوع إلى هذه الصفحة للاطلاع على حالة طلبك للوصول إلى واجهة برمجة التطبيقات.

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
ar: تم رفض طلبك للوصول إلى واجهة برمجة تطبيقات مساقات {platform_name}. إذا كنت تعتقد أن هذا خطأ، أو إذا كانت لديك استفسارات أخرى بشأن استخدام واجهة برمجة التطبيقات هذه، فاتصل ب{api_support_email_link}.

source: Your request to access the {platform_name} Course Catalog API has been approved.
ar: تم قبول طلبك للوصول إلى واجهة برمجة تطبيقات مساقات {platform_name}.

source: Application Name
ar: اسم التطبيق

source: API Client ID
ar: معرف عميل واجهة برمجة التطبيقات

source: API Client Secret
ar: كلمة مرور عميل واجهة برمجة التطبيقات

source: Redirect URLs
ar: عناوين إعادة التوجيه

source: If you would like to regenerate your API client information, please use the form below.
ar: إذا كنت ترغب في إعادة إنشاء معلومات عميل واجهة برمجة التطبيقات الخاصة بك، فاستخدم النموذج الذي في الأسفل.

source: Generate API client credentials
ar: أنشئ بيانات الوصول إالي واجهة برمجة التطبيقات

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
ar: لمعرفة المزيد عن واجهة برمجة تطبيقات مساقات {platform_name}، فقم بزيارة {link_start}صفحة توثيق واجهة برمجة التطبيقات{link_end}. للإجابة على الأسئلة المتعلقة باستخدام واجهة برمجة التطبيقات هذه، اتصل ب{api_support_email_link}.

source: API Terms of Service
ar: شروط خدمة واجهة برمجة التطبيقات

source: Terms of Service for {platform_name} APIs
ar: شروط خدمة واجهة برمجة التطبيقات لمنصة {platform_name}

source: Effective Date: April 12th, 2016
ar: يُعتمَد بدءًا من تاريخ: ١٢ أبريل، ٢٠١٦

source: Welcome to {platform_name}. Thank you for using {platform_name}'s Course Discovery API, Enterprise API and/or any additional APIs that we may offer from time to time (collectively, the "APIs"). Please read these Terms of Service prior to accessing or using the APIs. These Terms of Service, any additional terms within accompanying API documentation, and any applicable policies and guidelines that {platform_name} makes available and/or updates from time to time are agreements (collectively, the "Terms") between you and {platform_name}. These Terms are issued under the enterprise product agreement, member participation agreement, or other direct agreement governing the purchase of {platform_name} products, if any (the "Agreement"), executed by you or the party on whose behalf you are accessing or using the APIs and {platform_name}. In the event that you have such an Agreement that applies to your use of the APIs, the Agreement will control in the event of any conflict between it and these Terms. By accessing or using the APIs, you accept and agree to be legally bound by the Terms, whether or not you are a registered user. If you are accessing or using the APIs on behalf of a company, organization or other legal entity, you are agreeing to these Terms for that entity and representing and warranting to {platform_name} that you have full authority to accept and agree to these Terms for such entity, in which case the terms "you," "your" or related terms herein shall refer to such entity on whose behalf you are accessing or using the APIs. If you do not have such authority or if you do not understand or do not wish to be bound by the Terms, you should not use the APIs.
ar: مرحبًا بك في {platform_name}. نشكرك على استخدام واجهة برمجة التطبيقات (API) لاستكشاف مساقات {platform_name} وأي واجهات API أخرى قد نقدمها من وقت لآخر (يُشار إليها إجمالاً، "واجهات API"). نرجو منك قراءة شروط الخدمة هذه قبل الوصول إلى واجهات API أو استخدامها. إنّ شروط الخدمة هذه، وأي شروط إضافية تأتي في إطار وثائق API المصاحبة، وأي سياسات معمول بها، وأي توجيهات تتيحها {platform_name} وأي تحديثات تظهر من وقت لآخر، تُعتبر كلُّها بمثابة اتفاقيات (تسمى إجمالاً، "الشروط") بينك وبين {platform_name}. هذه الشروط الصادرة والمندرجة تحت اتفاقية المنتج المؤسسي، أو اتفاقية اشتراك الأعضاء، أو أي اتفاقية أخرى متعلقة بشراء منتجات {platform_name}. ومن خلال الوصول إلى واجهات API أو استخدامها، فأنت تقبل هذه الشروط وتوافق على الالتزام بها بشكل قانوني، سواء كنت مستخدمًا مسجّلًا أم لا. إذا كنت تصل أو تستخدم الواجهات نيابة عن شركة، منظمة، أو أي جهة قانونية أخرى، فأنت توافق على هذه الشروط للشركة، وتقرّ لـ {platform_name} أن لديك كامل الصلاحية للموافقة على هذه الشروط. إذا لم تستوعب الشروط أو إذا لم ترغب في أن تكون مُلزَمًا فيها قانونًا، فيجب ألا تستخدم واجهات API.

source: API Access
ar: الوصول إلى واجهة برمجة التطبيقات

source: To access the APIs, you will need to create an {platform_name} user account for your application (not for personal use). This account will provide you with access to our API request page at {request_url}. On that page, you must complete the API request form including a description of your proposed uses for the APIs. Any account and registration information that you provide to {platform_name} must be accurate and up to date, and you agree to inform us promptly of any changes. {platform_name_capitalized} will review your API request form and, upon approval in {platform_name}'s sole discretion, will provide you with instructions for obtaining your API shared secret and client ID.
ar: للوصول إلى واجهات API، يجب عليك إنشاء حساب لمستخدم {platform_name} من أجل تطبيقك (وليس للاستخدام الشخصي). وسوف يتيح لك هذا الحساب الوصول إلى صفحتنا لطلبات API على {request_url}. ويجب عليك في هذه الصفحة استكمال استمارة طلب API بما في ذلك شرح استخداماتك المقترحة لواجهات API. أي معلومات حساب أو تسجيل تقدمها إلى {platform_name} يجب أن تكون دقيقة وعلى أحدث وضع، ويجب أن توافق على إخطارنا فور حدوث أي تغيرات. وسوف تقوم {platform_name_capitalized} بمراجعة استمارة طلب API الخاصة بك، وبعد الاعتماد وفقًا لتقدير {platform_name} فقط، نقوم بتزويدك بالتعليمات التي توضح لك كيف تحصُل على كلمة مرور ومعرف عميل API لتطبيقك.

source: Permissible Use
ar: الاستخدام المسموح به
