Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: After this purchase is complete, a receipt is generated with relative billing details and registration codes for students.
ar: بعد اكتمال عملية الدفع هذه، يُعدّ إيصال بتفاصيل الفوترة ذات الصلة وبرموز تسجيل الطلّاب.

source: After this purchase is complete, {username} will be enrolled in this course.
ar: بعد استكمال عملية الدفع هذه، سيجري تسجيل {username} في هذا المساق.

source: Empty Cart
ar: سلّة خالية

source: Shopping cart
ar: سلّة المشتريات

source: {platform_name} - Shopping Cart
ar: {platform_name} - سلّة المشتريات

source: Confirmation
ar: تأكيد

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} or let us know about any pages that may have been moved at {email}.
ar: لم يُعثَر على الصفحة التي كنت تبحث عنها. عُد إلى {link_start}الصفحة الرئيسيّة{link_end}، أو أخبرنا عن أيّ صفحات يُمكن أن تكون قد نُقِلَت وذلك على {email}.

source: This page left intentionally blank. Feel free to add your own content.
ar: لقد تركنا لك هذه الصفحة فارغة كي تتمكن من إضافة أي محتوى حسب رغبتك.

source: Our system indicates that you are trying to access this {platform_name} course from a country or region currently subject to U.S. economic and trade sanctions.Unfortunately, because {platform_name} is required to comply with export controls,we cannot allow you to access this course at this time.
ar: تشير أنظمتنا إلى أنك تحاول الوصول إلى هذا المساق {platform_name} من دولة أو منطقة خاضعة للعقوبات التجارية والاقتصادية الأمريكية. للأسف فإن {platform_name} يلتزم بالقيود المفروضة على الصادرات، ولا يمكننا السماح لك بالوصول إلى هذا المساق في الوقت الحالي.

source: FAQ
ar: الأسئلة الشائعة

source: Jobs
ar: الوظائف

source: In the Press
ar: في الصحافة

source: Currently the {platform_name} servers are down
ar: خوادِم {platform_name} متوقّفة حالياً

source: Our staff is currently working to get the site back up as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
ar: يعمل طاقم المساق لدينا حالياً على إعادة الموقع للعمل في أقرب وقتٍ ممكن. نرجو مراسلتنا على {tech_support_email} للإبلاغ عن أية مسائل أو فترات تعطّل.

source: There has been a 500 error on the {platform_name} servers
ar: حدث خطأ من فئة 500 على خوادم {platform_name}

source: Please wait a few seconds and then reload the page. If the problem persists, please email us at {email}.
ar: يُرجى الانتظار لبضع ثوانٍ، ومن ثم إعادة تحميل الصفحة. إذا استمرّت المشكلة، نرجو منك التواصل معنا على {email}.

source: Currently the {platform_name} servers are overloaded
ar: تعمل خوادم {platform_name} حالياً بحِملٍ يتجاوز طاقتها

source: Account Settings
ar: إعدادات الحساب

source: Please Wait
ar: يرجى الانتظار

source: Sign in or Register
ar: ادخُل أو أنشئ حساب

source: Student Support
ar: دعم الطلاب

source: Student Support: Certificates
ar: دعم الطلاب: الشهادات

source: Contact {platform_name} Support
ar: للاتّصال بفريق الدعم لدى {platform_name}

source: Student Support: Enrollment
ar: دعم الطلاب: التسجيل

source: Student Support: Manage User
ar: دعم الطلاب: إدارة المستخدم

source: About to refund this order:
ar: على وشك استرداد قيمة هذه الطلبية:

source: Order Id:
ar: رقم الطلبية:

source: Enrollment:
ar: التسجيل:

source: enrolled
ar: مسجَّل

source: unenrolled
ar: غير مُسجل

source: Cost:
ar: التكلفة:

source: CertificateItem Status:
ar: حالة الشهادة:

source: Order Status:
ar: حالة الطلبية:

source: Fulfilled Time:
ar: الوقت المَقضِيّ:

source: Refund Request Time:
ar: وقت طلب استرداد المبلغ:

source: User Survey
ar: استبيان المستخدم

source: Pre-Course Survey
ar: استبيان ما قبل المساق

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
ar: يمكنك بدء مساقك فور انتهائك من تعبئة النموذج التالي. الحقول الضرورية مشار إليها بعلامة النجمة (*). هذه المعلومات لاستخدامها في {platform_name} حصرًا، ولن يتم ربطها بملفك الشخصي العلني بأي شكل كان.

source: You are missing the following required fields:
ar: لقد تركت الحقول الضرورية التالية فارغة:

source: Cancel and Return to Dashboard
ar: الغِ وارجِع إلى "لوحتي التعليمية"

source: Why do I need to complete this information?
ar: لِمَ عليَّ توفير هذه المعلومات؟

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
ar: نستخدم المعلومات التي تزوّدنا بها لنحسّن مساقنا للطلّاب الحاليين والمستقبليين. فكلّما عرفنا أكثر عن احتياجاتك، كل ما تمكّنّا من تحسين تجربتك مع المساق أكثر.

source: Who can I contact if I have questions?
ar: من أستطيع الاتصال به إذا كانت لدي أسئلة؟

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
ar: إذا كانت لديك أي أسئلة حول هذا المساق أو هذه الاستمارة، يمكنك التواصل مع {link_start}{mail_to_link}{link_end}.

source: Skeleton Page
ar: صفحة الهيكل

source: Search the course
ar: البحث في المساق

source: Start Course
ar: ابدأ المساق

source: Have questions?
ar: هل لديك أسئلة؟

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
ar: تُرجى قراءة {a_start}الأسئلة الشائعة للاطلاع على الأسئلة الشائعة المتعلقة بشهاداتنا{a_end}.

source: Re-Verify for {course_name}
ar: تُرجى إعادة التوثيق لمساق {course_name}

source: Verification Deadline Has Passed
ar: لقد انقضى الموعد النهائي للتوثيق

source: Upgrade Deadline Has Passed
ar: لقد انقضى الموعد النهائي للتسجيل للشهادة الموثّقة

source: The verification deadline for {course_name} was {{date}}. Verification is no longer available.
ar: الموعد النهائي للتوثيق لمساق {course_name} كان في {{date}}. لم يعد التوثيق متاحًا.

source: The deadline to upgrade to a verified certificate for this course has passed.
ar: لقد انقضى الموعد النهائي للتحقق المحدّد لهذا المساق.

source: Upgrade Your Enrollment For {course_name}.
ar: سجّل للحصول على شهادة موثّقة لمساق {course_name}.

source: Receipt For {course_name}
ar: إيصال مساق {course_name}

source: Verify For {course_name}
ar: وثِّق لمساق {course_name}

source: Enroll In {course_name}
ar: التحق بمساق {course_name}

source: Technical Requirements
ar: المتطلّبات التقنيّة

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}webcam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
ar: يُرجى التأكد من أنَّ متصفحك محدَّث إلى {strong_start}{a_start}أحدث إصدار متاح{a_end}{strong_end}. يُرجى أيضاً التحقق من {strong_start}توصيل كاميرا الويب، وتشغيلها، والسماح لها بالعمل على متصفحك (يتم ضبط ذلك عادة في إعدادات متصفحك).{strong_end}

source: Re-Verification
ar: إعادة التوثيق

source: Identity Verification
ar: التحقق من الهوية

source: You have already submitted your verification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
ar: لقد سبق لك أن قدّمتَ معلومات توثيقك. سترى رسالة على صفحة "لوحتي التعليمية" الخاصة بة عند إتمام عملية التوثيق (عادة خلال يوم أو يومين).

source: You cannot verify your identity at this time.
ar: لا يمكنك توثيق هويتك في هذا الوقت.

source: Return to Your Dashboard
ar: عّد إلى مكتبك

source: This website uses cookies to ensure you get the best experience on our website. If you continue browsing this site, we understand that you accept the use of cookies.
ar: هذا الموقع يستخدم ملفات تعريف الارتباط لضمان حصولك على أفضل تجربة على موقعنا. إذا تابعت تصفح هذا الموقع، فإننا ندرك أنك تقبل استخدام ملفات تعريف الارتباط.

source: Got it!
ar: فهمت!

source: Learn more
ar: تعلّم المزيد

source: {span_start}(active){span_end}
ar: {span_start}(مفعّل){span_end}

source: Changes
ar: التغييرات

source: {span_start}active{span_end}
ar: {span_start}مفعّل{span_end}

source: Course Wiki
ar: موسوعة ويكي الخاصة بالمساق

source: Add article
ar: أضِف مقالًا

source: Preview Language Setting
ar: معاينة إعدادات اللغة

source: Language Code
ar: رمز اللغة

source: e.g. en for English
ar: على سبيل المثال، استخدم en للغة الإنجليزية

source: Preview Theme
ar: معاينة المظهر

source: All Rights Reserved
ar: جميع الحقوق محفوظة

source: Attribution
ar: نَسب العمل

source: Noncommercial
ar: استخدام غير تجاري

source: No Derivatives
ar: عدم الاشتقاق

source: Share Alike
ar: الترخيص بالمثل

source: Creative Commons licensed content, with terms as follow:
ar: محتوى مرخّص كمشاع إبداعي وفق الشروط التالية:

source: Some Rights Reserved
ar: بعض الحقوق محفوظة

source: Important Course Dates
ar: التواريخ المهمّة في المساق

source: Goal:
ar: هدف:

source: Edit your course goal:
ar: تعديل هدف المساق:

source: Pursue a verified certificate
ar: اسعَ للحصول على شهادة موثقة

source: Upgrade ({price})
ar: قم بالترقية ({price})

source: Expand All
ar: تكبير جميع الأقسام

source: Prerequisite:
ar: متطلب أساسي:

source: {subsection_format} due {{date}}
ar: {subsection_format} تستحقّ في {{date}}

source: Learn About Verified Certificates
ar: اعرف المزيد عن الشهادات الموثقة

source: {platform_name} Verified Certificate
ar: شهادة موثقة من {platform_name}

source: Why upgrade?
ar: لماذا التطوير؟

source: Official proof of completion
ar: دليل رسمي للإتمام

source: Easily shareable certificate
ar: شهادة قابلة للمشاركة بسهولة

source: Proven motivator to complete the course
ar: حافز مؤكد لاستكمال المساق

source: Certificate purchases help {platform_name} continue to offer free courses
ar: تطوير شهادتك تساعدنا في منصة {platform_name} على تقديم المزيد من المساقات المجانية

source: How it works
ar: كيف تعمل

source: Pay the Verified Certificate upgrade fee
ar: دفع رسوم توثيق الشهادة

source: Verify your identity with a webcam and government-issued ID
ar: تحقق من هويتك باستخدام كاميرا ويب وهوية رسمية (هوية شخصية، جواز سفر)

source: Study hard and pass the course
ar: ادرس بجد وانجح بالمساق

source: Share your certificate with friends, employers, and others
ar: شارك شهادتك مع الأصدقاء وأرباب العمل وغيرهم

source: edX Learner Stories
ar: قصص نجاح المتعلمين

source: My certificate has helped me showcase my knowledge on my resume - I feel like this certificate could really help me land my dream job!
ar: ساعدتني شهادتي على عرض مهاراتي في سيرتي الذاتية - أشعر أن هذه الشهادة قد تساعدني حقًا في الحصول على وظيفة أحلامي!

source: {learner_name}, edX Learner
ar: {learner_name} ، متعلم ادراك

source: I wanted to include a verified certificate on my resume and my profile to illustrate that I am working towards this goal I have and that I have achieved something while I was unemployed.
ar: أردت إضافة شهادة موثّقة في سيرتي الذاتية وملفي الشخصي لتوضيح أنني أعمل على تحقيق هذا الهدف، وأنني حققت شيئًا بينما كنت عاطلاً عن العمل.

source: Upgrade ({course_price})
ar: تطوير اشتراكي ({course_price})

source: This course does not have any updates.
ar: هذا المساق لم يحصل على أية مستجدّات.

source: Today is {date}
ar: تاريخ اليوم {date}

source: Latest Update
ar: آخر تحديث

source: Search Results
ar: البحث في النتائج

source: My Stats (Beta)
ar: إحصائياتي (تجريبية)

source: Connected Accounts
ar: الحسابات المرتبطة

source: Linked
ar: مرتبط

source: Not Linked
ar: غير مرتبط

source: Unlink
ar: افصل

source: Link
ar: اربط

source: Completed {completion_date_html}
ar: اكتمل {completion_date_html}

source: {course_mode} certificate
ar: {course_mode} شهادة

source: You haven't earned any certificates yet.
ar: لم تحصل على أية شهادات حتى الآن.

source: Explore New Courses
ar: استكشف المساقات الجديدة

source: Learner Profile
ar: الملف الشخصي للمتعلّم

source: View My Records
ar: عرض سجلاتي

source: My Profile
ar: ملفي الشخصي

source: Build out your profile to personalize your identity on {platform_name}.
ar: أنشئ ملفك الشخصي لتخصيص هويتك على {platform_name}.

source: An error occurred. Try loading the page again.
ar: حدث خطأ. حاول تحميل الصفحة مرة أخرى.

source: Access Course Staff Support on the Partner Portal to submit or review support tickets
ar: ادخل إلى قسم دعم فريق المساق الموجود على البوابة الإلكترونية للشريك لتقديم أو مراجعة مذكرات طلب الدعم.

source: edX Partner Portal
ar: البوابة الإلكترونية لشريك إدراك

source: Browse recently launched courses and see what's new in your favorite subjects.
ar: تصفَّح المساقات الحديثة لترى ما هو جديد في المواضيع التي تفضّلها.

source: Page Footer
ar: ذيل الصفحة

source: edX Home Page
ar: الصفحة الرئيسية لـ edX

source: EdX, Open edX, and MicroMasters are registered trademarks of edX Inc.
ar: EdX و Open edX و MicroMasters هي علامات تجارية مسجلة لشركة edX.

source: About edX Verified Certificates
ar: حول شهادات edX الموثّقة

source: An edX Verified Certificate signifies that the learner has agreed to abide by the edX honor code and completed all of the required tasks of this course under its guidelines, as well as having their photo ID checked to verify their identity.
ar: شهادة edX الموثّقة تعني أن المتعلم قد وافق على الالتزام برمز الشرف في edX وأكمل جميع المهام المطلوبة من هذه الدورة وفقا لتوجيهاتها، وكذلك تم التحقق من هويته.

source: About edX
ar: لمحة عن إدراك

source: {link_start}edX{link_end} offers interactive online classes and MOOCs from the world's best universities, including MIT, Harvard, Berkeley, University of Texas, and many others. edX is a non-profit online initiative created by founding partners Harvard and MIT.
ar: تقدّم {link_start}edX{link_end} دروسًا تفاعلية ومساقات مكثّفة متاحة عبر الإنترنت من أفضل الجامعات في العالم، بما فيها معهد ماساتشوستس للتكنولوجيا وجامعة هارفارد وجامعة بيركلي وجامعة تكساس. وتمثّل edX مبادرة إلكترونية غير ربحية أسّسَتها جامعة هارفارد بالاشتراك مع معهد ماساتشوستس للتكنولوجيا.

source: Congratulations, {user_name}!
ar: تهانينا {user_name}!

source: You worked hard to earn your certificate from {accomplishment_copy_course_org} {dash} share it with colleagues, friends, and family to get the word out about what you mastered in {accomplishment_course_title}.
ar: لقد عملت بجد للحصول على شهادتك من {accomplishment_copy_course_org} {dash} شاركها مع الزملاء والأصدقاء والعائلة للتعرف على ما تتقنه في {accomplishment_course_title}.

source: Share this certificate on Facebook (opens a new tab/window)
ar: مشاركة هذه الشهادة في الفيسبوك (يفتح تبويب / نافذة جديدة)

source: Tweet this certificate (opens a new tab/window)
ar: غرّد حول هذه الشهادة في تويتر (يفتح تبويب / نافذة جديدة)

source: Add this certificate to your LinkedIn profile (opens a new tab/window)
ar: أضف هذه الشهادة إلى ملفك الشخصي في لينكيدين (يفتح تبويب / نافذة جديدة)

source: Print
ar: طباعة

source: Print this certificate
ar: اطبع هذه الشهادة

source: All rights reserved except where noted. edX, Open edX and the edX and Open edX logos are registered trademarks or trademarks of edX Inc.
ar: جميع الحقوق محفوظة إلا إذا تم الإشارة إلى غير ذلك. تعد edX وOpen edX وشعارات edX وOpen EdX علامات تجارية مسجلة التابعة لمؤسسة edX Inc.

source: {b_start}Support our Mission: {b_end} EdX, a non-profit, relies on verified certificates to help fund free education for everyone globally
ar: {b_start} ادعم مهمتنا: {b_end} إدراك مشروع غير ربحي، يعتمد على الشهادات الموثّقة لدعم تمويل التعليم المجاني للجميع، حول العالم.

source: Find Courses
ar: ابحث عن مساقات

source: Schools & Partners
ar: المدارس والشركاء

source: EdX, Open edX, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
ar: إنّ edX وOpen edX وStudio وشعارَي edX وOpen edX هي علامات تجارية مسجَّلة أو علامات تجارية لمؤسّسة {link_start}edX Inc.{link_end}.

source: {tos_link_start}Terms of Service{tos_link_end} and {honor_link_start}Honor Code{honor_link_end}
ar: {tos_link_start}شروط الخدمة{tos_link_end} و{honor_link_start}ميثاق الشرف{honor_link_end}

source: Copyright
ar: حقوق الطبع والنشر

source: Copyright {year}. All rights reserved.
ar: جميع حقوق النشر والطبع محفوظة {year}

source: For anyone, anywhere, anytime
ar: لأي شخص، في أي مكان، و في أي وقت

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
ar: ستصلك رسالة تفعيل عبر البريد الإلكتروني. يجب الضغط على رابط التفعيل لاستكمال عملية التسجيل. وإذا لم تجد هذه الرسالة، تحقّق من صندوق الرسائل المهملة أو غير المرغوبة، وحدِّد الرسائل الواردة من class.stanford.edu على أنّها ’ليست رسائل غير مرغوبة‘ لتتمكّن بعدئذٍ من استلام الرسائل من مساقاتك.

source: Need help in registering with {platform_name}?
ar: هل تحتاج إلى المساعدة لإنشاء حسابك في {platform_name}؟

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
ar: ستتمكن من الإجابة على معظم أسئلتك في منتديات النقاشات الخاصة بالمساق أو من خلال صفحة الأسئلة الشائعة بعد أن تتم التسجيل.

source: Thank you for signing up for {platform_name}.
ar: شكرًا على تسجيلك في {platform_name}.

source: Change your life and start learning today by activating your {platform_name} account. Click on the link below or copy and paste it into your browser's address bar.
ar: غيّر حياتك وابدأ التعلم اليوم عبر تفعيل حسابك على {platform_name}. انقر على الرابط أدناه أو انسخه إلى شريط العنوان في متصفحك.

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
ar: إذا لم تكن قد تقدّمت بهذا الطّلب، فلا تحتاج إلى فعل أي شيء؛ ولن تتلقى منّا أي رسائل أخرى. يُرجى عدم الرد على هذه الرسالة؛ وإذا احتجت إلى المساعدة، يمكنك مراجعة قسم اللمحة في موقع مساقات {platform_name}.

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us at
ar: هذه الرسالة للتأكيد على قيامك بتغيير البريد الإلكتروني المرتبط بالمنصة {platform_name} من {old_email} إلى {new_email}. في حال لم تكن قد طلبت هذا التغيير الرجاء الاتصال بنا على

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
ar: لقد تلقينا طلباً يفيد رغبتك بتغيير البريد الإلكتروني لحسابك في {platform_name} من {old_email} إلى {new_email}. إذا كان هذا صحيحاً، فنرجو منك تأكيد عنوان بريدك الإلكتروني الجديد بزيارة:

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at {email}
ar: نعتذر. لم يوافق طاقم المساق لدينا على طلبك تغيير اسمك من {old_name} إلى {new_name}. إذا كنت بحاجة للمزيد من المساعدة، الرجاء مراسلة فريق الدعم الفني على البريد الإلكتروني {email}

source: Put your Terms of Service here!
ar: ضع شروط الخدمة الخاصة بك هنا!

source: Put your Privacy Policy here!
ar: ضع سياسة الخصوصية الخاصة بك هنا!

source: Put your Honor Code here!
ar: ضع ميثاق الشرف الأكاديمي الخاص بك هنا!

source: Put your Copyright Text here!
ar: ضع نصّ حقوق النشر والطبع الخاصة بك هنا!

source: The page that you were looking for was not found.
ar: لم يُعثَر على الصفحة التي كنت تبحث عنها.

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
ar: عُد إلى{homepage}، أو أعلمنا عبر رسالة على عنوان البريد الإلكتروني {email} عن أي صفحات يُحتمل أن تكون قد نُقِلت.

source: {studio_name} Server Error
ar: خطأ في خادم {studio_name}

source: The {em_start}{studio_name}{em_end} servers encountered an error
ar: واجهت خوادم {em_start}{studio_name}{em_end} خطأً.

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
ar: حدث خطأ في {studio_name} وتعذَّر تحميل الصفحة. حاول مرة أخرى بعد لحظات قليلة.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
ar: لقد سجّلنا الخطأ، يعمل طاقم المساق حاليّاً على إيجاد حلّ له في أقرب وقت ممكن.

source: If the problem persists, please email us at {email_link}.
ar: تُرجى مراسلتنا عبر البريد الإلكتروني {email_link} إذا استمرّت المشكلة.

source: Studio Accessibility Policy
ar: سياسة إمكانية الوصول

source: {studio_name} Account Activation
ar: تفعيل الحساب في {studio_name}

source: Your account is already active
ar: حسابك مفعَّل مسبقًا

source: This account, set up using {email}, has already been activated. Please sign in to start working within {studio_name}.
ar: سبق أن تم تفعيل هذا الحساب الذي أُنشئ باستخدام البريد الإلكتروني {email}. يُرجى الدخول لبدء العمل في {studio_name}.

source: Sign into {studio_name}
ar: ادخل إلى {studio_name}

source: Your account activation is complete!
ar: تم تفعيل حسابك!

source: Thank you for activating your account. You may now sign in and start using {studio_name} to author courses.
ar: شكرًا لك على تفعيل حسابك. يمكنك الآن الدخول واستخدام {studio_name} لتأليف المساقات.

source: Your account activation is invalid
ar: عملية تفعيل حسابك غير صالحة

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct, as e-mail programs will sometimes split it into two lines.
ar: نأسف لحدوث خطأ في تفعيل حسابك. تحقّق من أنّ الرابط الذي نقرت عليه صحيح، حيث أنّ بعض برامج البريد الإلكتروني تقسمه أحيانًا إلى سطرَين.

source: If you still have issues, contact {platform_name} Support. In the meantime, you can also return to {link_start}the {studio_name} homepage.{link_end}
ar: إذا ما زلت تواجه مشاكل، تواصل مع فريق دعم {platform_name}. ويمكنك العودة أيضًا في هذه الأثناء إلى {link_start}صفحة {studio_name} الرئيسية.{link_end}

source: Files & Uploads
ar: الملفات والمرفوعات

source: Course Certificates
ar: شهادات المساق

source: This module is not enabled.
ar: هذه الوحدة غير مفعَّلة.

source: This course does not use a mode that offers certificates.
ar: لا يستخدم هذا المساق وضعًا يتيح شهادات.

source: Working with Certificates
ar: العمل على الشهادات

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
ar: حدِّد عنواناً للمساق لاستخدامه في الشهادة إذا كان عنوان المساق طويل جداً مما يعيق عرضه بشكل جيد.

source: For verified certificates, specify between one and four signatories and upload the associated images.
ar: للحصول على شهادات موثّقة، حدِّد موقِّعين عددهم بين واحد إلى أربعة وارفع الصور ذات العلاقة.

source: To edit or delete a certificate before it is activated, hover over the top right corner of the form and select {em_start}Edit{em_end} or the delete icon.
ar: لتعديل أو حذف شهادة قبل أن يتم تفعيلها، انقُل مؤشر الفأرة إلى الزاوية اليمنى العليا من النموذج واختر {em_start} عدّل {em_end} أو رمز الحذف.

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
ar: لعرض نموذج شهادة، اختر وضعًا للمساق واختَر {em_start}معاينة الشهادة{em_end}

source: Issuing Certificates to Learners
ar: إصدار شهادات للمتعلمين

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
ar: للبدء في إصدار شهادات لهذا المساق، يقوم أحد أعضاء الفريق ممن له دور عضو طاقم أو إداريّ باختيار {em_start}تفعيل{em_end}. يمكن فقط لأعضاء فريق المساق الذين يشغلون هذه الأدوار تحرير أو حذف شهادة تم تفعيلها.

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
ar: {em_start} لا {em_end} تحذف الشهادات بعد بدء المساق؛ إذ لن يتمكّن المتعلّمون ممن نالوا شهاداتٍ في وقتٍ سابق من الوصول إلى إليها بعد ذلك.

source: Learn more about certificates
ar: اعرف المزيد عن الشهادات

source: Other Course Settings
ar: الإعدادات الأخرى للمساق
