Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Overall Grade Range
ar: نطاق العلامة النهائية

source: Your overall grading scale for student final grades
ar: مقياسك للتقييم العام لعلامات الطلّاب النهائية

source: Add grade
ar: أضف علامة

source: Credit Eligibility
ar: التأهُّل للحصول على ساعات دراسية معتمدة

source: Settings for course credit eligibility
ar: إعدادات التأهُّل للحصول على ساعات دراسية معتمدة

source: Minimum Credit-Eligible Grade:
ar: العلامة الدُنيا المؤهلة للحصول على ساعات معتمدة

source: Must be greater than or equal to the course passing grade
ar: يجب أن تزيد عن درجة النجاح في المساق أو تساويها

source: Grading Rules &amp; Policies
ar: سياسات وقواعد التقييم

source: Deadlines, requirements, and logistics around grading student work
ar: المواعيد النهائية، والمتطلّبات، والأمور اللوجستية المتعلّقة بتقييم أعمال الطلاب

source: Grace Period on Deadline:
ar: فترة الإمهال بعد حلول الموعد النهائي:

source: Leeway on due dates
ar: مدى التساهُل مع مواعيد التسليم

source: Assignment Types
ar: أنواع الواجبات

source: Categories and labels for any exercises that are gradable
ar: فئات وصِفات أي تمارين قابلة للتقييم

source: New Assignment Type
ar: نوع جديد من الواجبات

source: What can I do on this page?
ar: ما الذي يمكنني فعله على هذه الصفحة؟

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
ar: يمكنك استخدام شريط التمرير الظاهر تحت "نطاق العلامات النهائية" لتحدّد ما إن كان مساقك من نوع "ناجح/راسب" أو من النوع الذي له تقدير بالحروف، ولتحدّد أيضًَا الحدّ الأدنى والأقصى لكلّ علامة.

source: You can specify whether your course offers students a grace period for late assignments.
ar: يمكنك تحديد ما إذا كان مساقك يقدّم للطلّاب مُهلة للواجبات المتأخرة أم لا.

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
ar: يمكنك أيضًا إنشاء أنواع للواجبات، كالفروض المنزلية، ومختبرات، والامتحانات القصيرة، والامتحانات، كما يمكنك تحديد حصّة كلّ نوع من مجموع علامات الطالب.

source: Expand or Collapse
ar: أظهار أو إخفاء

source: Access Settings
ar: إعدادات صلاحيات الوصول

source: Set Access
ar: ضع صلاحيات للوصول

source: This block contains multiple components.
ar: تحوي هذه الوحدة مكونات عديدة.

source: New Textbook
ar: كتاب جديد

source: Why should I break my textbook into chapters?
ar: لماذا يُفترض بي أن أقسّم كتابي إلى فصول؟

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
ar: يقلّل تقسيم كتابك إلى عدّة فصول من الوقت الذي يحتاجه الطلّاب للتحميل، خاصةً أولئك الذين اتصالهم بالإنترنت بطيء. ومن شأن تقسيم الكتب إلى فصول أن يزيد أيضًا سهولة عثور الطلّاب على المعلومات المتعلقة بموضوع معين.

source: What if my book isn't divided into chapters?
ar: ماذا لو لم يكن كتابي مقسّمًا إلى فصول؟

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
ar: إذا لم يكن كتابك مقسمًا إلى فصول، فيمكنك رفع النص بأكمله كفصل واحد وإدخال اسم من اختيارك في حقل "اسم الفصل".

source: Learn more about textbooks
ar: اعرف المزيد عن الكتب

source: Video Uploads
ar: مرفوعات الفيديو

source: Course Video Settings
ar: إعدادات فيديو المساق

source: Access is not restricted
ar: الوصول غير مقيّد

source: Access to this unit is not restricted, but visibility might be affected by inherited settings.
ar: لا يتم تقييد الوصول إلى هذه الوحدة، ولكن قد تتأثر الرؤية بالإعدادات الموروثة.

source: Access to this component is not restricted, but visibility might be affected by inherited settings.
ar: الوصول لهذا المكون غير مقيّد، لكن قابلية الرؤية قد تتأثر بالإعدادات السابق وضعها.

source: You can restrict access to this unit to learners in specific enrollment tracks or content groups.
ar: يمكنك تقييد الوصول إلى هذه الوحدة للطلّاب في مسارات تسجيل محددة أو مجموعات محتوى معينة.

source: You can restrict access to this component to learners in specific enrollment tracks or content groups.
ar: تستطيع تقييد الوصول لهذا المكون للطُلاب في مسارات تسجيل أو مجموعات محتوى محددة.

source: You can restrict access to this unit to learners in specific content groups.
ar: يمكنك تقييد الوصول إلى هذه الوحدة للطلّاب في مجموعات محتوى معينة.

source: You can restrict access to this component to learners in specific content groups.
ar: تستطيع تقييد الوصول لهذا المكون للطلّاب في مجموعات محتوى محددة.

source: Manage content groups
ar: إدارة مجموعات المحتوى

source: {screen_reader_start}Warning:{screen_reader_end} The unit that contains this component is hidden from learners. The unit setting overrides the component access settings defined here.
ar: {screen_reader_start}Warning:{screen_reader_end} الوحدة التي تحتوي على هذا المكون تمّ إخفائها عن الطلّاب. إعدادات هذه الوحدة تبطل إعدادات الوصول للمكون التي تمّ تحديدها هنا.

source: Access is restricted to:
ar: الوصول محصور على:

source: Restrict access to:
ar: احصر الوصول على:

source: Select a group type
ar: حدّد نوع المجموعة

source: All Learners and Staff
ar: جميع المتعلّمين والطاقم

source: Select one or more groups:
ar: حدّد مجموعة واحدة أو أكثر:

source: This group no longer exists. Choose another group or remove the access restriction.
ar: لم تعد هذه المجموعة موجودة. اختر مجموعة أخرى أو أزل تقييد الدخول.

source: {email} has requested {studio_name} course creator privileges on edge
ar: أرسل {email} طلبًا للحصول على صلاحيات منشئ مساق في {studio_name}

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
ar: تقدّم المستخدم '{user}'، صاحب البريد الإلكتروني {email} بطلب للحصول على صلاحيات منشئ مساق في {studio_name}.

source: To grant or deny this request, use the course creator admin table.
ar: للموافقة على هذا الطلب أو رفضه، استخدِم جدول المدير لمُنشئي المساقات.

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
ar: لقد رُفِض طلبك للحصول على صلاحيات إنشاء مساقات في {studio_name}. إذا كنت تعتقد بأنّ هناك خطأ ما، تُرجى مراسلتنا على {email}

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
ar: لقد قُبِل طلبك للحصول على صلاحيات إنشاء مساقات في {studio_name}. لإنشاء أول مساق لك، تفضل بزيارة {url}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
ar: لقد سُحِبَت منك صلاحيات صلاحيات إنشاء مساقات في {studio_name}.. إذا كنت تعتقد بأنّ هناك خطأ ما، تُرجى مراسلتنا على {email}

source: Your course creator status for {studio_name}
ar: حالتك كمنشئ مساقات في {studio_name}

source: Your {task_name} task has completed with the status '{task_status}'. Use this URL to view task details or download any files created: {detail_url}
ar: تم استكمال المهمة {task_name} الخاصة بك بالحالة '{task_status}'. استخدم هذا الرابط لعرض تفاصيل المهمة أو تحميل أي ملفات تم إنشاؤها: {detail_url}

source: Your {task_name} task has completed with the status '{task_status}'. Sign in to view the details of your task or download any files created.
ar: تم استكمال المهمة {task_name} الخاصة بك بالحالة '{task_status}'. قم بتسجيل الدخول لعرض تفاصيل المهمة الخاصة بك أو تحميل أي ملفات تم إنشاؤها.

source: {platform_name} {studio_name}: Task Status Update
ar: {platform_name} {studio_name}: تحديث حالة المهمة

source: Required data to force publish course.
ar: البيانات المطلوبة لنشر المساق قسريًّا.

source: Reset values
ar: أعِد ضبط القيم

source: Maintenance Dashboard
ar: لوحة الصيانة

source: Thanks for activating your account.
ar: نشكرك على تفعيل حسابك.

source: This account has already been activated.
ar: سبق أن جرى تفعيل هذا الحساب.

source: Visit your {link_start}dashboard{link_end} to see your courses.
ar: تفضّل بزيارة {link_start}لوحة القيادة {link_end} الخاصة بحسابك لرؤية مساقاتك.

source: You can now {link_start}sign in{link_end}.
ar: بإمكانك الآن {link_start}تسجيل الدخول{link_end}.

source: Activation Invalid
ar: عملية التفعيل غير صحيحة

source: Something went wrong. Email programs sometimes split URLs into two lines, so make sure the URL you're using is formatted correctly. If you still have issues, send us an email message at {email_start}{email}{email_end}.
ar: حدث خطأ ما. بعض برامج البريد الإلكتروني قد تقسّم الروابط في الرسائل إلى سطرين. تأكد من أن الروابط في رسالة التفعيل منسّقة بصورة سليمة. إذا استمر وجود المشكلات لديك، فأرسل إلينا رسالة بالبريد الإلكتروني واشرح لنا ما حدث على: {email_start}{email}{email_end}.

source: Return to the {link_start}home page{link_end}.
ar: عُد إلى {link_start}الصفحة الرئيسية{link_end}.

source: We've sent an email message to {email} with instructions for activating your account.
ar: لقد أرسلنا رسالة إلى {email} مع تعليمات لتفعيل حسابك.

source: Policies
ar: السياسات

source: Accessibility Accommodation Request
ar: طلب خاص بذوي التحديات الخاصة

source: LMS
ar: واجهة المتعلم التعليمية

source: EdX, Open edX, Studio, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
ar: إنّ edX وOpen edX وStudio وشعارَي edX وOpen edX هي علامات تجارية مسجَّلة أو علامات تجارية لمؤسّسة {link_start}edX Inc.{link_end}.

source: Current Course:
ar: المساق الحالي:

source: Course Navigation
ar: تصفّح المساق

source: Outline
ar: مخطط المساق

source: Import
ar: استيراد

source: Export
ar: تصدير

source: Current Library:
ar: المكتبة الحالية:

source: Language preference
ar: تفضيلات اللغة

source: Account Navigation
ar: تصفّح الحساب

source: Contextual Online Help
ar: مساعدة سياقية مباشرة

source: Launch Latex Source Compiler
ar: شغِّل مُصرِّف مصدر Latex

source: Heading
ar: عنوان رئيسي

source: Insert a heading
ar: أدخل عنوانًا رئيسيًّا

source: Add a multiple choice question
ar: أضف سؤالًا متعدّد الخيارات

source: Add a question with checkboxes
ar: أضف سؤالًا فيه مربعات اختيار

source: Insert a text response
ar: أدخل ردًّا نصيًّا

source: Insert a numerical response
ar: أدخل ردًّا عدديًا

source: Insert a dropdown response
ar: أدخل ردًّا ذا قائمة منسدلة

source: Explanation
ar: التوضيح

source: Add an explanation for this question
ar: أضف توضيحًا لهذا السؤال

source: Advanced Editor
ar: المحرّر المتقدّم

source: Toggle Cheatsheet
ar: اعرض/اخف شرح طريقة الكتابة

source: Label
ar: لُصَيقة

source: Access the Open edX Portal
ar: إدخل إلى بوابة Open edX

source: Open edX Portal
ar: بوابة Open edX

source: Currently signed in as:
ar: أنت مسجّل حاليًا باسم:

source: Maintenance
ar: الصيانة

source: Wiki notifications
ar: إشعارات ويكي

source: Wiki images
ar: صور ويكي

source: Wiki attachments
ar: مرفقات ويكي

source: Only localhost... muahahaha
ar: المضيف المحلي فقط... نيهاهاها

source: Initial title of the article. May be overridden with revision titles.
ar: العنوان الأوّلي للمقال. يمكن وضع عنوان آخر بدلًا منه عند المراجعة.

source: Type in some contents
ar: اكتب محتوى ما

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
ar: هذا محتوى أوّلي فقط لمقالك. ويمكنك بعد إنشائه أن تستخدم مزايا أكثر تعقيدًا، كإضافة ملحقات، أو بيانات وصفية، أو مقالات ذات صلة، ... إلخ.

source: Contents
ar: المحتويات

source: Summary
ar: الخلاصة

source: Give a short reason for your edit, which will be stated in the revision log.
ar: اذكر سبب هذا التعديل بإيجاز، وسيُذكر هذا في سجلّ المراجعات.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
ar: أثناء إجرائك للتعديل، غيّر شخص آخر المراجعة. وقد تم دمج محتواك تلقائيًا مع المحتوى الجديد. تُرجى مراجعة النص أدناه.

source: No changes made. Nothing to save.
ar: لم تقم بأي تغييرات. لا يوجد شيء ليُحفَّظ.

source: Slug
ar: عُقدة

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
ar: سيكون هذا هو العنوان الذي يمكن إيجاد مقالك فيه. استخدم حروف وأرقام و - و _ فقط. لن تتمكن من تغيير العُقدة بعد إنشائك للمقال.

source: Write a brief message for the article's history log.
ar: اكتب رساله مختصرة لسجلّ تاريخ المقال.

source: A slug may not begin with an underscore.
ar: لا يمكن أن تبدأ العُقدة بشَرطة سُفليَّة.

source: A deleted article with slug "%s" already exists.
ar: يوجد بالفعل مقال محذوف له العقدة "%s".

source: A slug named "%s" already exists.
ar: توجد بالفعل عُقدة اسمها "%s".

source: Yes, I am sure
ar: نعم، أنا متأكّد.

source: Purge
ar: حذف

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
ar: احذف المقال: حذفه بالكامل (مع محتوياته كلّها) من دون إمكانية التراجع عن هذا الفعل. وتُعدّ هذه فكرة جيّدة إذا أردت تحرير العُقدة ليتمكّن المستخدمون من إنشاء مقالات جديدة مكان القديمة.

source: You are not sure enough!
ar: إنّك لست متأكّدًا بما فيه الكفاية!

source: While you tried to delete this article, it was modified. TAKE CARE!
ar: انتبه! تم تعديل المقال بينما كنت تحاول حذفه.

source: Lock article
ar: اقفِل المقال

source: Deny all users access to edit this article.
ar: امنع جميع المستخدمين إمكانية الوصول لتعديل هذا المقال.

source: Owner
ar: المالك

source: Enter the username of the owner.
ar: أدخل اسم المستخدم المالِك.

source: (none)
ar: (لا أحد)

source: Inherit permissions
ar: توريث الصلاحيات

source: Check here to apply the above permissions recursively to articles under this one.
ar: فعِّل هذا الخيار لتطبيق الصلاحيات أعلاه المقالات المتفرّعة من هذا المقال.

source: Permission settings for the article were updated.
ar: تم تحديث إعدادات الصلاحيات لهذا المقال.

source: Your permission settings were unchanged, so nothing saved.
ar: لم يتم تغيير إعدادات صلاحياتك، وبالتالي لم يُحفَظ شيء.

source: No user with that username
ar: لا يوجد مستخدم بهذا الاسم

source: Article locked for editing
ar: المقال مقفل للتعديل

source: Article unlocked for editing
ar: المقال مفتوح للتعديل

source: Filter
ar: فلترة

source: Settings for plugin
ar: إعدادات الملحقات

source: current revision
ar: المراجعة الحالية

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
ar: رقم المراجعة التي يتم عرضها لهذا المقال. إذا كنت ترغب في العودة إلى محتوى أقدم، يكفي أن تغيّر قيمة هذا الحقل.

source: modified
ar: تم تعديلها

source: Article properties last modified
ar: آخر تعديل لخصائص المقال

source: owner
ar: المالك

source: The owner of the article, usually the creator. The owner always has both read and write access.
ar: صاحب المقال وهو غالبًا المنشئ لديه دائمًا حقّ القراءة والكتابة.

source: group
ar: المجموعة

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
ar: كما هو الحال في نظام ملف UNIX، يمكن منح الصلاحيات لمستخدم ما تبعًا لعضوية المجموعة. ويجري التعامل مع المجموعات من خلال نظام المصادقة Django.

source: group read access
ar: صلاحية القراءة للمجموعة

source: group write access
ar: صلاحية الكتابة للمجموعة

source: others read access
ar: صلاحية القراءة للآخرين

source: others write access
ar: صلاحية الكتابة للآخرين

source: Article without content (%(id)d)
ar: المقالات الخالية من المحتوى (%(id)d)

source: content type
ar: نوع المحتوى

source: object ID
ar: معرِّف الكائن

source: Article for object
ar: مقال عن الكائن

source: Articles for object
ar: المقالات عن الكائن

source: revision number
ar: رقم المراجعة

source: IP address
ar: عنوان IP

source: user
ar: المستخدم

source: locked
ar: مقفل

source: article
ar: مقال

source: article contents
ar: محتويات المقال

source: article title
ar: عنوان المقال

source: Each revision contains a title field that must be filled out, even if the title has not changed
ar: تتضمّن كلّ مراجعة حقلًا للعنوان يجب ملؤه، حتى لو لم يتغير العنوان

source: original article
ar: مقال أصلي

source: Permissions are inherited from this article
ar: تورَث الصلاحيات من هذا المقال

source: A plugin was changed
ar: تغيّرت إحدى الملحقات

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
ar: المراجعة التي يتم عرضها لهذا الملحق. إذا كنت بحاجة إلى الرجوع إلى مراجعة أقدم، فما عليك سوى تغيير قيمة هذا الحقل.

source: Cache lookup value for articles
ar: قيمة البحث في ذاكرة التخزين المؤقت للمقالات

source: slug
ar: عُقدة

source: (root)
ar: (الجَذْر)

source: URL path
ar: مسار الرابط

source: URL paths
ar: مسارات الرابط

source: Sorry but you cannot have a root article with a slug.
ar: عذرًا، لا يمكن أن يكون لديك مقال جذر له عُقدة.

source: A non-root note must always have a slug.
ar: يجب دائمًا أن يكون هناك عُقدة لكل المقالات غير الجذريّة.

source: There is already a root node on %s
ar: توجد مسبقًا عقدة جذرية في %s

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
ar: المقالات التي فقدت مصادرها ================================ حُذِفت المصادر الخاصة بفروع هذا المقال. ربّما يجب أن تجد لها مصدرًا جديدًا.

source: Lost and found
ar: المفقودات والموجودات

source: A short summary of what the file contains
ar: موجز قصير لمحتويات الملف

source: Yes I am sure...
ar: نعم أنا متأكدّ...

source: Click to download file
ar: انقر لتنزيل الملف

source: The revision of this attachment currently in use (on all articles using the attachment)
ar: المراجعة المستخدمة لهذا الملف المرفق (ينطبق هذا على جميع المقالات التي تستخدم هذا المرفق)

source: original filename
ar: اسم الملفّ الأصلي

source: attachment
ar: ملف مرفق

source: attachments
ar: المرفقات

source: file
ar: ملف

source: attachment revision
ar: مراجعة الملف المرفق

source: attachment revisions
ar: مراجعات الملف المرفق

source: %s was successfully added.
ar: نجحت إضافة %s.

source: Your file could not be saved: %s
ar: تَعذَّر حفظ ملفّك: %s

source: Your file could not be saved, probably because of a permission error on the web server.
ar: تعذَّر حفظ ملفّك، ربما بسبب خطأ في الصلاحيات على خادم الويب.

source: %s uploaded and replaces old attachment.
ar: رُفِع %s وحلّ محل المرفق القديم.

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
ar: سيُعاد تلقائيًّا تسمية ملفّك الجديد ليطابق الملف الموجود من قبل. لا يُسمح بالملفات ذات الامتدادات المختلفة.

source: Current revision changed for %s.
ar: تغيّرت المراجعة الحالية لـ %s.

source: Added a reference to "%(att)s" from "%(art)s".
ar: أُضيف مرجع إلى "%(att)s" من "%(art)s".

source: The file %s was deleted.
ar: حُذِف الملف %s.

source: This article is no longer related to the file %s.
ar: لم يعد هذا المقال مرتبطًا بالملف %s.

source: A file was changed: %s
ar: تغيَّر أحد الملفّات: %s

source: A file was deleted: %s
ar: حُذِف أحد الملفّات: %s

source: The file may be referenced on other articles. Deleting it means that they will loose their references to this file. The following articles reference this file:
ar: يمكن الرجوع إلى الملف في مقالات أخرى. حذفها يعني أنهم سيفقدون إشاراتهم إلى هذا الملف. تشير المقالات التالية إلى هذا الملف:

source: Delete it!
ar: احذفه!

source: You can remove a reference to a file, but it will retain its references on other articles.
ar: يمكنك إزالة مرجع إلى ملف ، لكنه سيحتفظ بمراجعه في مقالات أخرى.

source: Remove reference
ar: إزالة المرجع

source: History of
ar: تاريخ

source: User
ar: المستخدم

source: File
ar: الملف

source: Action
ar: الإجراء

source: <em>No description</em>
ar: <em>بدون وصف</em>

source: Download
ar: تحميل

source: Use this!
ar: استخدم هذا!

source: Replacing an attachment means adding a new file that will be used in its place. All references to the file will be replaced by the one you upload and the file will be downloaded as <strong>%(filename)s</strong>. Please note that this attachment is in use on other articles, you may distort contents. However, do not hestitate to take advantage of this and make replacements for the listed articles where necessary. This way of working is more efficient....
ar: استبدال مرفق يعني إضافة ملف جديد سيتم استخدامه في مكانه. سيتم استبدال جميع الإشارات إلى الملف بالإشارة التي تحمّلها وسيتم تنزيل الملف كـ <strong>%(filename)s</strong> . يرجى ملاحظة أن هذا المرفق قيد الاستخدام في مقالات أخرى ، يمكنك تشويه المحتويات. ومع ذلك ، لا تتردد في الاستفادة من هذا وجعل بدائل للمواد المدرجة عند الاقتضاء. طريقة العمل هذه أكثر فعالية ....

source: Articles using
ar: مقالات باستخدام

source: Replacing an attachment means adding a new file that will be used in its place. All references to the file will be replaced by the one you upload and the file will be downloaded as <strong>%(filename)s</strong>.
ar: استبدال مرفق يعني إضافة ملف جديد سيتم استخدامه في مكانه. سيتم استبدال جميع الإشارات إلى الملف بالإشارة التي تحمّلها وسيتم تنزيل الملف كـ <strong>%(filename)s</strong> .

source: Upload replacement
ar: تحميل بديل

source: Add file to
ar: إضافة ملف إلى

source: Add attachment from other article
ar: إضافة مرفق من المادة الأخرى

source: Main article
ar: المادة الرئيسية

source: Add to article
ar: أضف إلى المقال

source: Your search did not return any results
ar: ان بحثك لا يعد باي نتائج

source: Adding new articles
ar: إضافة مقالات جديدة

source: An external link
ar: رابط خارجي

source: Headers
ar: ترويسات

source: Use these codes for headers and to automatically generate Tables of Contents.
ar: استخدم هذه الرموز للرؤوس ولإنشاء جداول المحتويات تلقائيًا.

source: Typography
ar: طباعة

source: Lists
ar: قوائم

source: New image %s was successfully uploaded. You can use it by selecting it from the list of available images.
ar: نجح رفع الصورة الجديدة %s. يمكنك أن تستخدمها باختيارها من قائمة الصور المتاحة.

source: Are you sure?
ar: هل أنت واثق؟

source: image
ar: الصورة

source: images
ar: الصور

source: Image: %s
ar: الصورة: %s

source: Current revision not set!!
ar: لم تُضبَط المراجعة الحالية!

source: image revision
ar: مراجعة الصورة

source: image revisions
ar: مراجعات الصورة

source: Image Revsion: %d
ar: مراجعة الصورة: %d

source: %s has been restored
ar: استُعيدَت %s

source: %s has been marked as deleted
ar: أشير إلى %s بأنها محذوفة

source: %(file)s has been changed to revision #%(revision)d
ar: تغيّر %(file)s إلى المراجعة #%(revision)d

source: %(file)s has been saved.
ar: حُفِظَ %(file)s

source: Images
ar: الصور

source: An image was added: %s
ar: أُضيفَت صورة: %s

source: The following images are available for this article. Copy the markdown tag to directly refer to an image from the article text.
ar: الصور التالية متاحة لهذا المقال. انسخ علامة تخفيض السعر للإشارة مباشرةً إلى صورة من نص المقالة.

source: Back to edit page
ar: العودة إلى تحرير الصفحة

source: No file
ar: لا ملف

source: Upload new image
ar: تحميل صورة جديدة

source: Restore image
ar: استعادة الصورة

source: Remove image
ar: إزالة الصورة

source: Completely delete
ar: حذف تماما

source: Revert to this version
ar: العودة إلى هذا الإصدار

source: There are no images for this article.
ar: لا توجد صور لهذا المقال.

source: Purge deletion
ar: تطهير الحذف

source: Purge image: Completely remove image file and all revisions.
ar: تطهير الصورة: قم بإزالة ملف الصورة بالكامل وجميع المراجعات.

source: Remove it completely!
ar: إزالته تماما!

source: Image not found
ar: الصورة غير موجودة

source: Replace image
ar: استبدال الصورة

source: Choose an image file to replace current image.
ar: اختر ملف صورة لاستبدال الصورة الحالية.

source: Image id
ar: معرف الصورة

source: Insert
ar: إضافة

source: No images found for this article
ar: لا توجد صور لهذا المقال

source: Manage images
ar: إدارة الصور

source: Add new image
ar: أضف صورة جديدة
