Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: The list of group configurations for partitioning students in content experiments.
ar: قائمة إعدادات المجموعة لتقسيم الطلّاب في تجارب المحتوى.

source: The configuration defines how users are grouped for this content experiment. Caution: Changing the group configuration of a student-visible experiment will impact the experiment data.
ar: يحدِّد الإعداد كيفية تقسيم المستخدمين إلى مجموعات لتجربة المحتوى هذه.انتبه: سيؤثِّر تغيير إعدادات المجموعة المتعلقة بتجربة مرئية للطالب على بيانات التجربة.

source: Group Configuration
ar: إعدادات المجموعة

source: Which child module students in a particular group_id should see
ar: ما هي الوحدة الفرعية التي يجب أن يراها الطلّاب في المجموعة ذات الرقم group_id

source: {group_name} (inactive)
ar: {group_name} (غير نشطة)

source: The experiment is not associated with a group configuration.
ar: لا ترتبط التجربة بإعدادات مجموعة.

source: Select a Group Configuration
ar: اختر إعدادات المجموعة

source: The experiment uses a deleted group configuration. Select a valid group configuration or delete this experiment.
ar: تَستخدِم التجربة إعدادًا محذوفًا للمجموعة. اختر إعدادات مجموعة صالحة أو احذف هذه التجربة.

source: The experiment uses a group configuration that is not supported for experiments. Select a valid group configuration or delete this experiment.
ar: تستخدم التجربة إعدادات مجموعة لا تدعمها التجارب. حدِّد إعدادات مجموعة صالحة أو احذف هذه التجربة.

source: The experiment does not contain all of the groups in the configuration.
ar: لا تتضمّن التجربة كافة المجموعات الموجودة في الإعدادات.

source: Add Missing Groups
ar: أضِف المجموعات الناقصة

source: The experiment has an inactive group. Move content into active groups, then delete the inactive group.
ar: تتضمّن التجربة مجموعة غير فعالة. انقل المحتوى إلى المجموعات الفعالة، ثمّ احذف المجموعة غير الفعالة.

source: This content experiment has issues that affect content visibility.
ar: هناك إشكالات في تجربة المحتوى هذه تؤثّر على إمكانيّة عرض المحتوى.

source: External Discussion
ar: مناقشة خارجية

source: Home
ar: الصفحة الرئيسية

source: Course
ar: المساق

source: Text Annotation
ar: ملاحظات نصّيّة

source: Source/Citation
ar: مصدر/ إشارة استشهاد

source: Optional for citing source of any material used. Automatic citation can be done using <a href="http://easybib.com">EasyBib</a>
ar: اختياري لذكر مصادر أي مواد مستخدمة. ويمكن ذكر المصادر تلقائيًّا باستخدام <a href="http://easybib.com">EasyBib</a>

source: Diacritic Marks
ar: علامات التشكيل

source: Add diacritic marks to be added to a text using the comma-separated form, i.e. markname;urltomark;baseline,markname2;urltomark2;baseline2
ar: أضف علامات التشكيل التي ستُضاف إلى نص باستخدام صيغة مفصولة بالفاصلة، أي markname;urltomark;baseline,markname2;urltomark2;baseline2

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
ar: تعذّر استلام نصوص مقطع الفيديو {youtube_id} من موقع يوتيوب. رمز الحالة: {status_code}.

source: We support only SubRip (*.srt) transcripts format.
ar: ندعم فقط صيغة نصوص (*.srt) لبرنامج SubRip.

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
ar: حدث خطأ في ملف نصوص ’SubRip‘ أثناء الإعراب. رسالة الخطأ الداخلية هي {error_message}

source: Something wrong with SubRip transcripts file during parsing.
ar: حدث خطأ في ملف نصوص ’SubRip‘ أثناء عملية الإعراب.

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
ar: {exception_message}: تعذّر العُثور على النصوص المحمَّلة: {user_filename}

source: Language is required.
ar: اللغة مطلوبة

source: Basic
ar: أساسي

source: There is no transcript file associated with the {lang} language.
ar: لا توجد ملفات نصوص مرتبطة باللغات {lang}

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
ar: رابط الفيديو الذي لك. قد يكون رابطًا لفيديو متوفّر على موقع يوتيوب، أو لملف فيديو بصيغة .mp4 أو .ogg أو .webm مستضاف على أي موقع آخر.

source: Default Video URL
ar: الرابط الافتراضي للفيديو

source: Component Display Name
ar: اسم العرض للمكوِّن

source: Current position in the video.
ar: الموقع الحالي في الفيديو.

source: Optional, for older browsers: the YouTube ID for the normal speed video.
ar: اختياري، للمتصفّحات ذات الإصدارات الأقدم: معرِّف يوتيوب، للفيديو ذي السرعة العادية.

source: YouTube ID
ar: معرِّف يوتيوب

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
ar: اختياري، للمتصفّات ذات الإصدارات الأقدم: معرِّف يوتيوب للفيديو ذي السرعة 0.75

source: YouTube ID for .75x speed
ar: معرِّف يوتيوب للسرعة 0.75

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
ar: اختياري، للمتصفّحات ذات الإصدارات الأقدم: معرِّف يوتيوب للفيديو ذي السرعة 1.25

source: YouTube ID for 1.25x speed
ar: معرِّف يوتيوب للسرعة 1.25

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
ar: اختياري، للمتصفّحات ذات الإصدارات الأقدم: معرِّف يوتيوب للفيديو ذي السرعة 1.5

source: YouTube ID for 1.5x speed
ar: معرِّف يوتيوب للسرعة 1.5

source: Time you want the video to start if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ar: التوقيت الذي ترغب أن يبدأ عرض مقطع الفيديو عنده إذا كنت لا ترغب بتشغيل المقطع بأكمله. وهو غير مدعوم في تطبيق الهواتف المحمولة الأصلي: سيجري تشغيل ملف الفيديو بأكمله. يُصاغ بهذا الشكل HH:MM:SS، ويبلغ الحد الأقصى لقيمته 23:59:59.

source: Video Start Time
ar: توقيت بدء الفيديو

source: Time you want the video to stop if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ar: التوقيت الذي ترغب أن يتوقف عرض مقطع الفيديو عنده إذا كنت لا ترغب بتشغيل المقطع بأكمله. وهو غير مدعوم في تطبيق الهواتف المحمولة الأصلي: سيجري تشغيل ملف الفيديو بأكمله. يُصاغ بهذا الشكل HH:MM:SS، ويبلغ الحد الأقصى لقيمته 23:59:59.

source: Video Stop Time
ar: توقيت توقف الفيديو

source: The external URL to download the video.
ar: الرابط الخارجي لتنزيل الفيديو.

source: Download Video
ar: تنزيل الفيديو

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
ar: يُسمح للطلّاب بتنزيل نسخ من هذا الفيديو بصيغ مختلفة إذا لم يتمكّنوا من استخدام مشغّل الفيديو الذي توفّره إدراك، أو إذا لم يكن باستطاعتهم الوصول إلى موقع يوتيوب. يجب عليك إضافة رابط واحد على الأقل، غير تابع ليوتيوب، ضمن حقل روابط ملف الفيديو.

source: Video Download Allowed
ar: يُسمَح بتنزيل الفيديو

source: The URL or URLs where you've posted non-YouTube versions of the video. Each URL must end in .mpeg, .mp4, .ogg, or .webm and cannot be a YouTube URL. (For browser compatibility, we strongly recommend .mp4 and .webm format.) Students will be able to view the first listed video that's compatible with the student's computer. To allow students to download these videos, set Video Download Allowed to True.
ar: رابط أو روابط إصدارات مقاطع الفيديو التي قٌمتَ بنشرتها على مواقع غير يوتيوب. يجب أن ينتهي كل رابط بـ mpeg. أو mp4. أو ogg. أو webm.، ولا يجوز أن يكون رابطًًا لموقع يوتيوب. (ونوصي بشدّة باعتماد إحدى الصيغتين .mp4 أو .webm للتوافق مع المتصفّح). سيتمكّن الطلّاب من استعراض أوّل فيديو مُدرج على القائمة ومتوافق مع حواسيبهم. اضبط إعداد "يُسمح بتنزيل الفيديو" على القيمة ’true‘ ليُسمح للطلاب بتنزيل مقاطع الفيديو هذه.

source: Video File URLs
ar: روابط ملف الفيديو

source: By default, students can download an .srt or .txt transcript when you set Download Transcript Allowed to True. If you want to provide a downloadable transcript in a different format, we recommend that you upload a handout by using the Upload a Handout field. If this isn't possible, you can post a transcript file on the Files & Uploads page or on the Internet, and then add the URL for the transcript here. Students see a link to download that transcript below the video.
ar: يمكن للطلّاب، وبشكل افتراضي، تنزيل نصّ بالامتداد srt. أو txt. عند ضبط خاصية "يُسمَح بتنزيل النص" على القيمة ’true‘. إذا رغبت بتقديم نص قابل للتنزيل بصيغة مختلفة، نوصي بتحميله كورقة عمل باستخدام حقل رفع ورقة عمل. وإذا لم يكن ذلك ممكنًا، فيمكنك نشر ملف النص على صفحة "الملفّات والمرفوعات" أو على الإنترنت، ثمّ إضافة رابط النص هنا. سيجد الطلّاب رابطًا لتنزيل ذلك النص أسفل مقطع الفيديو.

source: Downloadable Transcript URL
ar: رابط النص القابل للتنزيل

source: Allow students to download the timed transcript. A link to download the file appears below the video. By default, the transcript is an .srt or .txt file. If you want to provide the transcript for download in a different format, upload a file by using the Upload Handout field.
ar: يُسمَح للطلاب بتنزيل نص محدّد التوقيت.يظهر رابك تنزيل الملف تحت الفيديو. الصيغة الافتراضية للنص هي srt. أو txt.؛ إذا أردت إتاحة النص للتنزيل بصيغة مختلفة،فقم برفعه في حقل "ارفع ورقة عمل".

source: Download Transcript Allowed
ar: يُسمَح بتنزيل النص

source: The default transcript for the video, from the Default Timed Transcript field on the Basic tab. This transcript should be in English. You don't have to change this setting.
ar: النص الافتراضي لمقطع الفيديو، من حقل "النص الافتراضي محدّد التوقيت" في تبويبة "أساسي". ويجب أن يكون هذا النص باللغة العربية. ليس عليك تغيير هذا الإعداد.

source: Default Timed Transcript
ar: نص افتراضي محدَّد التوقيت

source: Specify whether the transcripts appear with the video by default.
ar: حدّد ما إذا كانت النصوص ستظهر مع الفيديو مبدئيًا.

source: Show Transcript
ar: أظهِر النص

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
ar: أضف نصوصًا بلغات مختلفة. انقر أدناه لتحديد لغة معيّنة ورفع ملف نص بصيغة srt. لتلك اللغة.

source: Transcript Languages
ar: لغات النصوص

source: Preferred language for transcript.
ar: اللغة المفضّلة للنص.

source: Preferred language for transcript
ar: اللغة المفضّلة للنص

source: Transcript file format to download by user.
ar: صيغة ملف النص الذي سينزّله المستخدم.

source: SubRip (.srt) file
ar: ملفّ SubRip .srt

source: Text (.txt) file
ar: ملف نصّي (txt.)

source: The last speed that the user specified for the video.
ar: السرعة الأخيرة التي حدّدها المستخدم للفيديو.

source: The default speed for the video.
ar: السرعة المبدئية للفيديو.

source: Specify whether to advance automatically to the next unit when the video ends.
ar: حدد ما إذا كنت تريد التقدم تلقائيًا إلى الوحدة التالية عند انتهاء الفيديو.

source: Specify whether YouTube is available for the user.
ar: حدّد فيما إذا كان موقع يوتيوب متاحًا للمستخدم.

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
ar: ارفع ورقة عمل مرافقة لهذا الفيديو. يمكن للطلّاب تنزيل ورقة العمل بالنقر على رابط "تنزيل ورقة العمل" الموجود تحت الفيديو.

source: Upload Handout
ar: ارفع ورقة عمل

source: Specify whether access to this video is limited to browsers only, or if it can be accessed from other applications including mobile apps.
ar: حدّد فيما إذا كان الوصول إلى هذا الفيديو مقتصرًا على المتصفِّحات فقط، أم أن بالإمكان الوصول إليه من تطبيقات أخرى، بما فيها تطبيقات الإجهزة النقّالة.

source: Video Available on Web Only
ar: مقطع الفيديو متاح عبر الإنترنت فقط

source: If you were assigned a Video ID by edX for the video to play in this component, enter the ID here. In this case, do not enter values in the Default Video URL, the Video File URLs, and the YouTube ID fields. If you were not assigned a Video ID, enter values in those other fields and ignore this field.
ar: في حال خصّصت لك إدراك معرّفًا خاصًا للفيديو الواجب تشغيله في هذا المكوِّن، فأدخِل المعرّف هنا. في هذه الحالة، فلا تُدخِل قيمًا في حقل رابط الفيديو الافتراضي، وروابط ملف الفيديو، وحقول معرّفات يوتيوب. أمّا في حال لم تخصِّص إدراك معرّفًا للفيديو، فأدخِل قيمًا في هذه الحقول الأخرى وتجاهل هذا الحقل.

source: Date of the last view of the bumper
ar: تاريخ آخر مشاهدة للمِصَدّ

source: Do not show bumper again
ar: لا تُظهِر المِصَدّ بعد الآن

source: Video Annotation
ar: ملاحظات الفيديو

source: The external source URL for the video.
ar: رابط المصدر الخارجي للفيديو

source: Source URL
ar: رابط المصدر

source: Poster Image URL
ar: رابط صورة الإعلان

source: Poster URL
ar: رابط الإعلان

source: Instructions
ar: التعليمات

source: Add instructions to help learners understand how to use the word cloud. Clear instructions are important, especially for learners who have accessibility requirements.
ar: أضف إرشادات لمساعدة الطلاب على فهم كيفية استخدام سحابة الكلمات. من المهم وضع تعليمات الواضحة، خصوصاً للطلاب الذين لديهم متطلبات تتعلق بذوي الاحتياجات الخاصة.

source: Inputs
ar: مُدخلات

source: The number of text boxes available for learners to add words and sentences.
ar: عدد صناديق النص المتاحة للطلاب لإضافة كلمات وجمل.

source: Maximum Words
ar: العدد الأقصى للكلمات

source: The maximum number of words displayed in the generated word cloud.
ar: العدد الأقصى من الكلمات المعروض في سحابة الكلمات المُنشأة.

source: Show Percents
ar: أظهِر النسب

source: Statistics are shown for entered words near that word.
ar: تَظهر إحصاءات الكلمات التي أُدخِلت بجانب تلك الكلمات.

source: Whether this learner has posted words to the cloud.
ar: إذا قام المتعلم بنشر كلمات على السحابة أم لا.

source: Student answer.
ar: إجابة الطالب.

source: All possible words from all learners.
ar: جميع الكلمات الممكنة من جميع الطلاب.

source: Top num_top_words words for word cloud.
ar: أفضل num_top_words كلمات بالنسبة لسحابة الكلمات.

source: Hello
ar: مرحباً

source: The last step to start your learning journey on Edraak
ar: الخطوة الأخيرة لبدء رحلتك التعليمية على إدراك

source: By clicking on the following button you will finish the registration process on Edraak:
ar: بالنقر على زر التفعيل تكون قد أتممت عملية إنشاء حسابك على منصة إدراك

source: Activate Your Account Now
ar: فعّل حسابك الآن

source: Or copy and paste the activation link to your browser:
ar: أو انسخ والصق رابط التنشيط في متصفحك

source: Note: If you haven't made this request, you don't need to do anything, and you will not receive any further messages from us.
ar: ملاحظة: إذا لم تكن قد تقدّمت بهذا الطلب، فلا تحتاج إلى فعل أي شيء، ولن تتلقى منا أي رسائل أخرى.

source: This mail is automated, please do not reply to this email, and if you need any help, you can contact us at
ar: هذه رسالة آلية، يرجى عدم الرد على هذه الرسالة، لمزيد من الاستفسارات بامكانك التواصل معنا على

source: Hello %(username)s
ar: مرحباً %(username)s

source: The last step to start your learning journey on %(platform_name)s
ar: الخطوة الأخيرة لبدء رحلتك التعليمية على %(platform_name)s

source: By clicking on the following button you will finish the registration process on %(platform_name)s:
ar: بالنقر على زر التفعيل تكون قد أتممت عملية إنشاء حسابك على منصة %(platform_name)s

source: Activate your account now
ar: فعّل حسابك الآن

source: Action Required %(username)s: Activate your Edraak account
ar: إجراء مطلوب %(username)s : تفعيل حسابك لدى إدراك

source: Email Change
ar: تغيير البريد الإلكتروني

source: We received a request to change the e-mail associated with your %(platform_name)s account from %(old_email)s to %(new_email)s. If this is correct, please confirm your new e-mail address by visiting:
ar: لقد تلقينا طلباً يفيد رغبتك بتغيير البريد الإلكتروني لحسابك في %(platform_name)s من %(old_email)s إلى %(new_email)s. إذا كان هذا صحيحاً، فنرجو منك تأكيد عنوان بريدك الإلكتروني الجديد بزيارة:

source: Confirm Email Change
ar: تأكيد تغيير البريد الإلكتروني

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the %(platform_name)s web site.
ar: إذا لم تطلب هذا، فلا حاجة لفعل أي شيء؛ لن تتلقّى منّا أية رسائل بريد الكتروني أخرى. يُرجى عدم الردّ على هذه الرسالة؛ وإذا احتجت إلى مساعدة، فقم بزيارة قسم المساعدة في موقع %(platform_name)s

source: Request to change %(platform_name)s account e-mail
ar: طلب تغيير البريد الإلكتروني لحساب %(platform_name)s

source: Email Change Confirmation for %(platform_name)s
ar: تأكيد تغيير البريد الإلكتروني لحساب %(platform_name)s

source: This is to confirm that you changed the e-mail associated with %(platform_name)s from %(old_email)s to %(new_email)s. If you did not make this request, please contact us immediately. Contact information is listed at:
ar: هذه الرسالة للتأكيد على قيامك بتغيير البريد الإلكتروني لحسابك في %(platform_name)s من %(old_email)s إلى %(new_email)s. في حال لم تكن قد طلبت هذا التغيير، فنرجو منك التواصل معنا فوراً. معلومات الاتصال موجودة في:

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
ar: نحتفظ دائماً بسجل عن رسائل البريد الإلكتروني القديمة، لذا يمكننا التحقيق في الأمر في حال لم تتقدّم بهذا الطلب بشكلٍ مقصود.

source: Password Reset
ar: تغيير كلمة المرور

source: You're receiving this e-mail because you requested a password reset for your user account at %(platform_name)s.
ar: وصلتك رسالة البريد الالكتروني هذه بناءً على طلبك بتغيير كلمة المرور لحسابك في %(platform_name)s.

source: However, there is currently no user account associated with your email address: %(email_address)s.
ar: لا يوجد حساب مربوط بالبريد الإلكتروني %(email_address)s

source: If you did not request this change, you can ignore this email.
ar: إذا لم تطلب هذا التغيير، يمكنك تجاهل هذه الرسالة.

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
ar: إذا لم تطلب هذا التغيير، يمكنك تجاهل هذه الرسالة - لم نغير كلمة مرورك بعد.

source: Change my Password
ar: غيِّر كلمة السر

source: Please go to the following page and choose a new password:
ar: تُرجى زيارة الصفحة التالية واختيار كلمة مرور جديدة:

source: Thanks for using our site!
ar: شكرًا لك على استخدام موقعنا!

source: The %(platform_name)s Team
ar: فريق %(platform_name)s

source: Password reset on %(platform_name)s
ar: إعادة ضبط كلمة المرور على %(platform_name)s

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
ar: لقد أتممت مساق "{course_name}" ({course_mode}، {start_date} - {end_date})

source: Completed the course "{course_name}" ({course_mode})
ar: أتممت مساق "{course_name}" ({course_mode})

source: The badge image must be square.
ar: يجب أن تكون صورة الشارة مربَّعة.

source: The badge image file size must be less than 250KB.
ar: يجب ألا يزيد حجم ملف صورة الشارة عن 250 كيلو بايت.

source: This value must be all lowercase.
ar: يجب أن تكون هذه القيمة بالحروف الإنجليزية الصغيرة.

source: The course mode for this badge image. For example, "verified" or "honor".
ar: وضع المساق لصورة الشارة هذه. مثلًا، "موثَّقة" أو "فخريّة".

source: Badge images must be square PNG files. The file size should be under 250KB.
ar: يجب أن تكون صور الشارات ملفّات صور مربّعة بصيغة PNG. وأن لا يزيد حجم كل ملفّ عن 250 كيلو بايت.

source: Set this value to True if you want this image to be the default image for any course modes that do not have a specified badge image. You can have only one default image.
ar: اضبط هذه القيمة على "true" إذا أردت اعتماد هذه الصورة كصورة افتراضية لجميع أوضاع المساق غير الموسومة بصورة محدَّدة. يمكن أن تكون لديك صورة افتراضية واحدة.

source: There can be only one default image.
ar: لا يمكن تحديد أكثر من صورة واحدة كافتراضية.

source: On each line, put the number of completed courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
ar: في كل سطر، ضع عدد المساقات المقطوعة التي ستمنح شارة لاجتيازها، ومن ثم فاصلة، ثم كُتلة فئة الشارة التي أنشأتها والتي لها عثنصر الإنشاء "edraak__course". على سبيل المثال: 3,enrolled_3_courses

source: On each line, put the number of enrolled courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
ar: في كل سطر، ضع عدد المساقات المقطوعة التي ستمنح شارة للالتحاق بها، ومن ثم فاصلة، ثم كُتلة فئة الشارة التي أنشأتها والتي لها عثنصر الإنشاء "edraak__course". على سبيل المثال: 3,enrolled_3_courses

source: Each line is a comma-separated list. The first item in each line is the slug of a badge class you have created that has an issuing component of 'openedx__course'. The remaining items in each line are the course keys the learner needs to complete to be awarded the badge. For example: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second
ar: كل سطر هو قائمة مفصولة بفاصلة. أو عنصر في كل سطر هو كتلة فئة الشارات التي أنشأتها والتي لها مكوِّن الإصدار "edraak__course". العناصر الأخرى في السطر هي مفاتيح المساقات التي يحتاجها المتعلّم لإتمامها للحصول على الشارة. على سبيل المثال: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second

source: Please check the syntax of your entry.
ar: تُرجى مراجعة صياغة مدخلاتك.

source: Take free online courses at edX.org
ar: سجّل في المساقات المجانية المطروحة عبر الإنترنت على موقع edX.org

source: © {org_name}. All rights reserved except where noted. EdX, Open edX and their respective logos are trademarks or registered trademarks of edX Inc.
ar: © {org_name}. جميع الحقوق محفوظة فيما عدا المستثناة منها تعدّ EdX وOpen edX وشعاراتهم من العلامات التجارية أو العلامات التجارية المسجّلة لدى شركة edX Inc.

source: Powered by Open edX
ar: يعمل بمنصة Open edX

source: Blog
ar: المدوّنة

source: Contact Us
ar: اتصل بنا

source: Help Center
ar: مركز المساعدة

source: Media Kit
ar: أدوات الوَسائط

source: Donate
ar: تبرَّع

source: {platform_name} for Business
ar: {platform_name} للأعمال

source: News
ar: الأخبار

source: Contact
ar: معلومات الاتّصال

source: Careers
ar: الوظائف

source: Terms of Service & Honor Code
ar: شروط الخدمة وميثاق الشرف الأكاديمي

source: Privacy Policy
ar: سياسة الخصوصية

source: Accessibility Policy
ar: سياسة إمكانية الوصول

source: Sitemap
ar: خريطة الموقع

source: Terms of Service
ar: شروط الخدمة

source: Affiliates
ar: فروع

source: Trademark Policy
ar: سياسة العلامات التجارية

source: Download the {platform_name} mobile app from the Apple App Store
ar: يُرجى تنزيل تطبيق الهاتف المحمول لمنصّة {platform_name} من متجر Apple

source: Download the {platform_name} mobile app from Google Play
ar: يُرجى تنزيل تطبيق الهاتف المحمول لمنصّة {platform_name} من Google Play

source: "{course_title}" Course Staff
ar: فريق مساق "{course_title}"

source: CCX Coach
ar: مدرِّب CCX

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
ar: يمكن إنشاء "CCX" لهذا المساق فقط من خلال خدمة خارجية. اواصل مع مدير مساق ليمنحك صلاحية الوصول.

source: The course is full: the limit is {max_student_enrollments_allowed}
ar: هذا المساق مُمتلئ: الحد الأقصى المسموح به هو {max_student_enrollments_allowed}

source: You must be a CCX Coach to access this view.
ar: يجب أن تكون مدرِّب CCX ليُسمح لك بالوصول لهذا العرض.

source: You must be the coach for this ccx to access this view
ar: يجب عليك أن تكون مدرِّب هذا الـمساق المخصّص ليُسمح لك بالوصول لهذا العرض.

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
ar: لا يمكنك إنشاء CCX من أحد المساقات باستخدام معرِّف قديم لاغٍ. تُرجى إعادة طرح هذا المساق لإتاحة هذا الإجراء.

source: created
ar: أُنشئ

source: regenerated
ar: أُعيد إنشاؤه

source: generated
ar: أُنشئ

source: All learners
ar: جميع المتعلّمين

source: For exceptions
ar: للاستثناءات

source: A human-readable description of the example certificate. For example, 'verified' or 'honor' to differentiate between two types of certificates.
ar: وصف مقروء للشهادة النموذجية. مثلًا، "موثَّقة" أو "فخرية" للتمييز بين نوعَي الشهادات.
