Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: Successfully enrolled and sent email to the following users:
ar: تم تسجيل وإرسال رسالة إلى كلّ من المستخدمين التالين بنجاح:

source: Successfully enrolled the following users:
ar: تم تسجيل المستخدمين التالين بنجاح:

source: Successfully sent enrollment emails to the following users. They will be allowed to enroll once they register:
ar: إرسلت رسائل التسجيل إلى المستخدمين التالين بنجاح. سيُسمَح لهم بالالتحاق بالمساق حالما يسجِّلون:

source: These users will be allowed to enroll once they register:
ar: سيُسمح للمستخدمين التالين بالالتحاق بالمساق حالما يسجّلون:

source: Successfully sent enrollment emails to the following users. They will be enrolled once they register:
ar: أرسلت رسائل التسجيل إلى المستخدمين التالين بنجاح.سيتم إلحاقهم بالمساق حالما يسجّلون:

source: These users will be enrolled once they register:
ar: سيتم إلحاق المستخدمين التالين بالمساق حالما يسجّلون:

source: Emails successfully sent. The following users are no longer enrolled in the course:
ar: تمّ رسال الرسائل بنجاح. لم يعُد المستخدمون التالون ملتحقين بالمساق:

source: The following users are no longer enrolled in the course:
ar: لم يعد المستخدمون التالون مسجّلين بالمساق:

source: These users were not affiliated with the course so could not be unenrolled:
ar: لم يكن هؤلاء المستخدمون منضمين إلى المساق، وبالتالي تعذّر إلغاء تسجيلهم:

source: Your message must have a subject.
ar: يجب أن يكون لرسالتك عنوان.

source: Your message cannot be blank.
ar: لا يمكن أن تكون رسالتك فارغة.

source: Your message must have at least one target.
ar: يجب أن يكون لرسالتك مستلم واحد على الأقل.

source: There are invalid keywords in your email. Check the following keywords and try again.
ar: توجد كلمات مفتاحية غير صالحة في رسالتك. تحقق من الكلمات المفتاحية التالية وحاول مرة آخرى.

source: Yourself
ar: نفسك

source: Everyone who has staff privileges in this course
ar: كل فرد لديه امتيازات الموظفين في هذا المساق

source: All learners who are enrolled in this course
ar: كل المتعلمين الملتحقين بهذا المساق

source: All learners in the {cohort_name} cohort
ar: كل المتعلمين في شعبة {cohort_name}

source: All learners in the {track_name} track
ar: كل الطلّاب في مسار {track_name}.

source: Your email message was successfully queued for sending. In courses with a large number of learners, email messages to learners might take up to an hour to be sent.
ar: تمّت جدولة رسالتك بنجاح. قد يستغرق إرسال الرسالة إلى الملتحقين بالمساق ساعة، إذا كان عددهم كبيراً.

source: You are sending an email message with the subject {subject} to the following recipients.
ar: أنت على وشك إرسال رسالة عنوانها "{subject}" إلى المستلمين التالين.

source: Is this OK?
ar: هل أنت موافِق على ذلك؟

source: Error sending email.
ar: حدث خطأ في إرسال الرسالة.

source: There is no email history for this course.
ar: لا يوجد سجلّ لرسائل البريد الإلكتروني الخاصة بهذا المساق.

source: There was an error obtaining email task history for this course.
ar: حدث خطأ أثناء جَلب سجل المهامّ الخاصة برسائل البريد الإلكتروني لهذا المساق.

source: There was an error obtaining email content history for this course.
ar: حدث خطأ أثناء جَلب سجل المحتوى الخاص برسائل البريد الإلكتروني لهذا المساق.

source: Send to:
ar: أرسل إلى:

source: Please enter a student email address or username.
ar: يُرجى إدخال اسم المستخدم الخاص بالطالب أو عنوان بريده الإلكتروني.

source: Error getting student progress url for '<%- student_id %>'. Make sure that the student identifier is spelled correctly.
ar: حدث خطأ في الحصول على عنوان url لتقدم الطالب '<%- student_id %>'. تأكد من تهجئة معرِّف الطالب.

source: Please enter a problem location.
ar: يُرجى إدخال الموقع الخاص بالمسألة.

source: Success! Problem attempts reset for problem '<%- problem_id %>' and student '<%- student_id %>'.
ar: نجح الأمر! تمت إعادة ضبط عدد محاولات حلّ المسألة رقم ’<%- problem_id %>‘ للطالب ’<%- student_id %>‘.

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ar: حدث خطأ في إعادة ضبط عدد محاولات حلّ المسألة رقم ’<%= problem_id %>‘ للطالب ’<%- student_id %>‘. تأكد من أنّ معرّفي الطالب والمسألة كاملين وصحيحان.

source: Delete student '<%- student_id %>'s state on problem '<%- problem_id %>'?
ar: حذف حالة الطالب ’<%- student_id %>‘ في المسألة رقم ’<%- problem_id %>‘؟

source: Error deleting student '<%- student_id %>'s state on problem '<%- problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
ar: خطأ في حذف حالة الطالب ’<%- student_id %>‘ في المسألة رقم ’<%- problem_id %>‘. تأكد من أنّ معرّفي الطالب والمسألة كاملين وصحيحان.

source: Module state successfully deleted.
ar: تمّ بنجاح حذف حالة الوِحدة.

source: Error getting task history for problem '<%- problem_id %>' and student '<%- student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ar: خطأ في الحصول على سجل المهمّات الخاصة بالمسألة رقم ’<%- problem_id %>‘ للطالب ’<%- student_id %>‘. تأكد من أنّ معرّفي الطالب والمسألة كاملين وصحيحان.

source: Entrance exam attempts is being reset for student '{student_id}'.
ar: يجري تصفير عدّاد محاولات اختبار القبول للطالب '{student_id}'.

source: Error resetting entrance exam attempts for student '{student_id}'. Make sure student identifier is correct.
ar: خطأ في تصفير عدّاد محاولات امتحان القبول للطالب '{student_id}'. تأكد من أنّ معرّف الطالب صحيح.

source: Enter a student's username or email address.
ar: أدخِل اسم المستخدِم للطالب أو بريده الالكترونيّ.

source: Do you want to allow this student ('{student_id}') to skip the entrance exam?
ar: هل تريد السماح لهذا الطالب ('{student_id}') بتجاوز امتحان القبول؟

source: An error occurred. Make sure that the student's username or email address is correct and try again.
ar: نأسف لحدوث خطأ. تأكّد من صحّة اسم المستخدم للطالب أو بريده الإلكتروني ثمّ أعِد المحاولة.

source: Entrance exam state is being deleted for student '{student_id}'.
ar: يجري حذف حالة امتحان القبول للطالب '{student_id}'.

source: Error deleting entrance exam state for student '{student_id}'. Make sure student identifier is correct.
ar: خطأ في حذف حالة اختبار القبول للطالب '{student_id}'.تأكّد من كتابة معرِّف الطالب بطريقة صحيحة.

source: Error getting entrance exam task history for student '{student_id}'. Make sure student identifier is correct.
ar: خطأ في الحصول على سجلّ مهام الامتحانات للطالب '{student_id}'. تأكّد من كتابة معرِّف الطالب بطريقة صحيحة.

source: Reset attempts for all students on problem '<%- problem_id %>'?
ar: صفِّر عدّاد المحاولات لكل الطلاب للمسألة '<%- problem_id %>'؟

source: Successfully started task to reset attempts for problem '<%- problem_id %>'. Click the 'Show Task Status' button to see the status of the task.
ar: نجح بدء مهمّة تصفير عدّاد المحاولات للمسألة '<%- problem_id %>'. انقر على زرّ "أظهِر حالة المهمّة" لرؤية حالة المهمّة.

source: Error starting a task to reset attempts for all students on problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
ar: حدث خطأ في بدء مهمة تصفير عدّاد محاولات حلّ جميع الطلّاب للمسألة ’<%- problem_id %>‘. تأكّد من أنّ معرِّف المسألة كامل وصحيح.

source: Error listing task history for this student and problem.
ar: حدث خطأ في سرد قائمة المهمّات السابقة لهذا الطالب والخاصة بهذه المسألة.

source: Started rescore problem task for problem '<%- problem_id %>' and student '<%- student_id %>'. Click the 'Show Task Status' button to see the status of the task.
ar: بدأت مهمّة إعادة تقييم المسألة ’<%- problem_id %>‘ للطالب ’<%- student_id %>‘. انقر على زر "اعرض حالة المهمة" لرؤية على حالة المهمة.

source: Error starting a task to rescore problem '<%- problem_id %>' for student '<%- student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
ar: حدث خطأ في بدء مهمة إعادة تقييم المسألة ’<%- problem_id %>‘ للطالب ’<%- student_id %>‘. تأكد من إدخال هذين المُعطيين بطريقة صحيحة.

source: Please enter a score.
ar: يُرجى إدخال الدرجة.

source: Started task to override the score for problem '<%- problem_id %>' and student '<%- student_id %>'. Click the 'Show Task Status' button to see the status of the task.
ar: تم بدء مهمّة إعادة ضبط درجات المسألة رقم ’<%- problem_id %>‘ للطالب ’<%- student_id %>‘. أُنقر زر ’عرض حالة المهمة‘ للاطّلاع على حالة المهمة.

source: Error starting a task to override score for problem '<%- problem_id %>' for student '<%- student_id %>'. Make sure that the the score and the problem and student identifiers are complete and correct.
ar: حدث خطأ أثناء بدء مهمة تجاوز النقاط للمسألة '<%- problem_id %>' للطالب '<%- student_id %>'. تأكد من أن النتيجة والمسألة ومعرفات الطالب كاملة وصحيحة.

source: Started entrance exam rescore task for student '{student_id}'. Click the 'Show Task Status' button to see the status of the task.
ar: بدأت مهمة إعادة تقييم امتحان القبول "{student_id}". انقر على زر "أظهِر حالة المهمة" لرؤية حالة المهمّة.

source: Error starting a task to rescore entrance exam for student '{student_id}'. Make sure that entrance exam has problems in it and student identifier is correct.
ar: حدث خطأ في بدء مهمة إعادة تقييم امتحان القبول للطالب '{student_id}'. تأكّد من وجود مسائل في امتحان القبول ومن صحّة معرِّف الطالب.

source: Rescore problem '<%- problem_id %>' for all students?
ar: أترغب في إعادة تقييم المسألة ’<%- problem_id %>‘ لكافة الطلاب؟

source: Successfully started task to rescore problem '<%- problem_id %>' for all students. Click the 'Show Task Status' button to see the status of the task.
ar: نجح بدء مهمة إعادة تقييم المسألة ’<%- problem_id %>‘ لكافة الطلاب. انقر على زر ’اعرض حالة المهمة‘ للاطّلاع على حالة المهمة.

source: Error starting a task to rescore problem '<%- problem_id %>'. Make sure that the problem identifier is complete and correct.
ar: حدث خطأ في بدء مهمة إعادة تقييم المسألة ’<%- problem_id %>‘. تأكد من أنّ معرِّف المسألة المُدخَل كامل وصحيح.

source: Task Type
ar: نوع المهمة

source: Task inputs
ar: مدخلات المهمة

source: Task ID
ar: معرِّف المهمّة

source: Requester
ar: مقدّم الطلب

source: Submitted
ar: تمّ تسليمه

source: Duration (sec)
ar: المدة (بالثواني)

source: State
ar: الحالة

source: Task Status
ar: حالة المهمة

source: Task Progress
ar: تطوّر المهمة

source: An error occurred retrieving your email. Please try again later, and contact technical support if the problem persists.
ar: حدث خطأ في جلب الرسالة. تُرجى إعادة المحاولة لاحقًا، والاتّصال بفريق الدعم الفنّي إذا استمرّت المشكلة.

source: Sent By
ar: المرسِل

source: Sent To
ar: المرسَل إليه

source: Time Sent
ar: وقت الإرسال

source: Number Sent
ar: عدد المُرسَلة

source: Copy Email To Editor
ar: انسخ الرسالة إلى محرّر الرسائل

source: Subject:
ar: الموضوع:

source: Sent By:
ar: المرسِل:

source: Time Sent:
ar: وقت الإرسال:

source: Sent To:
ar: المرسَل إليه:

source: Message:
ar: الرسالة:

source: No tasks currently running.
ar: لا توجد مهام جارية حاليًّا.

source: File Name
ar: اسم الملف

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
ar: يجري استحداث الروابط عند الطلب وينتهي مفعولها في غضون 5 دقائق نظرًا لحساسية معلومات الطالب.

source: Successfully reset the attempts for user {user}
ar: نجح تصفير عدّاد المحاولات للمستخدِم {user}

source: Failed to reset attempts for user.
ar: فشل تصفير عدّاد المحاولات للمستخدِم.

source: Successfully deleted student state for user {user}
ar: تمّ بنجاح حذف حالة الطالب للمستخدم {user}.

source: Failed to delete student state for user.
ar: فشل حذف حالة الطالب للمستخدِم

source: Successfully rescored problem for user {user}
ar: أعيد تصحيح المسألة للمستخدِم {user} بنجاح

source: Failed to rescore problem for user.
ar: فشلت إعادة تصحيح المسألة للمستخدِم.

source: Successfully rescored problem to improve score for user {user}
ar: أعيد تصحيح المسألة للمستخدِم {user} بنجاح لرفع علامته

source: Failed to rescore problem to improve score for user.
ar: فشلت إعادة تصحيح المسألة للمستخدِم لرفع علامته.

source: Successfully overrode problem score for {user}
ar: تم تجاوز نتيجة المسألة بنجاح {user}

source: Could not override problem score for {user}.
ar: تعذر تجاوز نتيجة المسألة {user}.

source: Please note: Deletion of your account and personal data is permanent and cannot be undone. Edraak will not be able to recover your account or the data that is deleted.
ar: يرجى الملاحظة: حذف حسابك وبياناتك الشخصية دائم ولا يمكن التراجع عنه. لن تتمكن منصة ادراك من استعادة حسابك أو البيانات التي تم حذفها.

source: Once your account is deleted, you cannot use it to take courses on the Edraak app, edraak.org, or any other site hosted by Edraak.
ar: بمجرد حذف حسابك ، لن تتمكن من استخدامه لأخذ دورات تدريبية على تطبيقات إدراك أو edraak.org أو أي موقع آخر تستضيفه إدراك.

source: You have selected “Delete my account.” Deletion of your account and personal data is permanent and cannot be undone. Edraak will not be able to recover your account or the data that is deleted.
ar: لقد اخترت "حذف حسابي". حذف الحساب والبيانات الشخصية نهائي ولا يمكن التراجع عنه. لن تتمكن إدراك من استعادة حسابك أو البيانات التي تم حذفها.

source: If you proceed, you will be unable to use this account to take courses on the Edraak app, edraak.org, or any other site hosted by Edraak.
ar: إذا تابعت، لن تتمكن من استخدام حسابك لأخذ مساقات على تطبيقات إدراك أو edraak.org أو أي موقع آخر تستضيفه إدراك.

source: Terms of Service and Honor Code
ar: شروط الخدمة وميثاق الشرف الأكاديمي

source: Saving your email preference
ar: يجري حفظ تفضيلات بريدك الإلكتروني

source: Enrolling you in the selected course
ar: يجري تسجيلك في المساق الذي اخترته

source: Adding the selected course to your cart
ar: تجري إضافة المساق الذي اخترته إلى سلّة مشترياتك

source: Loading your courses
ar: يجري تحميل مساقاتك

source: An error occurred.
ar: حدث خطأ.

source: (optional)
ar: (اختياري)

source: We couldn't sign you in.
ar: تعذَّر الدخول

source: An error occurred when signing you in to %s.
ar: حدثت مشكلة أثناء دخولك إلى %s.

source: Check Your Email
ar: تفقَّد بريدك الإلكتروني

source: {paragraphStart}You entered {boldStart}{email}{boldEnd}. If this email address is associated with your {platform_name} account, we will send a message with password reset instructions to this email address.{paragraphEnd}{paragraphStart}If you do not receive a password reset message, verify that you entered the correct email address, or check your spam folder.{paragraphEnd}{paragraphStart}If you need further assistance, {anchorStart}contact technical support{anchorEnd}.{paragraphEnd}
ar: {paragraphStart} لقد أدخلت {boldStart}{email}{boldEnd}. إذا كان عنوان البريد الإلكتروني هذا مرتبطًا مع حسابك في {platform_name}، فسنرسل رسالة تحوي إرشادات إعادة تعيين كلمة المرور إلى عنوان البريد الإلكتروني هذا. {paragraphEnd}{paragraphStart} إذا لم تتلق رسالة إعادة تعيين كلمة المرور، فتحقق من أنك أدخلت عنوان البريد الإلكتروني الصحيح، أو افحص مجلد الرسائل المهملة أو المزعجة لديك.{paragraphEnd}{paragraphStart} إذا كنت بحاجة إلى مزيد من المساعدة، {anchorStart}فتواصل مع الدعم الفني{anchorEnd}.{paragraphEnd}

source: An error has occurred. Try refreshing the page, or check your Internet connection.
ar: حدث خطأ. حاول أن تحدِّث الصفحة، أو تفقّد اتصالك بالإنترنت.

source: You have successfully signed into %(currentProvider)s, but your %(currentProvider)s account does not have a linked %(platformName)s account. To link your accounts, sign in now using your %(platformName)s password.
ar: لقد نجحت بالدخول باستخدام حساب %(currentProvider)s، لكنّ حسابك في %(currentProvider)s غير مرتبط بأي حساب في %(platformName)s. لربط حساباتك، ادخل الآن باستخدام حسابك في %(platformName)s.

source: We couldn't create your account.
ar: لم نتمكّن من إنشاء حسابك.

source: Create Account
ar: إنشاء حساب

source: (required)
ar: (مطلوب)

source: You've successfully signed into %(currentProvider)s.
ar: لقد نجحت في الدخول باستخدام حساب %(currentProvider)s.

source: We just need a little more information before you start learning with %(platformName)s.
ar: نحتاج فقط إلى قليل من المعلومات الإضافية قبل أن تبدأ التعلّم في%(platformName)s.

source: Your profile settings are managed by {enterprise_name}. Contact your administrator or {link_start}edX Support{link_end} for help.
ar: تتم إدارة إعدادات ملف التعريف الخاص بك بواسطة {enterprise_name}. اتصل بإدارة المؤسسة أو {link_start} تواصل معنا {link_end} للحصول على المساعدة.

source: Email Address (Sign In)
ar: عنوان البريد الإلكتروني (تسجيل الدخول)

source: You receive messages from {platform_name} and course teams at this address.
ar: تتلقى رسائل من {platform_name} وفريق المساق على هذا البريد.

source: Full Name
ar: الاسم الكامل

source: The name that is used for ID verification and that appears on your certificates.
ar: الاسم المستخدم للتحقق من الهوية والذي سيظهر في شهاداتك.

source: Country or Region of Residence
ar: بلد أو منطقة الإقامة

source: The country or region where you live.
ar: البلد أو المنطقة التي تعيش فيها.

source: Basic Account Information
ar: معلومات الحساب الأساسية

source: These settings include basic information about your account.
ar: تتضمن هذه الإعدادات معلومات أساسية عن حسابك.

source: The name that identifies you on {platform_name}. You cannot change your username.
ar: الاسم الذي يعرّف عنك في {platform_name}. لا يمكنك تغيير اسم المستخدم الخاص بك.

source: Password
ar: كلمة المرور

source: Check your email account for instructions to reset your password.
ar: يرجى التحقق من بريدك الإلكتروني للحصول على تعليمات إعادة تعيين كلمة المرور الخاصة بك.

source: The language used throughout this site. This site is currently available in a limited number of languages. Changing the value of this field will cause the page to refresh.
ar: اللغة المستخدمة في هذا الموقع. هذا الموقع متاح حاليًا بعدد محدود من اللغات. سيؤدي تغيير قيمة هذا الحقل إلى تحديث الصفحة تلقائيًا.

source: Time Zone
ar: المنطقة الزمنية

source: Select the time zone for displaying course dates. If you do not specify a time zone, course dates, including assignment deadlines, will be displayed in your browser's local time zone.
ar: حدد المنطقة الزمنية لعرض مواعيد المساق. إذا لم تقم بتحديد منطقة زمنية، سيتم عرض المواعيد التي في المساقات بما في ذلك مواعيد تقديم الواجبات، وفقاً لمنطقة التوقيت المحلي في المتصفح.

source: All Time Zones
ar: جميع المناطق الزمنية

source: Default (Local Time Zone)
ar: الافتراضي (منطقة التوقيت الحاليّة)

source: Additional Information
ar: معلومات إضافية

source: Education Completed
ar: الدرجة العلميّة

source: Gender
ar: الجِنس

source: Year of Birth
ar: سنة الميلاد

source: Preferred Language
ar: اللغة المفضّلة

source: Social Media Links
ar: روابط منصات التواصل الإجتماعي

source: Optionally, link your personal accounts to the social media icons on your edX profile.
ar: اختياريا، قم بربط حساباتك الشخصية بأيقونات منصات التواصل الاجتماعي في ملف التعريف الخاص بك.

source: {platform} Link
ar: ملفك في {platform}

source: Enter your {platform} username or the URL to your {platform} page. Delete the URL to remove the link.
ar: أدخل اسم المستخدم في حسابك على {platform} أو عنوان صفتحك على {platform}. يمكنك أيضاً حذف الرابط.

source: Linked Accounts
ar: الحسابات المرتبطة

source: You can link your social media accounts to simplify signing in to {platform_name}.
ar: يمكنك ربط حساباتك على شبكات التواصل الاجتماعي بهذا الحساب لتسهيل دخولك إلى {platform_name} لاحقًا.

source: ORDER NAME
ar: اسم الطلب

source: ORDER PLACED
ar: تم تقديم الطلب

source: TOTAL
ar: المجموع الكلي

source: ORDER NUMBER
ar: رقم الطلب

source: My Orders
ar: مشترياتي

source: This page contains information about orders that you have placed with {platform_name}.
ar: تحتوي هذه الصفحة على معلومات عن طلبات الشراء التي قمت بها في {platform_name}.

source: We've sent a confirmation message to {new_email_address}. Click the link in the message to update your email address.
ar: أرسلنا رسالة تأكيد إلى عنوان البريد الإلكتروني {new_email_address}.انقر الرابط الذي في الرسالة لتحديث عنوان بريدك الإلكتروني.

source: You must sign out and sign back in before your language changes take effect.
ar: يجب أن تخرج ثم تعيد الدخول إلى الحساب لتفعيل التغييرات المتعلقة باللغة.

source: We've sent a message to {email}. Click the link in the message to reset your password. Didn't receive the message? Contact {anchorStart}technical support{anchorEnd}.
ar: أرسلنا رسالة إلى {email}. اضغط على الرابط المرفق مع الرسالة لتقوم بتغيير كلمة المرور الخاصة بك. لم تصلك الرسالة؟ تواصل مع {anchorStart} الدعم التقني {anchorEnd}.

source: Link your {accountName} account
ar: اربط حسابك {accountName}

source: Unlink This Account
ar: افصل هذا الحساب

source: You can use your {accountName} account to sign in to your {platformName} account.
ar: يمكنك استخدام حسابك على {accountName} للدخول إلى حسابك في {platformName}.

source: Unlink your {accountName} account
ar: افصل حسابك {accountName}

source: Link Your Account
ar: اربط حسابك

source: Link your {accountName} account to your {platformName} account and use {accountName} to sign in to {platformName}.
ar: اربط حسابك على {accountName} مع حسابك على {platformName}. وبهذا تستطيع أن تدخل {platformName} باستخدام حساب {accountName}.

source: Unlinking
ar: فصل الربط

source: Linking
ar: الربط

source: Successfully unlinked.
ar: نجح فصل الربط

source: Account Information
ar: معلومات الحساب

source: Order History
ar: سجلّ المشتريات

source: Image Upload Error
ar: حدث خطأ في رفع الصورة

source: Please verify that you have uploaded a valid image (PNG and JPEG).
ar: يُرجى التأكّد من رفعك لصورة صالحة (بصيغة PNG أو JPEG).

source: An error has occurred. Please try again later.
ar: حدث خطأ. تُرجى إعادة المحاولة فيما بعد.

source: Could not submit photos
ar: تعذّر إرسال الصور

source: Professional Education Verified Certificate
ar: شهادة تعليم مهني موثّقة

source: Professional Education
ar: التعليم المهني

source: Verified Certificate upgrade
ar: التسجيل للحصول على شهادة موثّقة

source: Verified Certificate
ar: شهادة موثّقة

source: Checkout
ar: الدفع

source: Checkout with PayPal
ar: الدفع بواسطة PayPal

source: Checkout with {processor}
ar: الدفع بواسطة {processor}

source: All payment options are currently unavailable.
ar: جميع خيارات الدفع غير متوفّرة حاليًا.

source: Try the transaction again in a few minutes.
ar: أعِد المحاولة مرة أخرى بعد بضع دقائق.

source: Could not submit order
ar: تعذّر تقديم الطلب

source: Could not retrieve payment information
ar: تعذّر الحصول على معلومات الدفع

source: Take a photo of your ID
ar: التقط صورة لبطاقة هويتك

source: Review your info
ar: راجع معلوماتك

source: An error has occurred. Please try reloading the page.
ar: حدث خطأ. حاول أن تعيد تحميل الصفحة.

source: Video Capture Error
ar: خطأ في التقاط الفيديو

source: Please verify that your webcam is connected and that you have allowed your browser to access it.
ar: يُرجى التحقّق من أنّ كاميرا الويب متّصلة بحاسوبك وأنّك سمحت لمتصفّحك بالاتّصال بها.

source: No Webcam Detected
ar: لم يُعثر على كاميرا الويب

source: You don't seem to have a webcam connected.
ar: لا يبدو أنّ كاميرا الويب متّصلة بالكمبيوتر.

source: Double-check that your webcam is connected and working to continue.
ar: يُرجى التحقّق مجدّدًا من أنّ كاميرا الويب متّصلة بالكمبيوتر وغير معطّلة لتتمكّن من المتابعة.

source: Photo Captured successfully.
ar: نجح التقاط الصورة

source: No Flash Detected
ar: لم يُعثر على الفلاش

source: You don't seem to have Flash installed. Get Flash to continue your verification.
ar: يبدو أنّه لا يوجد لديك برنامج فلاش. يُرجى الحصول على فلاش لمتابعة عملية التحقّق.

source: Editable
ar: قابل للتعديل

source: Validation Error
ar: خطأ في عملية التحقق

source: In Progress
ar: قيد المعالجة

source: Placeholder
ar: حافظة مكان

source: Your upload of '{file}' succeeded.
ar: نجح رفع الملف"{file}".

source: Your upload of '{file}' failed.
ar: فشل رفع الملف"{file}".

source: Upload an image
ar: رفع صورة

source: Change image
ar: تغيير الصورة

source: An error has occurred. Refresh the page, and then try again.
ar: حدث خطأ. حدِّث الصفحة ثم أعِد المحاولة.

source: The file must be at least {size} in size.
ar: يجب ألّا يقل حجم الملف عن {size}.
