Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Coupon Codes Used
ar: رموز القسائم المستخدمة

source: Registration Code Used
ar: رمز التسجيل المستخدَم

source: Payment Status
ar: حالة الدفعة

source: Transaction Reference Number
ar: الرقم المرجعي للمعاملة

source: No status information available
ar: لا تتوفّر معلومات عن الحالة

source: No task_output information found for instructor_task {0}
ar: لم يُعثَر على معلومات عن مخرجات المهمّة فيما يخصّ مهمّة المدرِّس {0}

source: No parsable task_output information found for instructor_task {0}: {1}
ar: لم يُعثَر على معلومات قابلة للإعراب حول مخرجات المهمّة فيما يخصّ مهمّة المدرِّس {0}: {1}

source: No parsable status information available
ar: لا تتوفّر معلومات قابلة للإعراب عن حالة المهمّة

source: No message provided
ar: لم تُقدَّم أي رسالة

source: Invalid task_output information found for instructor_task {0}: {1}
ar: وُجدت معلومات غير صالِحة عن مخرجات المهمّة لمهمّة المدرِّس {0}: {1}

source: No progress status information available
ar: لا تتوفّر أي معلومات عن تقدّم الحالة

source: No parsable task_input information found for instructor_task {0}: {1}
ar: لم يُعثَر على معلومات قابلة للإعراب حول مُدخلات المهمّة لمهمّة المدرِّس {0}: {1}

source: Progress: {action} {succeeded} of {attempted} so far
ar: التقدّم: {succeeded} من محاولات {action} بنجاح من أصل {attempted} حتى الآن

source: Unable to find submission to be {action} for student '{student}'
ar: لم يُعثَر على التقديم الذي الذي يمكن أن يكون قد {action} للطالب '{student}'

source: Problem failed to be {action} for student '{student}'
ar: فشلت المسألة في أن تكون قد {action} للطالب ’{student}‘

source: Problem successfully {action} for student '{student}'
ar: لقد {action} المسألة بنجاح للطالب ’{student}‘

source: Unable to find entrance exam submission to be {action} for student '{student}'
ar: تعذّر العثور على امتحان الدخول المقدم الذي كان الطالب '{student}' قد {action}

source: Entrance exam successfully {action} for student '{student}'
ar: لقد تمّ {action} امتحان القبول للطالب ’{student}‘ بنجاح

source: Unable to find any students with submissions to be {action}
ar: تعذّر العثور على أيّ طلاب لهم تسليمات ليتم {action}ـهم

source: Problem failed to be {action} for any of {attempted} students
ar: تعذَّر {action} المسألة لأيّ من الطلاب الـ{attempted}

source: Problem successfully {action} for {attempted} students
ar: نجح {action} المسألة لـ{attempted} طلاب

source: Problem {action} for {succeeded} of {attempted} students
ar: لقد {action} المسألة لـ{succeeded} من الطلاب الـ{attempted}

source: Unable to find any recipients to be {action}
ar: تعذّر العثور على أي مستلِمين ليتمّ {action}ـهم

source: Message failed to be {action} for any of {attempted} recipients
ar: تعذَّر {action} الرسالة إلى أيّ من المستلمين الـ{attempted}

source: Message successfully {action} for {attempted} recipients
ar: نجح {action} الرسالة إلى {attempted} مستلمين

source: Message {action} for {succeeded} of {attempted} recipients
ar: لقد {action} الرسالة إلى {succeeded} من المستلمين الـ{attempted}

source: Status: {action} {succeeded} of {attempted}
ar: الحالة: {action} {succeeded} من {attempted}

source: (skipping {skipped})
ar: (يجري تخطّي {skipped})

source: (out of {total})
ar: (من أصل {total})

source: This component's access settings refer to deleted or invalid group configurations.
ar: إعدادات الدخول لهذا العنصر تشير إلى أنّ إعدادات المجموعة محذوفة أو غير صحيحة.

source: This unit's access settings refer to deleted or invalid group configurations.
ar: تشير إعدادات دخول هذه الوحدة إلى تكوينات مجموعة محذوفة أو غير صالحة.

source: This component's access settings refer to deleted or invalid groups.
ar: إعدادات الدخول لهذا العنصر تشير إلى أنّ المجموعات محذوفة أو غير صحيحة.

source: This unit's access settings refer to deleted or invalid groups.
ar: تشير إعدادات دخول هذه الوحدة إلى مجموعة محذوفة أو غير صالحة.

source: This component's access settings contradict its parent's access settings.
ar: تتعارض إعدادات الدخول لهذا المكون مع إعدادات وصول في أصله.

source: Whether to display this module in the table of contents
ar: فيما إذا كانت ستُعرض هذه الوحدة في فهرس المحتويات

source: What format this module is in (used for deciding which grader to apply, and what to show in the TOC)
ar: ما هي صيغة المعتمدة لهذه الوحدة (تُستخدم لاختيار المُقيّم المُطبّق وما يتوجّب إظهاره في فهرس المحتويات)

source: Course Chrome
ar: طريقة التنقل بين أجزاء المساق

source: Enter the chrome, or navigation tools, to use for the XBlock in the LMS. Valid values are: "chromeless" -- to not use tabs or the accordion; "tabs" -- to use tabs only; "accordion" -- to use the accordion only; or "tabs,accordion" -- to use tabs and the accordion.
ar: ادخل طريقة التنقل بين أجزاء المساق، أو أدوات التنقُّل، وذلك لاستخدمها للوحدات في نظام إدارة المحتوى. القيم الصالحة هي: "chromeless" -- عدم استخدام التبويبات أو القوائم الجانبية؛ "tabs" -- استخدام التبويبات فقط؛ "accordion" -- استخدام القوائم الجانبية فقط؛ أو "tabs,accordion" -- استخدام التبويبات و القوائم الجانبية.

source: Default Tab
ar: التبويب الافتراضي

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
ar: ادخل التبويبة التي تم اختيارها في الوِحدة. في حال لم تُضبط، سيتم اختيار تبويبة "المساق".

source: LaTeX Source File Name
ar: اسم ملف LaTeX المصدري

source: Enter the source file name for LaTeX.
ar: أدخل اسم الملف المصدري الخاص بــ LaTeX

source: A dictionary that maps which groups can be shown this block. The keys are group configuration ids and the values are a list of group IDs. If there is no key for a group configuration or if the set of group IDs is empty then the block is considered visible to all. Note that this field is ignored if the block is visible_to_staff_only.
ar: قاموس يحدّد المجموعات التي يمكن إظهارها في هذه الوِحدة. المفاتيح المستخدمة هي معرّفات لإعدادات المجموعات، أمّا القيم فهي عبارة عن قائمة بمعرّفات المجموعات. ستُعتبر الوِحدة مرئيّة للجميع في حال لم يتوفّر مفتاح لإعدادات مجموعة ما، أو كانت قائمة معرّفات المجموعات فارغة. لاحظ أنه يتم تجاهل هذا الحقل في حال اقتصرت رؤية الوِحدة على طاقم المساق.

source: My Notes
ar: ملاحظاتي

source: Order Payment Confirmation
ar: تأكيد سداد دفعة

source: Confirmation and Registration Codes for the following courses: {course_name_list}
ar: رموز التأكيد والتسجيل الخاصة بالمساقات التالية: {course_name_list}

source: Trying to add a different currency into the cart
ar: تجري محاولة إضافة عملة مختلفة إلى سلّة المشتريات

source: Internal reference code for this invoice.
ar: الرقم المرجعي الداخلي الخاص بهذه الفاتورة.

source: Customer's reference code for this invoice.
ar: الرقم المرجعي للعميل الخاص بهذه الفاتورة.

source: The amount of the transaction. Use positive amounts for payments and negative amounts for refunds.
ar: قيمة المعاملة. استخدِم قيم موجبة للدفعات وقيم سالبة للمبالغ المستردَّة.

source: Lower-case ISO currency codes
ar: رموز العملة بأحرف صغيرة، حسب معيار ’أيزو‘

source: Optional: provide additional information for this transaction
ar: اختياري: يُرجى توفير معلومات إضافية حول هذه المعاملة

source: The status of the payment or refund. 'started' means that payment is expected, but money has not yet been transferred. 'completed' means that the payment or refund was received. 'cancelled' means that payment or refund was expected, but was cancelled before money was transferred.
ar: حالة عملية الدفع أو استرداد المبلغ. تدل كلمة ’بدأت‘ على أنّ الدفعة متوقَّعة، إلا أن المبلغ المالي لم يُحوَّل بعد بينما يدل الخيار ’تمّت‘ على استلام الدفعة أو مبلغ المال المسترَدّ. يشير الخيار ’أُلغيَت‘ على توقّع الدفعة أو مبلغ المال المُسترَدّ إلّا أنّ العمليّة قد أُلغِيت قبل تحويل المبلغ المالي.

source: The number of items sold.
ar: عدد العناصر المُباعة.

source: The price per item sold, including discounts.
ar: تكلفة كل عنصر مُباع شاملة الخصومات.

source: Registration for Course: {course_name}
ar: التسجيل للمساق: {course_name}

source: Please visit your {link_start}dashboard{link_end} to see your new course.
ar: يُرجى زيارة {link_start}صفحة لوحتي التعليمية{link_end} الخاصة بك لرؤية مساقك الجديد.

source: Enrollment codes for Course: {course_name}
ar: رموز التسجيل للمساق: {course_name}

source: Mode {mode} does not exist for {course_id}
ar: الوضع {mode} غير موجود لـ{course_id}

source: {mode_name} for course {course}
ar: {mode_name} للمساق {course}

source: You can unenroll in the course and receive a full refund for 14 days after the course start date.
ar: يمكنك إلغاء تسجيلك في المساق واستعادة كامل المبلغ المدفوع خلال 14 يومًا تلي تاريخ بدء المساق.

source: If you haven't verified your identity yet, please start the verification process ({verification_url}).
ar: إذا لم توثّق هويّتك بعد، يُرجى منك البدء بعملية التوثيق ({verification_url}).

source: You can unenroll in the course and receive a full refund for 2 days after the course start date.
ar: يمكنك إلغاء تسجيلك في المساق واستعادة كامل المبلغ المدفوع بعد تاريخ بدء المساق بيومين.

source: {refund_reminder_msg}To receive your refund, contact {billing_email}. Please include your order number in your email. Please do NOT include your credit card information.
ar: {refund_reminder_msg} لاستلام المبلغ المرتجع، تواصَل مع {billing_email}. يُرحى تزويدنا برقم الطلب في نص رسالة البريد الإلكتروني دون بيانات بطاقتك البنكية.

source: We greatly appreciate this generous contribution and your support of the {platform_name} mission. This receipt was prepared to support charitable contributions for tax purposes. We confirm that neither goods nor services were provided in exchange for this gift.
ar: نثمّن مساهمتك الكريمة ودعمك لرسالة {platform_name}. لقد أعددنا هذا إيصال دعم المساهمات الخيرية هذا لأغراض ذات صلة بالضرائب، ونؤكّد عدم تقديم أي بضائع أو خدمات لقاء هذه المنحة.

source: Could not find a course with the ID '{course_id}'
ar: لم يُعثَر على مساق له المعرِّف '{course_id}'

source: Donation for {course}
ar: تبرّع لمساق {course}

source: Donation for {platform_name}
ar: تبرّع لـ {platform_name}

source: Page {page_number} of {page_count}
ar: الصفحة {page_number} من {page_count}

source: Invoice
ar: فاتورة

source: Order
ar: الطلبية

source: Date: {date}
ar: التاريخ: {date}

source: Quantity
ar: الكمّية

source: List Price per item
ar: السعر المعروض لكل عنصر

source: Discount per item
ar: الخصم لكل عنصر

source: Amount
ar: القيمة

source: Total
ar: المجموع

source: Payment Received
ar: المَدفوع

source: Balance
ar: الرصيد

source: Billing Address
ar: عنوان الفوترة

source: Disclaimer
ar: إخلاء مسؤولية

source: TERMS AND CONDITIONS
ar: الأحكام والشروط

source: The payment processor did not return a required parameter: {0}
ar: لم يَرجِع معالِج الدفع بمُعامل معيّن مطلوب: {0}

source: The payment processor returned a badly-typed value {0} for param {1}.
ar: أرجع معالِج الدفعات قيمةً مطبوعة بشكل سيّئ {0} للمُعامل {1}.

source: The payment processor accepted an order whose number is not in our system.
ar: قَبِل معالِج الدفعات طلبًا ذا رقم غير موجود في نظامنا.

source: The amount charged by the processor {0} {1} is different than the total cost of the order {2} {3}.
ar: يختلف المبلغ المطلوب من المعالِج {0} {1} عن إجمالي قيمة مبلغ الطلبيّة {2} {3}.

source: Sorry! Our payment processor did not accept your payment. The decision they returned was {decision_text}, and the reason was {reason_text}. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}.
ar: عذرًا! لم يقبل قسمنا المختصّ بمعالجة الدفعات دفعتك. أما القرار الذي أرجعه القسم فقد كان {decision_text}، والسبب هو {reason_text}. لم يتم خصم المبلغ من حسابك. جرِّب طريقة أخرى للدفع. راسلنا على {email} لنجيب عن أي استفسار متعلق بالدفع.

source: Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data!We apologize that we cannot verify whether the charge went through and take further action on your order.The specific error message is: {error_message}. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: عذرًا! أَرجَع لنا قسمنا المختصّ بمعالجة الدفعات تأكيدًا يحوي بياناتِ متضاربة! نعتذر لعدم قدرتنا على التثبّت مما إذا جرى خصم الرسوم فعلًا لاتّخاذ إجراء إضافي حيال طلبك. رسالة الخطأ المحدّدة هي: {error_message}. يُحتمل أن يكون المبلغ قد اقتُطِع من حساب بطاقتك. راسِلنا على {email} لنجيب عن أي استفسار يخصّ سداد الدفعات.

source: Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: {error_message}. Your credit card has probably been charged. Contact us with payment-specific questions at {email}.
ar: عذرًا! لقد حدث خطأ أدّى إلى احتساب مبلغ مختلف عن الكلفة المترتّبة على طلبيتك! رسالة الخطأ: {error_message}. يغلب الظنّ أن يكون المبلغ قد خُصم من بطاقتك. راسلنا على {email} في حال كانت لديك أيّ استفسارات تتعلق بالدفعات.

source: Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: {error_message}. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: عذرًا! أَرجَع لنا قسمنا المختصّ بمعالجة الدفعات رسالةً تالفة تخصّ خصم رسومك،مما جعلنا غير قادرين على التثبّت مما إذا كان مصدر الرسالة هو معالج الدفعات فعلًا. رسالة الخطأ هي: {error_message}. نعتذر لعدم قدرتنا على التثبّت مما إذا كان قد تم خصم الرسوم فعلًا لاتّخاذ إجراء إضافي حيال طلبك. يُحتمل أن يكون المبلغ قد اقتُطِع من حساب بطاقتك. راسلنا على {email} في حال كانت لديك أيّ استفسارات تتعلق بالدفعات.

source: Successful transaction.
ar: معاملة ناجحة.

source: The request is missing one or more required fields.
ar: يًنقُص الطلب حقل واحد أو أكثر من الحقول المطلوبة.

source: One or more fields in the request contains invalid data.
ar: يحوي حقل واحد أو أكثر من الحقول المطلوبة في طلبك بياناتٍ غير صالحة.

source: The merchantReferenceCode sent with this authorization request matches the merchantReferenceCode of another authorization request that you sent in the last 15 minutes. Possible fix: retry the payment after 15 minutes.
ar: إنّ الرمز المرجعي للبائع المُستخدم في طلب التفويض هذا يتطابق مع رمز مرجعي لبائع، مُستخدم في طلب تفويض آخر أرسلته أنت خلال آخر 15 دقيقة. الحلّ المحتمل: إعادة محاولة الدفع بعد 15 دقيقة.

source: Error: General system failure. Possible fix: retry the payment after a few minutes.
ar: خطأ: فشل عام في النظام. والحل المحتمل: إعادة محاولة الدفع بعد بضع دقائق.

source: Error: The request was received but there was a server timeout. This error does not include timeouts between the client and the server. Possible fix: retry the payment after some time.
ar: خطأ: تم استلام الطلب، ولكن مهلة الاتصال قد انتهت. لا يتضمن هذا الخطأ قيمة المهلة بين العميل والخادم. الحلّ المحتمل: أعِد محاولة الدفع بعد وقت قليل.

source: Error: The request was received, but a service did not finish running in time Possible fix: retry the payment after some time.
ar: خطأ: تم استلام الطلب، ولكن هناك خدمة لم تُنهِ عملها ضمن الوقت المحدد. الحلل المحتمل: أعِد محاولة الدفع بعد بضع دقائق.

source: The issuing bank has questions about the request. Possible fix: retry with another form of payment
ar: لدى البنك المُصدِر تساؤلات حول الطلب. الحلّ المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible fix: retry with another form of payment
ar: البطاقة منتهية الصلاحية. كما ويُمكن أن تتلقّى هذه الرسالة أيضًا في حال كان تاريخ انتهاء الصلاحية الذي قدّمته غير مطابق للتاريخ المحدّد في ملفّ البنك المُصدِر. الحلّ الممكن: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: General decline of the card. No other information provided by the issuing bank. Possible fix: retry with another form of payment
ar: حدث رفض عام للبطاقة. لم يوفّر البنك المُصدِر أي معلومات أخرى. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: Insufficient funds in the account. Possible fix: retry with another form of payment
ar: المبلغ الموجود في الحساب غير كافٍ. والحلّ المُحتمل: إعادة محاولة الدفع باستخدام وسيلة أخرى

source: Unknown reason
ar: سبب غير معروف.

source: Issuing bank unavailable. Possible fix: retry again after a few minutes
ar: البنك المُصدِر غير متوفّر. الحلّ المُحتمل: إعادة المحاولة بعد دقائق قليلة

source: Inactive card or card not authorized for card-not-present transactions. Possible fix: retry with another form of payment
ar: بطاقة غير مفعَّلة، أو إنّ البطاقة غير صالحة للمعاملات التي لا تستلزم وجود بطاقة. والحل المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: The card has reached the credit limit. Possible fix: retry with another form of payment
ar: بلغت البطاقة السقف الائتماني المسموح به. الحلّ المُحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: Invalid card verification number. Possible fix: retry with another form of payment
ar: رقم التحقق الخاص بالبطاقة غير صالِح. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: Invalid account number. Possible fix: retry with another form of payment
ar: رقم الحساب غير صالِح. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: The card type is not accepted by the payment processor. Possible fix: retry with another form of payment
ar: لم يقبل معالِج الدفعات نوع بطاقتك. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: General decline by the processor. Possible fix: retry with another form of payment
ar: رفض عام من المعالج. الحلّ المحتمل: إعادة المحاولة باستخدام وسيلة دفع أخرى

source: There is a problem with our CyberSource merchant configuration. Please let us know at {0}
ar: ثمّة مشكلة في ضبط الإعدادات الخاصة ببائعنا لدى شركة CyberSource العاملة في مجال خدمات السداد الإلكترونية. يُرجى إعلامنا عبر {0}

source: The requested amount exceeds the originally authorized amount.
ar: يتجاوز المبلغ المطلوب المبلغ الأصلي المسموح به.

source: Processor Failure. Possible fix: retry the payment
ar: فشِل المعالِج. الحلّ المحتمل: إعادة محاولة الدفع.

source: The authorization has already been captured
ar: سبق أن جرى الحصول على التفويض

source: The requested transaction amount must match the previous transaction amount.
ar: يجب أن يتطابق مبلغ المعاملة المطلوب مع مبلغ المعاملة السابق.

source: The card type sent is invalid or does not correlate with the credit card number. Possible fix: retry with the same card or another form of payment
ar: نوع البطاقة المرسل غير صالح أو لا يتماشى مع رقم البطاقة الائتمانية. الحل المحتمل: إعادة المحاولة باستخدام البطاقة ذاتها أو باستخدام وسيلة دفع أخرى

source: The request ID is invalid.
ar: معرِّف الطلب غير صالِح.

source: You requested a capture through the API, but there is no corresponding, unused authorization record.
ar: لقد طلبت حجز مبلغ ماليّ عبر واجهة برمجة التطبيقات، ولكن ليس هناك أيّ سجلّ تخويل غير مستخدم ذي علاقة.

source: The transaction has already been settled or reversed.
ar: لد تمت تسوية القَيد أو عكسُه.

source: The capture or credit is not voidable because the capture or credit information has already been submitted to your processor. Or, you requested a void for a type of transaction that cannot be voided.
ar: إن عملية حجز مبلغ مالي او صرفُه لا يمكن إلغاؤها، وذلك إما لأنه قد تم إرسال معلومات الحجز أو الصرف قد أرسلت بالفعل إلى الجهة المسؤولة. أو لأنّك قد طلبت إلغاء حركة لا يُمكن إلغاؤها.

source: You requested a credit for a capture that was previously voided
ar: لقد طلبت إجراء دفعة لحجز ماليّ تم إلغاؤه سابقًا

source: Error: The request was received, but there was a timeout at the payment processor. Possible fix: retry the payment.
ar: خطأ: جرى استلام الطلب إلا أن مهلة العملية المسموح بها لمعالج الدفعات قد انتهت. الحلّ المحتمل: إعادة محاولة الدفع.

source: The authorization request was approved by the issuing bank but declined by CyberSource.' Possible fix: retry with a different form of payment.
ar: وافق البنك المُصدِر على طلب التفويض إلا أن ’CyberSource‘ رفضته.' الحلّ الممكن: إعادة المحاولة باستخدام وسيلة دفع أخرى.

source: UNKNOWN REASON
ar: سبب مجهول

source: The payment processor did not return a required parameter: {parameter}
ar: لم يَرجِع معالِج الدفع بمُعامل مطلوب: {parameter}

source: The payment processor returned a badly-typed value {value} for parameter {parameter}.
ar: أرجع معالِج الدفعات قيمةً مطبوعة بشكل سيّئ {value} للمُعامل {parameter}.

source: The amount charged by the processor {charged_amount} {charged_amount_currency} is different than the total cost of the order {total_cost} {total_cost_currency}.
ar: يختلف المبلغ الذي طلبه معالِج الدفع {charged_amount} {charged_amount_currency} عن إجمالي تكلفة الطلبيّة {total_cost} {total_cost_currency}.

source: Sorry! Our payment processor did not accept your payment. The decision they returned was {decision}, and the reason was {reason}. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}.
ar: عذرًا! لم يقبل مُعالِج الدفعات لدينا دُفعتَك. أما القرار الذي أرجعه القسم فقد كان {decision}، والسبب هو {reason}. لم يجري خصم المبلغ من حسابك. تُرجى محاولة الدفع باستخدام وسيلة دفع أخرى. للاستفسار عن أمور لها علاقة بالدفع، راسلنا على{email}.

source: Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data! We apologize that we cannot verify whether the charge went through and take further action on your order. The specific error message is: {msg} Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: عذرًا! أَرجَع لنا معالِج الدفعات تأكيدًا يحوي بياناتِ متضاربة. نعتذر لعدم قدرتنا على التثبّت فيما إذا جرى خصم الرسوم فعلًا لاتّخاذ إجراء إضافي حيال طلبك. رسالة الخطأ هي: {msg}. يُحتمل أن يكون المبلغ قد اقتُطِع من حساب بطاقتك. للاستفسار عن أمور لها علاقة بالدفع، راسلنا على{email}.

source: Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: {msg}. Your credit card has probably been charged. Contact us with payment-specific questions at {email}.
ar: عذرًا! لقد حدث خطأ أدّى إلى احتساب مبلغ مختلف عن الكلفة الإجمالية لطلبيتك! ورسالة الخطأ هي: {msg}. يغلب الظن أن يكون المبلغ قد اقتُطع من بطاقتك. للاستفسار عن أمور لها علاقة بالدفع، راسلنا على{email}.

source: Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: {msg}. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
ar: عذرًا! أَرجَع لنا مُعالِج الدفعات رسالةً تالفة تخصّ خصم رسومك، مما جعلنا غير قادرين على التثبّت مما إذا كان مصدر الرسالة هو معالج الدفعات فعلًا. رسالة الخطأ هي: {msg}. نعتذر لعدم قدرتنا على التثبّت مما إذا جرى خصم الرسوم فعلًا لاتّخاذ إجراء إضافي حيال طلبك. يُحتمل أن يكون المبلغ قد اقتُطِع من حساب بطاقتك. للاستفسار عن أمور لها علاقة بالدفع، راسلنا على{email}.

source: Sorry! Our payment processor sent us back a message saying that you have cancelled this transaction. The items in your shopping cart will exist for future purchase. If you feel that this is in error, please contact us with payment-specific questions at {email}.
ar: عذرًا! أرجَع لنا معالج الدفعات رسالةً مفادها أنّك قد ألغيتَ هذه العملية. سنحتفظ بالعناصر الموجودة في سلّة مشترياتك لعمليّات شراء مستقبليّة. إذا كنت تعتقد بأنّ هذا حصل عن طريق الخطأ، فنرجو منك مراسلتنا على {email} لنجبل عن أي استفسار يخصّ سداد الدفعات.

source: We're sorry, but this payment was declined. The items in your shopping cart have been saved. If you have any questions about this transaction, please contact us at {email}.
ar: عذرًا، لقد رُفضَت هذه الدفعة وحُفظت العناصر الموجودة في سلّة مشترياتك. في حال كانت لديك أيّ استفتسارات حول هذه المعاملة، نرجو منك مراسلتنا على {email}.
