Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: This may be happening because of an error with our server or your internet connection. Try refreshing the page or making sure you are online.
ar: قد يُعزى هذا إلى حدوث مشكلة في الخادم لدينا أو في اتّصالك بالإنترنت. يُرجى محاولة تحديث الصفحة أو التأكّد من اتّصالك بالإنترنت.

source: Studio's having trouble saving your work
ar: يواجه نظام Studio صعوبة في حفظ عملك

source: OpenAssessment Save Error
ar: نأسف لحدوث خطأ في حفظ التقييم المفتوح.

source: Saving
ar: يجري الحفظ

source: This link will open in a new browser window/tab
ar: سيفتح هذا الرابط في نافذة متصفّح جديدة/تبويبة جديدة

source: This link will open in a modal window
ar: سيفتح هذا الرابط في نافذة منبثقة جديدة.

source: Delete
ar: احذِف

source: Deleting
ar: جاري الحذف

source: Cancel
ar: الغِ

source: There was an error during the upload process.
ar: نأسف لحدوث خطأ خلال عملية التحميل.

source: There was an error while unpacking the file.
ar: نأسف لحدوث خطأ خلال عملية تفريغ الملف.

source: There was an error while verifying the file you submitted.
ar: نأسف لحدوث خطأ أثناء التحقق من الملف الذي قدّمته.

source: Choose new file
ar: اختر ملف جديد

source: File format not supported. Please upload a file with a {ext} extension.
ar: صيغة الملف غير مدعومة رجاءً قم يتحميل ملف بامتداد {ext}.

source: There was an error while importing the new library to our database.
ar: نأسف لحدوث خطأ أثناء استيراد المكتبة الجديدة إلى قاعدة بياناتنا.

source: There was an error while importing the new course to our database.
ar: نأسف لحدوث خطأ أثناء استيراد المساق الجديد إلى قاعدة بياناتنا.

source: Your import has failed.
ar: عذرًاً، لم تنجح عملية الاستيراد.

source: Your import is in progress; navigating away will abort it.
ar: جاري تنفيذ عملية الاستيراد؛ يُرجى الانتباه إلى أنّ انتقالك إلى موقع آخر سيوقف العملية.

source: Error importing course
ar: نأسف لحدوث خطأ في استيراد المساق.

source: There was an error with the upload
ar: نأسف لحدوث خطأ في عملية التحميل.

source: Organization:
ar: المؤسّسة:

source: Course Number:
ar: رقم المساق:

source: Course Run:
ar: تشغيل المساق:

source: (Read-only)
ar: (للقراءة فقط)

source: Re-run Course
ar: مساق مشغَّل مرّة أخرى

source: View Live
ar: عرض النسخة الحالية المنشورة

source: Uploading
ar: يجري الرفع

source: Chapter name and asset_path are both required
ar: كل من الحقلين ’اسم الفصل‘ و ’مسار المادّة الموجودة‘ مطلوب.

source: Chapter name is required
ar: اسم الفصل مطلوب

source: asset_path is required
ar: مسار المادة الموجودة مطلوب

source: You must specify a name
ar: عليك أن تحدّد اسمًا.

source: Textbook name is required
ar: اسم الكتاب مطلوب

source: Please add at least one chapter
ar: يٌرجى إضافة فصل واحد على الأقل

source: All chapters must have a name and asset
ar: يجب أن يتوفّر اسم ومادّة لجميع الفصول.

source: Only <%= fileTypes %> files can be uploaded. Please select a file ending in <%= fileExtensions %> to upload.
ar: لا يمكن تحميل سوى الملفّات <%= fileTypes %>. لذا يُرجى اختيار ملف ينتهي بـ <%= fileExtensions %> لتحميله.

source: or
ar: أو

source: This unit has validation issues.
ar: هذه الوحدة لديها مشاكل التحقق من الصحة.

source: This component has validation issues.
ar: هناك إشكالات في المصادقة على هذا المكوِّن.

source: Close
ar: أغلِق

source: Name
ar: الاسم

source: Choose File
ar: اختر ملفًا

source: Adding
ar: جاري الإضافة

source: OK
ar: موافق

source: None
ar: لا شيء

source: Remove
ar: أزِل

source: Upload a new PDF to “<%= name %>”
ar: حمّل ملف PDF جديد إلى “<%= name %>”.

source: Please select a PDF file to upload.
ar: يُرجى اختيار ملف PDF لتحميله.

source: All Rights Reserved
ar: جميع الحقوق محفوظة

source: You reserve all rights for your work
ar: إنّك تحتفظ بجميع حقوق عملك.

source: Creative Commons
ar: النقاط المشتركة المبتكرة

source: You waive some rights for your work, such that others can use it too
ar: إنّك تتنازل عن بعض حقوق عملك، بخيث يتمكّن الآخرين من استخدامه أيضًا.

source: Version
ar: النسخة

source: Attribution
ar: الإسناد

source: Allow others to copy, distribute, display and perform your copyrighted work but only if they give credit the way you request. Currently, this option is required.
ar: السماح للآخرين بنسخ عملك محفوظ الحقوق وتوزيعه وعرضه وتأديته بشرط نسب العمل إليك بالشكل الذي تطلبه. وهذا الخيار مطلوب حاليًا.

source: Noncommercial
ar: استخدام غير تجاري

source: Allow others to copy, distribute, display and perform your work - and derivative works based upon it - but for noncommercial purposes only.
ar: السماح للآخرين بنسخ عملك - والأعمال المقتبسة المبنية عليه - وتوزيعه وعرضه وتأديته، لكن فقط للأغراض غير التجارية.

source: No Derivatives
ar: عدم الاقتباس

source: Allow others to copy, distribute, display and perform only verbatim copies of your work, not derivative works based upon it. This option is incompatible with "Share Alike".
ar: السماح للآخرين بنَسْخ نُسَخ حرفية من عملك - وليس أي أعمال مقتبسة عنه - وتوزيعها وعرضها وتأديتها. ولا يتوافق هذا الخيار مع خيار "مشاركة بالتساوي".

source: Share Alike
ar: مشاركة بالتساوي

source: Allow others to distribute derivative works only under a license identical to the license that governs your work. This option is incompatible with "No Derivatives".
ar: السماح للآخرين بتوزيع أعمال مقتبسة بموجب ترخيص مطابق لترخيص عملك. ولا يتوافق هذا الخيار مع خيار "عدم الاقتباس".

source: Ok
ar: موافق

source: Unknown
ar: مجهول

source: Are you sure?
ar: هل أنت واثق؟

source: Upload File
ar: ارفع ملفًّا

source: Save
ar: احفَظ

source: Advanced
ar: متقدِّم

source: Editing: %(title)s
ar: تعديل: %(title)s

source: Unit
ar: وحدة

source: Component
ar: مكوِّن

source: Move
ar: حرّك

source: Choose a location to move your component to
ar: اختر مكانًا لتحريك مكوناتك إليه

source: Move: {displayName}
ar: حرّك: {displayName}

source: Sections
ar: الأقسام

source: Subsections
ar: الأقسام فرعية

source: Units
ar: الوحدات

source: Components
ar: المكوِّنات

source: Groups
ar: الشُعب

source: This {parentCategory} has no {childCategory}
ar: هذه {parentCategory} لا تحتوي على {childCategory}

source: Course Outline
ar: الخطة الدراسيّة

source: Date added
ar: تاريخ الإضافة

source: Editing access for: %(title)s
ar: أحقّية الولوج للتحرير لـ: %(title)s

source: Publishing
ar: جاري النشر

source: Discard Changes
ar: تجاهل التغييرات

source: Are you sure you want to revert to the last published version of the unit? You cannot undo this action.
ar: هل أنت واثق من رغبتك في العودة إلى آخر نسخة منشورة من الوحدة؟ لا يمكنك التراجع عن هذه العملية لاحقًا.

source: Discarding Changes
ar: جاري إلغاء التغييرات

source: Hiding from Students
ar: إخفاء عن الطلّاب

source: Explicitly Hiding from Students
ar: إخفاء واضح عن الطلّاب

source: Inheriting Student Visibility
ar: توارُث الإعداد الخاص بتمكين الطلّاب من الرؤية

source: Make Visible to Students
ar: جعله مرئيًّا للطلّاب

source: If the unit was previously published and released to students, any changes you made to the unit when it was hidden will now be visible to students. Do you want to proceed?
ar: في حال نُشرت الوحدة وأُصدرت للطلّاب من قبل، فإنّ أي تغييرات كنت قد أدخلتها عليها عندما كانت مخفية ستصبح الآن مرئية للطلّاب. هل تريد المتابعة؟

source: Making Visible to Students
ar: تمكين الطلّاب من الرؤية

source: Hide Previews
ar: إخفاء المعاينة

source: Show Previews
ar: إظهار المعاينة

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} ascending
ar: عرض {currentItemRange} من أصل {totalItemsCount} المفلتر حسب {assetType}، المصنف حسب {sortName} تصاعديًا

source: Showing {currentItemRange} out of {totalItemsCount}, filtered by {assetType}, sorted by {sortName} descending
ar: عرض {currentItemRange} من أصل {totalItemsCount} المفلتر حسب {assetType}، المصنف حسب {sortName} تنازليًا

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} ascending
ar: عرض {currentItemRange} من أصل {totalItemsCount} المصنف حسب {sortName} تصاعديًا

source: Showing {currentItemRange} out of {totalItemsCount}, sorted by {sortName} descending
ar: عرض {currentItemRange} من أصل {totalItemsCount} المصنف حسب {sortName} تنازليًا

source: {totalItems} total
ar: الإجمالي {totalItems}

source: Removing
ar: يجري الحذف

source: Delete “<%= name %>”?
ar: هل تريد حذف “<%= name %>”؟

source: Deleting a textbook cannot be undone and once deleted any reference to it in your courseware's navigation will also be removed.
ar: لا يمكن التراجع لاحقًا عن عملية حذف الكتاب> وحالما تحذفه، سيجري أيضًا حذف أيٍّ من مراجعه الواردة في صفحاتك لمنهاج المساق.

source: Delete Page Confirmation
ar: تأكيد حذف الصفحة

source: Are you sure you want to delete this page? This action cannot be undone.
ar: هل أنت واثق من أنّك تريد حذف هذه الصفحة؟ لا يمكن التراجع عن هذه العملية لاحقًا.

source: Upload
ar: تحميل

source: We're sorry, there was an error
ar: نأسف لحدوث خطأ.

source: Success! "{displayName}" has been moved.
ar: جرت العملية بنجاح! "{displayName}" تمّ تحريكه.

source: Move cancelled. "{sourceDisplayName}" has been moved back to its original location.
ar: ألغي التحريك. "{sourceDisplayName}" قد تمّ تحريكه إلى موقعه الأصل.

source: Undo move
ar: تراجع عن التحريك

source: Take me to the new location
ar: خذني إلى الموقع الجديد

source: Duplicating
ar: جاري إنشاء نسخة مطابقة

source: Undo moving
ar: تراجع عن التحريك

source: Moving
ar: جاري التحريك

source: Deleting this {xblock_type} is permanent and cannot be undone.
ar: إنّ حذف هذا الـ {xblock_type} دائم ولا يمكن التراجع عنه.

source: Any content that has listed this content as a prerequisite will also have access limitations removed.
ar: ستُحذف أي محدّدات للوصول لأي محتوى كان قد أردج هذا المحتوى كمتطلّب أساسي.

source: Delete this {xblock_type} (and prerequisite)?
ar: هل تودّ حذف {xblock_type} هذه (بالإضافة إلى المتطلّب الأساسي)؟

source: Yes, delete this {xblock_type}
ar: نعم، احذف هذا الـ {xblock_type}

source: Delete this {xblock_type}?
ar: هل تريد حذف هذا الـ {xblock_type}؟

source: section
ar: قسم

source: subsection
ar: قسم فرعي

source: unit
ar: وحدة

source: Your changes have been saved.
ar: حُفِظَت التغييرات التي أجريتها.

source: Please select a file in .srt format.
ar: يُرجى اختيار ملف بصيغة .srt.

source: Error: Uploading failed.
ar: خطأ: فشل التحميل.

source: Error: Import failed.
ar: خطأ: فشل الاستيراد.

source: Error: Replacing failed.
ar: خطأ: فشل الاستبدال.

source: Error: Choosing failed.
ar: خطأ: فشل الاختيار.

source: Error: Connection with server failed.
ar: خطأ: فشل الاتصال بالخادم.

source: Link types should be unique.
ar: يجب أن تكون أنواع الروابط فريدة.

source: Links should be unique.
ar: يجب أن تكون الروابط فريدة.

source: Incorrect url format.
ar: صيغة خاطئة لرابط url.

source: Sorry, there was an error parsing the subtitles that you uploaded. Please check the format and try again.
ar: عذرًا، حدث خطأ في عملية تحليل العناوين الفرعية التي حمّلتها. يُرجى التحقق من الصيغة، ثمّ إعادة المحاولة.

source: Are you sure you want to remove this transcript?
ar: هل أنت واثق من أنّك تريد حذف هذا التفريغ النصي؟

source: If you remove this transcript, the transcript will not be available for this component.
ar: إن حذفت هذا التفريغ، فلن يظهر للمتعلمين في هذا الفيديو.

source: Remove Transcript
ar: إحذف التفريغ النصيّ

source: Upload translation
ar: تحميل الترجمة

source: Editor
ar: محرِّر

source: Settings
ar: الإعدادات

source: New {component_type}
ar: {component_type} جديد

source: Warning
ar: تحذير

source: Error
ar: خطأ

source: Updating with latest library content
ar: يجري التحديث إلى أحدث محتوى للمكتبة

source: Creating missing groups
ar: يجري إنشاء المجموعات الناقصة`

source: {start_strong}{total}{end_strong} words submitted in total.
ar: إجمالي عدد الكلمات التي تم تسليمها {start_strong}{total}{end_strong}.

source: Show Annotations
ar: أظهِر الملاحظات

source: Hide Annotations
ar: اخفِ الملاحظات

source: Expand Instructions
ar: أظهِر التعليمات

source: Collapse Instructions
ar: اخفِ التعليمات

source: Commentary
ar: التعليق

source: Reply to Annotation
ar: الردّ على الملاحظات

source: %(num_points)s point possible (graded, results hidden)
ar: %(num_points)s النقاط المحتملة (صحّحت، أخفيت النتائج)

source: %(num_points)s point possible (ungraded, results hidden)
ar: %(num_points)s النقاط المحتملة (لم تصحّح، أخفيت النتائج)

source: %(num_points)s point possible (graded)
ar: لا توجد أيّ نقطة محتملة (مقيّم)%(num_points)s

source: %(num_points)s point possible (ungraded)
ar: توجد %(num_points)s نقطة محتملة (ليس جزئاً من التقييم)

source: %(earned)s/%(possible)s point (graded)
ar: %(earned)s نقطة (مقيّم) من أصل %(possible)s

source: %(earned)s/%(possible)s point (ungraded)
ar: %(earned)s نقطة (ليس جزئاً من التقييم) من أصل %(possible)s

source: The grading process is still running. Refresh the page to see updates.
ar: ما زالت عملية التقييم جارية. حدِّث الصفحة لترى التحديثات.

source: Could not grade your answer. The submission was aborted.
ar: تعذَّر تصحيح إجابتك. ألغي التصحيح.

source: Submission aborted! Sorry, your browser does not support file uploads. If you can, please use Chrome or Safari which have been verified to support file uploads.
ar: أُلغيَ التصحيح! عُذرًا، فمتصفِّحُك لا يدعم رفع الملفات. استخدِم جوجل كروم أو سَفاري إن امكن، حيث تمّ التحقُّق من إمكانية رفع الملفات في كليهما.

source: You submitted {filename}; only {allowedFiles} are allowed.
ar: لقد قمت بتسليم {filename}؛ يُسمَح فقط بـ{allowedFiles}

source: Your file {filename} is too large (max size: {maxSize}MB).
ar: الملف {filename} يتخطّى الحجم المسموح به (الحدُّ الأقصى لحجم الملف: {maxSize} ميجابايت).

source: You did not submit the required files: {requiredFiles}.
ar: لم تُسلِّم الملفات المطلوبة: {requiredFiles}.

source: You did not select any files to submit.
ar: لم تختَر أيّ ملفات لتسليمها.

source: This problem has been reset.
ar: أعيدَت هذه المسألة إلى وضعها المبدئيّ.

source: unsubmitted
ar: غير مسلَّمة

source: Paragraph
ar: فِقرة

source: Preformatted
ar: مُنسَّق مسبقًا

source: Heading 3
ar: العنوان الرئيسي 3

source: Heading 4
ar: العنوان الرئيسي 4

source: Heading 5
ar: العنوان الرئيسي 5

source: Heading 6
ar: العنوان الرئيسي 6

source: Add to Dictionary
ar: أضف إلى القاموس

source: Align center
ar: محاذاة إلى المنتصف

source: Align left
ar: محاذاة إلى اليسار

source: Align right
ar: محاذاة إلى اليمين

source: Alignment
ar: محاذاة النص

source: Alternative source
ar: مصدر بديل

source: Anchor
ar: نقطة إرساء

source: Anchors
ar: نقاط إرساء

source: Author
ar: الكاتب

source: Background color
ar: لون الخلفية

source: Blockquote
ar: اقتباس

source: Blocks
ar: الوحدات

source: Body
ar: المحتوى

source: Bold
ar: خط عريض

source: Border color
ar: لون الإطار

source: Border
ar: الإطار

source: Bottom
ar: الأسفل

source: Bullet list
ar: قائمة منقّطة

source: Caption
ar: النصّ الوصفيّ

source: Cell padding
ar: إزاحة الخلايا

source: Cell properties
ar: خصائص الخليّة

source: Cell spacing
ar: تباعُد الخلايا

source: Cell type
ar: نوع الخليّة

source: Cell
ar: خليّة

source: Center
ar: الوسط

source: Circle
ar: دائرة

source: Clear formatting
ar: أزِل التنسيقات

source: Code block
ar: كتلة نصوص برمجية

source: Code
ar: نصّ برمجيّ

source: Color
ar: اللون

source: Cols
ar: الأعمدة

source: Column group
ar: مجموعة الأعمدة

source: Column
ar: عمود

source: Constrain proportions
ar: تقييد النسب

source: Copy row
ar: نسخ الصف

source: Copy
ar: نسخ

source: Could not find the specified string.
ar: تعذّر إيجاد النصّ المحدّد.

source: Custom color
ar: لون مخصّص

source: Custom...
ar: مخصّص...

source: Cut row
ar: قصّ الصف

source: Cut
ar: قصّ

source: Decrease indent
ar: إنقاص البادئة

source: Default
ar: الإعداد المبدئي

source: Delete column
ar: حذف العمود

source: Delete row
ar: حذف الصف

source: Delete table
ar: حذف الجدول

source: Description
ar: الوصف

source: Dimensions
ar: الأبعاد

source: Disc
ar: القُرص

source: Div
ar: التقسيم

source: Document properties
ar: خصائص المستند

source: Edit HTML
ar: تحرير HTML

source: Edit
ar: عدِّل

source: Embed
ar: تضمين

source: Emoticons
ar: الوجوه التعبيريّة

source: Encoding
ar: الترميز

source: File
ar: ملف

source: Find and replace
ar: بحث واستبدال

source: Find next
ar: ابحث عن التالي

source: Find previous
ar: ابحث عن السابق

source: Find
ar: ابحث

source: Finish
ar: انهِ

source: Font Family
ar: نوع الخط

source: Font Sizes
ar: أحجام الخط

source: Footer
ar: التذييل

source: Format
ar: التنسيق

source: Formats
ar: التنسيقات

source: Fullscreen
ar: ملء الشاشة

source: General
ar: عام

source: H Align
ar: محاذاة أفقية

source: Header 1
ar: الترويسة 1

source: Header 2
ar: الترويسة 2

source: Header 3
ar: الترويسة 3

source: Header 4
ar: الترويسة 4

source: Header 5
ar: الترويسة 5

source: Header 6
ar: الترويسة 6

source: Header cell
ar: خليّة الترويسة

source: Header
ar: ترويسة

source: Headers
ar: ترويسات

source: Heading 1
ar: العنوان الرئيسي 1

source: Heading 2
ar: العنوان الرئيسي 2

source: Headings
ar: عناوين رئيسية

source: Height
ar: الارتفاع

source: Horizontal line
ar: خط أفقي

source: Horizontal space
ar: مسافة أفقية

source: HTML source code
ar: نصوص HTML مصدريّة

source: Ignore all
ar: تجاهل الكلّ

source: Ignore
ar: تجاهل

source: Image description
ar: وصف الصورة

source: Increase indent
ar: زيادة البادئة

source: Inline
ar: مضمَّن

source: Insert column after
ar: أدرِج عمودًا بعده

source: Insert column before
ar: أدرِج عمودًا قبله

source: Insert date/time
ar: أدرِج التاريخ/الوقت

source: Insert image
ar: أدرِج صورة

source: Insert link
ar: أدرِج رابطًا

source: Insert row after
ar: أدرِج صفًّا بعده

source: Insert row before
ar: أدرِج صفًّا قبله

source: Insert table
ar: أدرِج جدولًا

source: Insert template
ar: أضِف نموذجًا

source: Insert video
ar: أدرِج فيديو

source: Insert
ar: أدخِل

source: Insert/edit image
ar: إدراج/تعديل صورة

source: Insert/edit link
ar: إدخال/تعديل رابط

source: Insert/edit video
ar: إدخال/تعديل فيديو

source: Italic
ar: خط مائل

source: Justify
ar: ضبط الهامشين

source: Keywords
ar: كلمات مفتاحية

source: Left to right
ar: من اليسار إلى اليمين

source: Left
ar: يسارًا

source: Lower Alpha
ar: حرف ألفا صغير

source: Lower Greek
ar: حروف يونانية صغيرة

source: Lower Roman
ar: حروف رومانية صغيرة

source: Match case
ar: مطابقة حالة الأحرف

source: Merge cells
ar: ادمج الخلايا

source: Middle
ar: وسط

source: New document
ar: مستند جديد

source: New window
ar: نافذة جديدة

source: Next
ar: التالي

source: No color
ar: بلا لون

source: Nonbreaking space
ar: مسافة دون بدء سطر جديد

source: Numbered list
ar: قائمة مرقّمة

source: Page break
ar: فاصل صفحات

source: Paste as text
ar: الصق كـنَصّ

source: Paste is now in plain text mode. Contents will now be pasted as plain text until you toggle this option off.
ar: يتم اللصق الآن بوضع "النضً المجرَّد". سيُلضَق المحتوى الآن كنصّ مجرّد من أيّ تنسيق إلى حين إيقاف هذا الخيار.

source: Paste row after
ar: لصق صف بعده

source: Paste row before
ar: لصق صف قبله

source: Paste your embed code below:
ar: الصق رمز التضمين أدناه:

source: Paste
ar: لصق

source: Poster
ar: إعلان

source: Pre
ar: التالي

source: Prev
ar: السابق

source: Preview
ar: معاينة

source: Print
ar: طباعة

source: Redo
ar: إعادة

source: Remove link
ar: أزِل الرابط

source: Replace all
ar: استبدِل الكل

source: Replace with
ar: استبدِل إلى

source: Replace
ar: استبدِل

source: Restore last draft
ar: استعِد آخر مسودَّة

source: Rich Text Area. Press ALT-F9 for menu. Press ALT-F10 for toolbar. Press ALT-0 for help
ar: منطقة نص منسَّق. اضغط ALT-F9 لفتح القائمة. اضغط ALT-F10 لفتح شريط الأدوات. اضغط ALT-0 للحصول على المساعدة.

source: Right to left
ar: من اليمين إلى اليسار

source: Right
ar: يمين

source: Robots
ar: روبوتات

source: Row group
ar: مجموعة الصفوف

source: Row properties
ar: خصائص الصف

source: Row type
ar: نوع الصف

source: Row
ar: صف

source: Rows
ar: صفوف

source: Scope
ar: نطاق العمل

source: Select all
ar: اختيار الكل

source: Show blocks
ar: أظهِر الوحدات

source: Show invisible characters
ar: أظهِر الرموز الخفيّة

source: Source code
ar: المصدر البرمجيّ

source: Source
ar: المصدر

source: Special character
ar: مَحرَف خاص

source: Spellcheck
ar: التدقيق الإملائيّ

source: Split cell
ar: اقسِم الخليّة

source: Square
ar: مربّع

source: Start search
ar: ابدء البحث

source: Strikethrough
ar: اشطب

source: Style
ar: النمط

source: Subscript
ar: نصوص سفليّة

source: Superscript
ar: نصوص عُلويّة

source: Table properties
ar: خصائص الجدول

source: Table
ar: جدول

source: Target
ar: الهدف

source: Templates
ar: نماذج

source: Text color
ar: لون النص

source: Text to display
ar: النص الواجب عرضه

source: The URL you entered seems to be an email address. Do you want to add the required mailto: prefix?
ar: يبدو أنّ الرابط الذي أدخلته هو عنوان بريد إلكتروني، هل تريد إضافة البادئة اللازمة ":mailto"؟

source: The URL you entered seems to be an external link. Do you want to add the required http:// prefix?
ar: يبدو أنّ الرابط الذي أدخلته هو عنوان بريد إلكتروني، هل تريد إضافة البادئة اللازمة "//:http"؟

source: Title
ar: العنوان

source: Tools
ar: الأدوات

source: Top
ar: الأعلى

source: Underline
ar: تسطير

source: Undo
ar: تراجع

source: Upper Alpha
ar: حرف ألفا كبير

source: Upper Roman
ar: حرف روماني كبير

source: Url
ar: العنوان على الإنترنت

source: V Align
ar: محاذاة عمودية

source: Vertical space
ar: مسافة عمودية

source: View
ar: عرض

source: Visual aids
ar: وسائل توضيحيّة

source: Whole words
ar: كلمات كاملة

source: Width
ar: العَرض

source: Words: {0}
ar: الكلمات: {0}

source: You have unsaved changes are you sure you want to navigate away?
ar: هناك تغييرات لم تُحفَظ بعد، هل أنت واثق من رغبتك في الخروج من الصفحة؟

source: Your browser doesn't support direct access to the clipboard. Please use the Ctrl+X/C/V keyboard shortcuts instead.
ar: لا يدعم متصفّحك الوصول المباشر إلى الحافظة. يُرجى استخدام اختصارات لوحة المفاتيح Ctrl+X/C/V بدلًا كبديل.

source: Insert/Edit Image
ar: إدراج/تعديل صورة

source: Click OK to have your username and e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
ar: انقر ’موافق‘ لإرسال اسم المستخدم الذي أدخلته وبريدك الإلكتروني إلى تطبيق جهة خارجيّة. انقر ’إلغاء‘ للعودة إلى هذه الصفحة من دون إرسال معلوماتك.

source: Click OK to have your username sent to a 3rd party application. Click Cancel to return to this page without sending your information.
ar: انقر ’موافق‘ لإرسال اسم المستخدم الذي أدخلته إلى تطبيق جهة خارجيّة. انقر ’إلغاء‘ للعودة إلى هذه الصفحة من دون إرسال معلوماتك.

source: Click OK to have your e-mail address sent to a 3rd party application. Click Cancel to return to this page without sending your information.
ar: انقر ’موافق‘ لإرسال بريدك الإلكتروني الذي أدخلته إلى تطبيق جهة خارجيّة. انقر ’إلغاء‘ للعودة إلى هذه الصفحة من دون إرسال معلوماتك.

source: incorrect
ar: خطأ

source: correct
ar: صواب

source: answer
ar: الإجابة

source: Short explanation
ar: شرح موجَز

source: If you use the Advanced Editor, this problem will be converted to XML and you will not be able to return to the Simple Editor Interface. Proceed to the Advanced Editor and convert this problem to XML?
ar: إذا كنت تستخدِم المحرر المتقدم فسيتم تحويل هذه إلى المسألة إلى صيغة XML، ولن تتمكن من الرجوع إلى واجهة المحرر البسيط. هل ما زلت ترغب بالانتقال إلى وضع التحرير المتقدم وتحويل هذه المسألة إلى XML ؟

source: Explanation
ar: الشرح

source: Sequence error! Cannot navigate to %(tab_name)s in the current SequenceModule. Please contact the course staff.
ar: خطأ في التسلسل! لا يمكن الانتقال إلى %(tab_name)s في وِحدة SequenceModule. نرجو أن تُراسل طاقم المساق.

source: Bookmarked
ar: تمت الإضافة إلى الإشارات المرجعية

source: Play
ar: شغِّل

source: Pause
ar: أوقِف مؤقّتًا

source: Mute
ar: اكتِم

source: Unmute
ar: الغِ الكتم

source: Exit full browser
ar: الخروج من ملء المتصفِّح

source: Fill browser
ar: ملء المتصفّح

source: Speed
ar: السرعة

source: Auto-advance
ar: تصفّح تلقائي

source: Volume
ar: الصوت

source: Muted
ar: مكتوم الصوت

source: Very low
ar: هادئ جدًّا

source: Low
ar: هادئ

source: Average
ar: متوسِّط

source: Loud
ar: صاخب

source: Very loud
ar: صاخِب جدًّا

source: Maximum
ar: الحدّ الأقصى
