Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Studio Administration
ar: إدارة الإستوديو

source: LMS Administration
ar: إدارة LMS

source: Discussion
ar: المناقشة

source: Problem
ar: المسألة

source: Advanced
ar: متقدِّم

source: Entrance Exam
ar: امتحان القبول

source: Section
ar: قسم

source: Subsection
ar: قسمٌ فرعيّ

source: Unit
ar: الوحدة

source: Empty
ar: خالية

source: The following parameters are required: {missing}.
ar: هذه المعطيات مطلوبة:{missing}.

source: A transcript with the "{language_code}" language code already exists.
ar: النص بكود اللغة "{language_code}" موجود مسبقا.

source: A transcript file is required.
ar: ملف نص الفيديو مطلوب

source: There is a problem with this transcript file. Try to upload a different file.
ar: هناك مشكلة في ملف نص الفيديو هذا.حاول تحميل ملف مختلف

source: Name
ar: الاسم

source: Video ID
ar: مُعرِّف الفيدية

source: Status
ar: الحالة

source: Pending
ar: قيد الانتظار

source: Mode
ar: الوضع

source: Verification Deadline
ar: الموعد النهائي للتحقّق

source: OPTIONAL: After this date/time, users will no longer be able to submit photos for verification. This appies ONLY to modes that require verification.
ar: اختياريّ: لن يتمكن المستخدمون من إرسال صور للتوثيق بعد هذا الموعِد. ينطبق هذا حصرًا على الأوضاع التي تتطلّب توثيقًا.

source: Your verification is pending
ar: عملية التحقّق من هويّتك في الانتظار

source: Verified: Pending Verification
ar: مساق موثَّق: عملية التحقق من اسم الطالب في الانتظار

source: ID verification pending
ar: التحقُّق من الهوية قيد الانتظار

source: You're enrolled as a verified student
ar: أنت مسجّل للحصول على شهادة موثّقة

source: Verified
ar: موثَّق

source: ID Verified Ribbon/Badge
ar: وسام التحقق من الهوية

source: You're enrolled as an honor code student
ar: أنت مسجَّل كطالب يلتزم بميثاق الشرف

source: Honor Code
ar: ميثاق الشرف

source: You're enrolled as a professional education student
ar: أنت مسجَّل كطالب تعليم مهني

source: Professional Ed
ar: التعليم المهني

source: Display Name
ar: الاسم الظاهِر

source: Price
ar: الرسوم

source: Upgrade Deadline
ar: حدِّث الموعِد النهائيّ

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
ar: اختياريّ: لن يتمكن المستخدمون من التسجيل بهذا الوضع بعد هذا الموعِد. دَع هذا الخيار فارغًا إذا كان بإمكان الطلاب التسجيل في هذا الوضع إلى حين انتهاء موعِد التسجيل في هذا المساق.

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
ar: اختياري: هذه هي وحدة إدارة المخزون (SKU) الخاصّة بهذا الوضع في الخدمة الخارجية للتجارة الإلكترونية. اترك هذا الحقل فارغًا إذا لم يكن المساق قد نُقِلَ إلى خدمة التجارة الإلكترونية.

source: This is the bulk SKU (stock keeping unit) of this mode in the external ecommerce service.
ar: هذه هي وحدة إدارة المخزون (SKU) الرئيسيّة لهذا الوضع في خدمة التجارة الإلكترونية الخارجية.

source: Honor
ar: فخريّ

source: Professional education modes are not allowed to have expiration_datetime set.
ar: لا يُسمَح بتحديد موعد انتهاء لمساقات التعليم المعنيّ.

source: Verified modes cannot be free.
ar: لا يمكن لمسار الشهادة الموثقة أن يكون مجانياً.

source: Free
ar: مجّانًا

source: The time period before a course ends in which a course mode will expire
ar: المدة الزمنية ما بين انتهاء أحد الأوضاع وانتهاء المساق ككُلّ

source: Congratulations! You are now enrolled in {course_name}
ar: تهانينا! أنت الآن مسجَّل في المساق {course_name}

source: Enrollment is closed
ar: انقضى موعِد الانضمام

source: Enrollment mode not supported
ar: وضع التسجيل غير مدعوم

source: Invalid amount selected.
ar: لقد اخترت مبلغًا غير صحيح

source: No selected price or selected price is too low.
ar: لم يجري اختيار سعر أو أن السعر المختار ضئيل جدًا.

source: Administrator
ar: المدير

source: Moderator
ar: المُشرِف

source: Group Moderator
ar: مشرف المجموعة

source: Community TA
ar: مساعد تدريس متطوّع

source: Student
ar: الطالب

source: User profile
ar: ملف المستخدِم

source: Personal info
ar: المعلومات الشخصية

source: Permissions
ar: الصلاحيات

source: Important dates
ar: تواريخ مهمّة

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
ar: هذا البريد الإلكتروني غير مسجّل لدينا. هل أنت متأكد من أنّك قد أنشأت حسابك باستخدام هذا البريد الإلكترونيّ؟

source: The user account associated with this e-mail address cannot reset the password.
ar: لا يمكن لحساب المستخدم المرتبط بعنوان البريد الإلكتروني هذا تغيير كلمة المرور.

source: Full Name cannot contain the following characters: < >
ar: الرموز < > غير مقبولة في الأسم الكامل

source: A properly formatted e-mail is required
ar: يجب إدخال عنوان بريد إلكتروني مكتوب بطريقة سليمة

source: A valid password is required
ar: يجب إدخال كلمة مرور صالحة

source: Your legal name must be a minimum of two characters long
ar: يجب أن يتكون اسمك القانوني من حرفين على الأقلّ

source: Email cannot be more than %(limit_value)s characters long
ar: لا يمكن أن يزيد عدد حروف البريد الإلكتروني عن %(limit_value)s

source: You must accept the terms of service.
ar: يجب أن تقبل شروط الخدمة.

source: A level of education is required
ar: يجب إدخال المستوى التعليمي

source: Your gender is required
ar: يجب اختيار الجنس

source: Your year of birth is required
ar: يجب إدخال سنة الميلاد

source: Your mailing address is required
ar: يجب إدخال البريد الإلكترونيّ

source: A description of your goals is required
ar: يجب إدخال وصف لأهدافك

source: A city is required
ar: يجب إدخال اسم المدينة

source: A country is required
ar: يجب إدخال اسم البلد

source: To enroll, you must follow the honor code.
ar: للتسجيل، يجب عليك الالتزام بميثاق الشرف.

source: You are missing one or more required fields
ar: ما زال أحدُ الحقول المطلوبة فارغًا أو بعضُها

source: Unauthorized email address.
ar: عنوان بريد إلكتروني غيرُ مصرَّح له.

source: It looks like {email} belongs to an existing account. Try again with a different email address.
ar: يبدو أنّ {email} مسجّل لدينا بالفِعل. حاوِل مرة أخرى باستخدام بريد إلكتروني آخَر.

source: An account with the Public Username '{username}' already exists.
ar: يوجد بالفِعل حساب يحمل الاسم "{username}".

source: An account with the Email '{email}' already exists.
ar: سبق أن سُجّل حساب له البريد الإلكتروني "{email}".

source: Removed group: "{}"
ar: حُذِفَت المجموعة: "{}"

source: Did not find a group with name "{}" - skipping.
ar: تعذَّر العثور على مجموعة تحمل الاسم "{}" - تم تجاهُل الطلَب.

source: Invalid group name: "{group_name}". {messages}
ar: اسم مجموعة غير صالِح: "{group_name}". {messages}

source: Created new group: "{}"
ar: أُنشئَت مجموعة جديدة: "{}"

source: Found existing group: "{}"
ar: عُثِرَ على مجموعة موجودة فِعلًا: "{}"

source: Adding {codenames} permissions to group "{group}"
ar: تجري إضافة صلاحيات {codenames} إلى المجموعة "{group}"

source: Removing {codenames} permissions from group "{group}"
ar: يجري حذفُ صلاحيات {codenames} من المجموعة "{group}"

source: Invalid permission option: "{}". Please specify permissions using the format: app_label:model_name:permission_codename.
ar: خيار صلاحيات غير سليم: "{}". يرجى تحديد أذونات باستخدام النَسَق: app_label:model_name:permission_codename.

source: Invalid permission codename: "{codename}". No such permission exists for the model {module}.{model_name}.
ar: اسم صلاحية غير صالِح: "{codename}". لا توجد صلاحية كهذه للوِحدة {module}.{model_name}.

source: Setting {attribute} for user "{username}" to "{new_value}"
ar: تعيين القيمة "{new_value}" لـ{attribute} للمستخدِم "{username}"

source: Skipping user "{}" because the specified and existing email addresses do not match.
ar: تخطي المستخدم "{}" لأنَّ البريد الإلكتروني المذكور والموجود غير متطابقين.

source: Did not find a user with username "{}" - skipping.
ar: تعذَّر العثور على مستخدم يحمل الاسم "{}" - تخطي.

source: Removing user: "{}"
ar: إزالة المستخدِم: "{}"

source: Created new user: "{}"
ar: أُنشئَ مُستخدِم جديد: "{}"

source: Found existing user: "{}"
ar: عُثِرَ على مستخدِم موجود فِعلًا: "{}"

source: Setting unusable password for user "{}"
ar: تعيين كلمة مرور غير قابلة للاستخدام للمستخدم "{}"

source: Created new profile for user: "{}"
ar: أُنشئ ملف تعريفي جديد للمستخدِم: "{}"

source: Could not find a group named "{}" - skipping.
ar: تعذّر العثور على مجموعة تحمل الاسم "{}" - تخطي.

source: Adding user "{username}" to groups {group_names}
ar: إضافة المستخدم "{username}" إلى المجموعات {group_names}

source: Removing user "{username}" from groups {group_names}
ar: إزالة المستخدم "{username}" من المجموعات {group_names}

source: Your account has been disabled. If you believe this was done in error, please contact us at {support_email}
ar: لقد عُطِّلَ حسابُك. إذا كنت تعتقد حصول ذلك خطأً، فنرجو منك الاتصال بنا على {support_email}

source: Disabled Account
ar: حساب معطَّل

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Prefer Not to Say
ar: أفضّل عدم الإفصاح

source: Doctorate
ar: دكتوراه

source: Master's or professional degree
ar: ماجستير أو شهادة تخصُّصيّة

source: Bachelor's degree
ar: درجة البكالوريوس (ليسانس)

source: Associate degree
ar: درجة زميل/مُشارِك

source: Secondary/high school
ar: شهادة الثانوية العامة

source: Junior secondary/junior high/middle school
ar: المرحلة الإعدادية/المتوسطة

source: Elementary/primary school
ar: المرحلة الابتدائيّة

source: No formal education
ar: بدون درجة علمية

source: Other education
ar: غير ما ذُكِر

source: {platform_name} Honor Code Certificate for {course_name}
ar: شهادة مشاركة في مساق {course_name} من {platform_name}

source: {platform_name} Verified Certificate for {course_name}
ar: شهادة موثقة لمساق {course_name} من {platform_name}

source: {platform_name} Professional Certificate for {course_name}
ar: شهادة مهنيّة لمساق {course_name} من {platform_name}

source: The company identifier for the LinkedIn Add-to-Profile button e.g 0_0dPSPyS070e0HsE9HNz_13_d11_
ar: مُعرِّف الشركة على موقع LinkedIn لزِرّ Add-to-Profile. مثل: 0_0dPSPyS070e0HsE9HNz_13_d11_-

source: Short identifier for the LinkedIn partner used in the tracking code. (Example: 'edx') If no value is provided, tracking codes will not be sent to LinkedIn.
ar: مُعرِّف قصير لشريكنا على LinkedIn، يُستخدَم لرمز التتبع. (مثل: "edX"). إذا لم يتم إدخال أيّ قيمة، فلن تُرسَل رموز التتبُّع إلى LinkedIn.

source: {platform_name} Certificate for {course_name}
ar: شهادة لمساق {course_name} من {platform_name}

source: The ISO 639-1 language code for this language.
ar: رمز ISO 639-1 لهذه اللغة.

source: Namespace of enrollment attribute
ar: نطاق الأسماء لخاصيّة التسجيل

source: Name of the enrollment attribute
ar: اسم خاصيّة التسجيل

source: Value of the enrollment attribute
ar: قيمة خاصيّة التسجيل

source: The window of time after enrolling during which users can be granted a refund, represented in microseconds. The default is 14 days.
ar: الإطار الزمني التالي للتسجيل والذي يُمكن خلاله إعادة المبلغ المدفوع إلى المستخدمين، بالمايكروثانية. الفترة الافتراضية هي 14 يومًا.

source: Name of the UTM cookie
ar: اسم ملف كعكة التتبُّع

source: Name of the affiliate cookie
ar: اسم ملف كعكة الجهة المرتبطة

source: Name of this user attribute.
ar: اسم خاصيّة المستخدِم هذه.

source: Value of this user attribute.
ar: قيمة خاصيّة المستخدِم هذه.

source: and
ar: و

source: Photos are mismatched
ar: لا تتطابق الصور

source: Name missing from ID photo
ar: هوية التعريف تفتقر إلى الاسم

source: ID photo not provided
ar: لم يتم تقديم صورة هوية التعريف

source: ID is invalid
ar: هوية التعريف غير صحيحة

source: Learner photo is blurry
ar: صورة الطالب غير واضحة

source: Name on ID does not match name on account
ar: لا يتطابق الاسم المدرج في هوية التعريف مع الاسم المذكور في الحساب

source: Learner photo not provided
ar: لم يتم تقديم صورة للطالب

source: ID photo is blurry
ar: صورة هوية التعريف غير واضحة

source: Check your {email_start}{email}{email_end} inbox for an account activation link from {platform_name}. If you need help, contact {link_start}{platform_name} Support{link_end}.
ar: تفقد صندوق الوارد لبريدك {email_start}{email}{email_end} لرابط لتفعيل حسابك من {platform_name}. إن احتجت أية مساعدة، يرجى منك التواصل معنا على {link_start}{platform_name} Support{link_end}.

source: The course you are looking for does not start until {date}.
ar: المساق الذي تبحث عنه لمّا يبدأ بعد. سيبدأ هذا المساق في {date}.

source: The course you are looking for is closed for enrollment as of {date}.
ar: لقد أُغلِقَ التسجيل في المساق الذي تبحث عنه بتاريخ {date}.

source: You've successfully logged into your {provider_name} account, but this account isn't linked with an {platform_name} account yet.
ar: لقد دخلت بحساب {provider_name}، ولكن هذا الحساب غير مرتبط بعد بأيّ حساب على {platform_name}.

source: Use your {platform_name} username and password to log into {platform_name} below, and then link your {platform_name} account with {provider_name} from your dashboard.
ar: استخدِم اسم المستخدم وكلمة المرور لحسابك في {platform_name} للدخول، ثم اربط حسابك في {platform_name} بحسابك في {provider_name} من لوحتك التعليمية.

source: If you don't have an {platform_name} account yet, click <strong>Register</strong> at the top of the page.
ar: إذا لم تكن قد أنشأت حساب {platform_name} بعد، انقُر <strong>سجّل الآن</strong> من أعلى الصفحة.

source: There was an error receiving your login information. Please email us.
ar: حدثَ خطأ أثناء تلقّي معلومات دخولك. نرجو أن تُراسلنا.

source: This account has been temporarily locked due to excessive login failures. Try again later.
ar: تم تجميد هذا الحساب مؤقّتًا نتيجة تخطّي العدد المسموح به لمحاولات الدخول. أعد المحاولة لاحقًا.

source: Your password has expired due to password policy on this account. You must reset your password before you can log in again. Please click the "Forgot Password" link on this page to reset your password before logging in again.
ar: انتهت صلاحية كلمة المرور الخاصة بك حسب سياسة كلمة المرور المعتمدة لهذا الحساب. لذا عليك تعيين كلمة مرور جديدة لتتمكّن من الدخول مرّة أخرى. يُرجى النقر على رابط "نسيت كلمة المرور" الموجود في هذه الصفحةلتغيير كلمة المرور قبل محاولة الدخول مرة أخرى.

source: In order to sign in, you need to activate your account.<br /><br />We just sent an activation link to <strong>{email}</strong>. If you do not receive an email, check your spam folders or <a href="{support_url}">contact {platform} Support</a>.
ar: للتسجيل، عليك تفعيل حسابك.<br /><br />لقد أرسلنا رابط تفعيل الحساب إلى <strong>{email}</strong>. إن لم تتلقى رسالةً إلكترونية، يرجى التحقق من ملف الرسائل غير المرغوب بها أو<a href="{support_url}"> تواصل مع فريق دعم {platform} </a>.

source: Too many failed login attempts. Try again later.
ar: لقد تخطيت الحدّ الأقصى لعدد محاولات الدخول. حاول مرة أخرى فيما بعد.

source: Email or password is incorrect.
ar: هناك خطأ في البريد الإلكتروني أو كلمة المرور.

source: No inactive user with this e-mail exists
ar: لا يوجد حساب مُعطَّل له هذا البريد الإلكترونيّ

source: Unable to send reactivation email
ar: تعذَّر إرسال رسالة إعادة تفعيل

source: Superuser creation not allowed
ar: انشاء حساب مستخدم خارق غير مسموح

source: Account modification not allowed.
ar: تعديل الحساب غير مسموح

source: Account creation not allowed.
ar: غير مسموح إنشاء حساب.

source: Course id not specified
ar: لم يُحدَّد مُعرِّف المساق

source: Invalid course id
ar: مُعرِّف المساق غير صالح

source: Course id is invalid
ar: معرِّف المساق غير صالح

source: Could not enroll
ar: تعذَّر التسجيل

source: You are not enrolled in this course
ar: أنت غير ملتحق بهذا المساق

source: Your certificate prevents you from unenrolling from this course
ar: تمنعك شهادتك من إلغاء تسجيلك في هذا المساق

source: Enrollment action is invalid
ar: العمليّة المتعلّقة بالتسجيل غير صالحة

source: Please enter a username
ar: يُرجى إدخال اسم المستخدِم

source: Please choose an option
ar: يُرجى تحديد أحد الخيارات

source: User with username {} does not exist
ar: لا يوجد مستخدِم بالاسم {}

source: Successfully disabled {}'s account
ar: نجح تعطيل حساب {}

source: Successfully reenabled {}'s account
ar: نجحت إعادة تفعيل حساب {}

source: Unexpected account status
ar: حالة حساب غير متوقعة

source: Registration using {provider} has timed out.
ar: نفد وقت التسجيل باستخدام {provider}.

source: An access_token is required when passing value ({}) for provider.
ar: رمز الوصول (access_token) مطلوب عند تمرير القيمة ({}) للمزوِّد.

source: The provided access_token is already associated with another user.
ar: رمز الوصول (access_token) المُدخَل سبق أن رُبِطَ بحساب آخَر.

source: The provided access_token is not valid.
ar: رمز الوصول (access_token) المُدخَل غير صالح.

source: {html_start}Your account could not be activated{html_end}Something went wrong, please <a href="{support_url}">contact support</a> to resolve this issue.
ar: {html_start}لم نتمكّن من تفعيل حسابك{html_end}فقد حدث خطأ ما، يرجى <a href="{support_url}">التواصل مع فريق الدعم</a> لحلّ هذه المشكلة.

source: {html_start}This account has already been activated.{html_end}
ar: {html_start}لقد تمّ تفعيل هذا الحساب مسبقًا.{html_end}

source: {html_start}Success{html_end} You have activated your account.
ar: {html_start}تمّت العملية بنجاح{html_end} تم تفعيل الحساب بنجاح.

source: {html_start}Success! You have activated your account.{html_end}You will now receive email updates and alerts from us related to the courses you are enrolled in. Sign In to continue.
ar: {html_start}تمّت العميلة بنجاح! لقد تمّ تفعيل حسابك بنجاح.{html_end}ستتلقى من الآن وصاعدًا تحديثات وتنبيهات حول المساق الذي التحقت به، وذلك عبر البريد الإلكتروني. قم بتسجيل دخولك للمتابعة.

source: {html_start}Welcome back, your account delete request have been cancelled.{html_end}
ar: {html_start} مرحبًا بك مرة أخرى ، تم إلغاء طلب حذف حسابك. {html_end}

source: Password reset unsuccessful
ar: فشل تغيير كلمة المرور

source: Error in resetting your password.
ar: مشكلة في إعادة ضبط كلمة السر

source: Error in resetting your password. Please try again.
ar: حدث خطأ أثناء تغيير كلمة مرورك. تُرجى إعادة المحاولة.

source: Valid e-mail address required.
ar: يجب إدخال بريد إلكتروني صحيح.

source: Old email is the same as the new email.
ar: البريد الإلكتروني الجديد مطابق للقديم.

source: An account with this e-mail already exists.
ar: سبق أن سُجّل حساب بهذا البريد الإلكتروني.

source: Unable to send email activation link. Please try again later.
ar: تعذَّر إرسال رابط تفعيل في رسالة إلى البريد الإلكتروني. تُرجى إعادة المحاولة فيما بعد.

source: Deleted the selected configuration(s).
ar: الاعدادات المختارة محذوفة

source: Delete the selected configuration
ar: احذف الاعدادات المختارة

source: Unable to connect with the external provider, please try again
ar: لم نتمكن من الاتصال بالمزود الخارجي،حاول مرة اخرى

source: Authentication with {} is currently unavailable.
ar: الاستيثاق باستخدام {} غير متاح حاليًّا.

source: Secondary providers are displayed less prominently, in a separate list of "Institution" login providers.
ar: يظهر مقدِّمو المساقات الثانويّون في مكان أقل بروزًا في قائمة منفصلة لمقدِّمي وسيلة الدخول المعتمِدة على "المؤسسات".

source: The Site that this provider configuration belongs to.
ar: الموقع الذي ينتمي إليه ضبط مقدِّم الخِدمة.

source: If this option is enabled, users that visit a "TPA hinted" URL for this provider (e.g. a URL ending with `?tpa_hint=[provider_name]`) will be forwarded directly to the login URL of the provider instead of being first prompted with a login dialog.
ar: في حال إتاحة هذا الخيار، سيتم تحويل المستخدمين فور زيارتهم لرابط "نظام الطرف الثالث المشار إليه" التابع لهذا المزوّد (على سبيل المثال، رابط ينتهي بصيغة `?tpa_hint=[provider_name]`) إلى رابط تسجيل الدخول الخاصّ بالمزوّد مباشرةً، بدلاً من التنقل عبر الخطوات اللازمة للتسجيل.

source: If this option is enabled, users will not be asked to confirm their details (name, email, etc.) during the registration process. Only select this option for trusted providers that are known to provide accurate user information.
ar: إذا كان هذا الخيار مفعَّلًا، فلن يُطلَب من المستخدمين تأكيد بياناتهم (الاسم، البريد الإلكترونيّ، إلخ) أثناء عملية التسجيل. فعِّل هذا الخيار فقط للمزودين الذي يوثَق بإتاحتهم معلومات دقيقة عن المستخدِمين.

source: If this option is selected, users will not be required to confirm their email, and their account will be activated immediately upon registration.
ar: إذا فعّلت هذا الخيار فلن يُطلَب من المستخدمين تأكيد بريدهم الإلكترونيّ، وسيتمّ تفعيل حسابهم فور تسجيلهم.

source: If this option is selected, users will be sent a welcome email upon registration.
ar: إذا تم اختيار هذا الخيار، ستُرسل رسالة ترحيب الكترونية للمستخدمين عند التسجيل

source: If this option is not selected, users will not be presented with the provider as an option to authenticate with on the login screen, but manual authentication using the correct link is still possible.
ar: إذا لم تفعِّل هذا الخيار، فلن يُعرض على المستخدِم أن يستوثِق باستخدام هذا المزوِّد في صفحة الدخول، ولكن الاستيثاق يدويًّا باستخدام الرابط الصحيح سيبقى ممكنًا.

source: If this option is set, then users logging in using this SSO provider will have their session length limited to no longer than this value. If set to 0 (zero), the session will expire upon the user closing their browser. If left blank, the Django platform session default length will be used.
ar: في حال تحديد هذا الخيار، سيتمتع المستخدمون من مسجّلي الدخول باستخدام مزوّد تسجيل الدخول الأحادي بجلسةٍ لا تتعدى هذا الحدّ. في حال تحديد الخيار 0 (صفر)، ستنتهي الجلسة المسموح بها فور إغلاق المستخدم للمتصفّح المستخدم. في حال ترك الحقل شاغراً، سيتم تطبيق مدة الجلسة الافتراضية المتّبعة في إطار عمل تطبيقات الويب.

source: If this option is selected, users will be directed to the registration page immediately after authenticating with the third party instead of the login page.
ar: في حال تحديد هذا الخيار، سيتم تحويل المستخدمبن إلى صفحة التسجيل بشكلٍ مباشر بعد التحقّق من صلاحيات الطرف الثالث المسجّل، بدلاً من توجيه المستخدم إلى صفحة تسجيل الدخول.

source: Synchronize user profile data received from the identity provider with the edX user account on each SSO login. The user will be notified if the email address associated with their account is changed as a part of this synchronization.
ar: قم بمزامنة بيانات ملف تعريف المستخدم المأخوذة من موفر الهوية مع حساب مستخدم edX على كل تسجيل دخول في خدمة الدخول الموحد SSO. سيتم إعلام المستخدم إذا تم تغيير عنوان البريد الإلكتروني المرتبط بحسابه كجزء من هذه المزامنة.

source: The Site that this SAML configuration belongs to.
ar: الموقع الذي تنتمي إليه إعدادات لغة ترميز التأكيدات الأمنيّة (SAML).

source: {platform_name} Support
ar: دعم {platform_name}

source: Please wait
ar: يرجى الانتظار

source: LONG_DATE_FORMAT
ar: %A %-d/%-m/%Y

source: DATE_TIME_FORMAT
ar: %A %-d/%-m/%Y الساعة %I:%M %p

source: SHORT_DATE_FORMAT
ar: %-d/%-m/%Y

source: TIME_FORMAT
ar: %I:%M %p"

# am/pm indicator
source: AM
ar: صباحًا

# am/pm indicator
source: PM
ar: مساءً

# weekday name
source: Monday
ar: الإثنين

# weekday name
source: Tuesday
ar: الثلاثاء

# weekday name
source: Wednesday
ar: الأربعاء

# weekday name
source: Thursday
ar: الخميس

# weekday name
source: Friday
ar: الجمعة

# weekday name
source: Saturday
ar: السبت

# weekday name
source: Sunday
ar: الأحد

# abbreviated weekday name
source: Mon
ar: الإثنين

# abbreviated weekday name
source: Tue
ar: الثلاثاء

# abbreviated weekday name
source: Thu
ar: الخميس

# abbreviated weekday name
source: Fri
ar: الجمعة

# abbreviated weekday name
source: Sat
ar: السبت

# abbreviated weekday name
source: Sun
ar: الأحد

# abbreviated month name
source: Jan
ar: يناير

# abbreviated month name
source: Feb
ar: فبراير

# abbreviated month name
source: Mar
ar: مارس

# abbreviated month name
source: Apr
ar: أبريل

# abbreviated month name
source: May
ar: مايو

# abbreviated month name
source: Jun
ar: يونيو

# abbreviated month name
source: Jul
ar: يوليو

# abbreviated month name
source: Aug
ar: أغسطس

# abbreviated month name
source: Sep
ar: سبتمبر

# abbreviated month name
source: Oct
ar: أكتوبر

# abbreviated month name
source: Nov
ar: نوفمبر
