Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: This browser cannot play .mp4, .ogg, or .webm files.
ar: لا يمكن لهذا المتصفّح تشغيل ملفّات .mp4 أو .ogg أو .webm.

source: Try using a different browser, such as Google Chrome.
ar: حاول استخدام متصفّح آخر، مثل جوجل كروم.

source: High Definition
ar: دقّة عالية

source: off
ar: غير مفعّل

source: on
ar: مفعّل

source: Video position. Press space to toggle playback
ar: وضع الفيديو. اضغط على مسافة لتبديل التشغيل

source: Video ended
ar: انتهى الفيديو

source: Video position
ar: موضع الفيديو

source: %(value)s hour
ar: %(value)s ساعة

source: %(value)s minute
ar: %(value)s دقيقة

source: %(value)s second
ar: %(value)s ثانية

source: Click on this button to mute or unmute this video or press UP or DOWN buttons to increase or decrease volume level.
ar: انقر على هذا الزر من لكتم أو إلغاء كتم الفيديو، أو اضغط زر السهم لأعلى من لوحة المفاتيح لرفع مستوى الصوت أو زر السهم لأسفل لخفضه.

source: Adjust video volume
ar: ضبط مستوى صوت الفيديو

source: Press UP to enter the speed menu then use the UP and DOWN arrow keys to navigate the different speeds, then press ENTER to change to the selected speed.
ar: اضغط على زر السهم لأعلى للدخول إلى قائمة ضبط السرعة ومن ثم استخدام زريّ الأسهم "أعلى" و"أسفل" للتنقًّل بين السرعات المختلفة، ثم اضغط زر لاعتماد السرعة المختارة.

source: Adjust video speed
ar: ضبط سرعة الفيديو

source: Video speed:
ar: سرعة الفيديو:

source: Skip
ar: تخطّي

source: Play video
ar: شغِّل الفيديو

source: Do not show again
ar: لا تُظهِر هذا مرّة أخرى

source: Open language menu
ar: افتح قائمة اللغات

source: Transcript will be displayed when you start playing the video.
ar: سيظهر التفريغ النصيّ عند بدء تشغيل الفيديو.

source: Activating a link in this group will skip to the corresponding point in the video.
ar: سيؤدّي النقر على رابط في هذه المجموعة إلى الانتقال إلى النقطة الزمنية المرتبطة به في الفيديو.

source: Video transcript
ar: التفريغ النصيّ للفيديو

source: Start of transcript. Skip to the end.
ar: بداية التفريغ النصيّ. تخطَّ إلى النهاية.

source: End of transcript. Skip to the start.
ar: نهاية التفريغ النصيّ. تخطَّ إلى البداية.

source: Press the UP arrow key to enter the language menu then use UP and DOWN arrow keys to navigate language options. Press ENTER to change to the selected language.
ar: اضغط زر السهر لأعلى للدخول إلى قائمة ضبط اللغة ومن ثم استخدام زريّ الأسهم "أعلى" و"أسفل" للتنقُّل بين خيارات اللغات المختلفة، ثم اضغط زر الإدخال لاعتماد اللغة المختارة.

source: Hide closed captions
ar: اخفِ النصوص المُرفقة

source: (Caption will be displayed when you start playing the video.)
ar: (ستظهر النصوص المرفقة بالفيديو عندما تُشغِّله.)

source: Turn on closed captioning
ar: أظهِر النصوص المرفقة

source: Turn on transcripts
ar: أظهِر التفريغ النصيّ

source: Turn off transcripts
ar: اخفِ التفريغ النصيّ

source: Thank you for setting your course goal to {goal}!
ar: شكرا لك على مشاركتنا بهدفك "{goal}" في هذا المساق!

source: There was an error in setting your goal, please reload the page and try again.
ar: حدث خطأ أثناء تعيين الهدف، يرجى إعادة فتح الصفحة ثم إعادة المحاولة.

source: You have successfully updated your goal.
ar: لقد نجحت في تحديث هدفك.

source: There was an error updating your goal.
ar: حدث خطأ أثناء تحديث هدفك.

source: Expand All
ar: تكبير جميع الأقسام

source: Collapse All
ar: إخفاء الكُل

source: (Self-paced) Starts {start}
ar: (مساق دائم) يبدأ بتاريخ {start}

source: (Self-paced) Started {start}
ar: (مساق دائم) بدأ بتاريخ {start}

source: (Self-paced) Ends {end}
ar: (مساق دائم) ينتهي بتاريخ {end}

source: (Self-paced) Ended {end}
ar: (مساق دائم) إنتهى بتاريخ {end}

source: Starts {start}
ar: ابدأ {start}

source: Started {start}
ar: بدأ {start}

source: Ends {end}
ar: ينتهي {end}

source: You must select a session to access the course.
ar: يجب ان تختار جلسة للوصول الى محتويات المساق

source: There was an error. Please reload the page and try again.
ar: حدث خطأ، يرجى إعادة تحميل الصفحة ثم المحاولة.

source: Change Session
ar: تغيير الجلسة

source: Select Session
ar: اختر جلسة

source: Leave Current Session
ar: مغادرة الجلسة الحالية

source: Are you sure you want to select this session?
ar: هل أنت واثق من أنّك تريد اختيار هذه الجلسة؟

source: Are you sure you want to change to a different session?
ar: هل أنت واثق من أنّك تريد اختيار جلسة أخرى؟

source: Any course progress or grades from your current session will be lost.
ar: سيتم خسارة أي تحصيل دراسي أو درجات من جلستك الحالية.

source: Are you sure that you want to leave this session?
ar: هل أنت متأكد أنك تريد مغادرة هذه الجلسة؟

source: Your unenrollment request could not be processed. Please try again later.
ar: تعذرت معالجة طلب إلغاء التسجيل. الرجاء معاودة المحاولة في وقت لاحق.

source: Are you sure you want to unenroll from {courseName} ({courseNumber})? You will be refunded the amount you paid.
ar: هل انت متاكد أنك تريد إلغاء التسجيل من {courseName} ({courseNumber}) ؟ سيتم رد المبلغ الذي دفعته.

source: Reset Your Password
ar: تغيير كلمة المرور

source: Enter and confirm your new password.
ar: ادخل وأكد كلمة مرور حسابك الجديدة

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: أكِّد كلمة المرور

source: Passwords do not match.
ar: كلمات المرور غير متطابقة.

source: Reset My Password
ar: أعد ضبط كلمة سرِّ حسابي

source: Error:
ar: خطأ:

source: {type} Progress
ar: {type} تقدّم

source: Earned Certificates
ar: الشهادات المكتسبة

source: Enrolled
ar: ملتحق

source: Please fix the following errors:
ar: يرجى تصحيح الأخطاء التالية:

source: Files that you upload must be smaller than 5MB in size.
ar: يجب أن يكون حجم الملفات المرفوعة أقل من 5 ميغابايت.

source: Files that you upload must be PDFs or image files in .gif, .jpg, .jpeg, or .png format.
ar: يجب أن تكون الملفات التي تحمّلها بصيغة PDF أو ملفات صور بصيغ .gif أو .jpg أو .jpeg أو .png.

source: Something went wrong. Please try again later.
ar: هناك خطأ ما. الرجاء معاودة المحاولة في وقت لاحق.

source: Add Attachment
ar: إضافة مرفق

source: (Optional)
ar: (اختياري)

source: Remove file
ar: إزالة ملف

source: Course Name
ar: اسم المساق

source: Not specific to a course
ar: غير متعلق بمساق محدد

source: What can we help you with, {username}?
ar: كيف يمكننا مساعدتك، {username}؟

source: Subject
ar: الموضوع

source: Details
ar: التفاصيل

source: The more you tell us, the more quickly and helpfully we can respond!
ar: كلما أعطيتنا تفاصيل أكثر، سيكون بإمكاننا مساعدتك بسرعة وبالشكل المناسب!

source: Submit
ar: تقديم

source: Sign in to {platform} so we can help you better.
ar: سجّل الدخول إلى {platform} حتى نتمكن من مساعدتك بشكل أفضل.

source: Sign in
ar: تسجيل الدخول

source: Create an {platform} account
ar: قم بإنشاء حساب {platform}

source: If you are unable to access your account contact us via email using {email}.
ar: إذا لم تتمكن من الوصول إلى حسابك ، يرجى التواصل معنا عبر البريد الإلكتروني على {email}.

source: Select a course or select "Not specific to a course" for your support request.
ar: اختر مساق أو اختر "غير متعلق بمساق محدد" لطلب المساعدة.

source: Enter a subject for your support request.
ar: أدخل موضوع طلب الدعم الخاص بك.

source: Enter some details for your support request.
ar: أدخل بعض التفاصيل لطلب الدعم الخاص بك.

source: Contact Us
ar: اتصل بنا

source: Find answers to the top questions asked by learners.
ar: ابحث عن إجابات أكثر الأسئلة التي طرحها المتعلمون.

source: Search the {platform} Help Center
ar: ابحث في مركز مساعدة {platform}

source: Go to my Dashboard
ar: اذهب إلى "لوحتي التعليمية"

source: Go to {platform} Home
ar: اذهب الى صفحة {platform} الرئيسيّة

source: Thank you for submitting a request! We will contact you within 24 hours.
ar: شكرا لتقديم الطلب! سوف نتواصل معك في غضون 24 ساعة.

source: Cancel upload
ar: إلغاء التحميل

source: You may also lose access to verified certificates and other program credentials like MicroMasters certificates. If you want to make a copy of these for your records before proceeding with deletion, follow the instructions for {htmlStart}printing or downloading a certificate{htmlEnd}.
ar: قد تفقد أيضًا الوصول إلى الشهادات الموثّقة وبيانات اعتماد البرنامج الأخرى مثل شهادات التخصصات. إذا كنت ترغب بعمل نسخة من السجلات الخاصة بك قبل متابعة الحذف ، قم باتّباع الإرشادات الخاصة بـ {htmlStart} طباعة أو تنزيل شهادة {htmlEnd}.

source: Before proceeding, please {htmlStart}unlink all social media accounts{htmlEnd}.
ar: قبل المتابعة ، يرجى {htmlStart} إلغاء ربط جميع حسابات وسائل التواصل الاجتماعي {htmlEnd}.

source: Before proceeding, please {htmlStart}activate your account{htmlEnd}.
ar: قبل المتابعة ، يرجى {htmlStart} تفعيل حسابك {htmlEnd}.

source: We’re sorry to see you go!
ar: يؤسفنا ان نراك تغادر!

source: Please note: Deletion of your account and personal data is permanent and cannot be undone. EdX will not be able to recover your account or the data that is deleted.
ar: يرجى الملاحظة: حذف حسابك وبياناتك الشخصية دائم ولا يمكن التراجع عنه. لن تتمكن منصة ادراك من استعادة حسابك أو البيانات التي تم حذفها.

source: Once your account is deleted, you cannot use it to take courses on the edX app, edx.org, or any other site hosted by edX. This includes access to edx.org from your employer’s or university’s system and access to private sites offered by MIT Open Learning, Wharton Executive Education, and Harvard Medical School.
ar: بمجرد حذف حسابك ، لن تتمكن من استخدامه لأخذ دورات تدريبية على تطبيقات Edraak أو Edraak.org أو أي موقع آخر تستضيفه Edraak.

source: Delete My Account
ar: حذف حسابي

source: Password is incorrect
ar: كلمة المرور غير صحيحة

source: Unable to delete account
ar: تعذّر حذف الحساب

source: Please re-enter your password.
ar: يرجى إعادة إدخال كلمة المرور.

source: Sorry, there was an error trying to process your request. Please try again later.
ar: عذرًا ، حدث خطأ أثناء محاولة معالجة طلبك. الرجاء معاودة المحاولة في وقت لاحق.

source: A Password is required
ar: كلمة المرور مطلوبة

source: You have selected “Delete my account.” Deletion of your account and personal data is permanent and cannot be undone. EdX will not be able to recover your account or the data that is deleted.
ar: لقد اخترت "حذف حسابي". حذف الحساب والبيانات الشخصية نهائي ولا يمكن التراجع عنه. لن تتمكن إدراك من استعادة حسابك أو البيانات التي تم حذفها.

source: If you proceed, you will be unable to use this account to take courses on the edX app, edx.org, or any other site hosted by edX. This includes access to edx.org from your employer’s or university’s system and access to private sites offered by MIT Open Learning, Wharton Executive Education, and Harvard Medical School.
ar: إذا تابعت، لن تتمكن من استخدام حسابك لأخذ مساقات على تطبيقات Edraak أو Edraak.org أو أي موقع آخر تستضيفه Edraak.

source: If you still wish to continue and delete your account, please enter your account password:
ar: إذا كنت لا تزال ترغب في المتابعة وحذف حسابك، فيرجى إدخال كلمة مرور حسابك:

source: Yes, Delete
ar: نعم احذف

source: We're sorry to see you go! Your account will be deleted shortly.
ar: ناسف أن نراك تغادر المنصة! سيتم حذف حسابك في أقرب وقت.

source: Account deletion, including removal from email lists, may take a few weeks to fully process through our system. If you want to opt-out of emails before then, please unsubscribe from the footer of any email.
ar: قد يستغرق حذف الحساب - بما في ذلك الإزالة من قوائم البريد الإلكتروني - بضعة أسابيع للمعالجة الكاملة من خلال نظامنا. إذا كنت ترغب في إلغاء الاشتراك في رسائل البريد الإلكتروني قبل ذلك، الرجاء إلغاء الاشتراك من تذييل أي بريد إلكتروني.

source: Unable to determine whether we should give you a refund because of System Error. Please try again later.
ar: تعذر تحديد ما إذا كان يجب رد الأموال بسبب خطأ في النظام. الرجاء معاودة المحاولة في وقت لاحق.

source: An error has occurred. Please try again.
ar: حدث خطأ. تُرجى إعادة المحاولة.

source: Bookmark this page
ar: أضف هذه الصفحة إلى علامات المتصفِّح

source: Required field.
ar: حقل مطلوب.

source: Please do not use any spaces in this field.
ar: يُرجى عدم إدخال أي مسافات في هذا الحقل.

source: Please do not use any spaces or special characters in this field.
ar: يُرجى عدم إدخال أي مسافات أو محارِف خاصة في هذا الحقل.

source: Pagination
ar: ترقيم الصفحات

source: Your request could not be completed. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
ar: تعذَّر تنفيذ طلبك. أعد تحميل الصفحة ثم حاول مرة أخرى. إذا استمرَّت المشكلة، انقر على "مساعدة" للإبلاغ عن المشكلة.

source: Showing {firstIndex} out of {numItems} total
ar: يُعرض {firstIndex} من أصل {numItems}.

source: Showing {firstIndex}-{lastIndex} out of {numItems} total
ar: يُعرض {firstIndex}-{lastIndex} من أصل {numItems}.

source: Loading content
ar: يجري تحميل المحتوى

source: Your request could not be processed. Refresh the page and try again.
ar: تعذرت معالجة طلبك. حدِّث الصفحة وأعِد المحاولة.

source: Some images in this post have been omitted
ar: أُزيلَت بعض الصور من هذا المنشور

source: image omitted
ar: أُزيلت الصورَة

source: there is currently {numVotes} vote
ar: لا توجَد أصوات

source: {numVotes} Vote
ar: لا أصوات

source: You could not be subscribed to this post. Refresh the page and try again.
ar: تعذَّر اشتراكُك في هذا المنشور. حدِّث الصفحة وأعِد المحاولة.

source: You could not be unsubscribed from this post. Refresh the page and try again.
ar: تعذَّر إلغاء اشتراكك في هذا المنشور. حدِّث الصفحة وأعِد المحاولة.

source: This response could not be marked as an answer. Refresh the page and try again.
ar: تعذَّر تحديد هذا الردّ على أنه إجابة. حدِّث الصفحة وأعِد المحاولة.

source: This response could not be unmarked as an answer. Refresh the page and try again.
ar: تعذَّر إلغاء تحديد هذا الردّ على أنه إجابة. حدِّث الصفحة وأعِد المحاولة.

source: This response could not be marked as endorsed. Refresh the page and try again.
ar: تعذَّر تأييد هذا الردّ. حدِّث الصفحة وأعِد المحاولة.

source: This response could not be unendorsed. Refresh the page and try again.
ar: تعذَّر إلغاء تأييد هذا الردّ. حدِّث الصفحة وأعِد المحاولة.

source: This vote could not be processed. Refresh the page and try again.
ar: تعذرت معالجة هذا التصويت. حدِّث الصفحة وأعِد المحاولة.

source: This post could not be pinned. Refresh the page and try again.
ar: تعذَّر تثبيت هذا الموضوع. حدِّث الصفحة وأعِد المحاولة.

source: This post could not be unpinned. Refresh the page and try again.
ar: تعذَّر إلغاء تثبيت هذا الموضوع. حدِّث الصفحة وأعِد المحاولة.

source: This post could not be flagged for abuse. Refresh the page and try again.
ar: تعذَّر التبليغ عن إساءة في هذا الموضوع. حدِّث الصفحة وأعِد المحاولة.

source: This post could not be unflagged for abuse. Refresh the page and try again.
ar: تعذَّر إلغاء التبليغ عن إساءة في هذا الموضوع. حدِّث الصفحة وأعِد المحاولة.

source: This post could not be closed. Refresh the page and try again.
ar: تعذَّر إغلاق هذا الموضوع. حدِّث الصفحة وأعِد المحاولة.

source: This post could not be reopened. Refresh the page and try again.
ar: تعذَّرت إعادة فتح هذا الموضوع. حدِّث الصفحة وأعِد المحاولة.

source: Hide Discussion
ar: اخفِ المناقشة

source: This discussion could not be loaded. Refresh the page and try again.
ar: تعذَّر تحميل هذه المناقشة. حدِّث الصفحة وأعِد المحاولة.

source: Show Discussion
ar: أظهِر المناقشة

source: There are no posts in this topic yet.
ar: لا توجد مشاركات في هذا الموضوع حتى الآن.

source: Loading more threads
ar: يجري تحميل المزيد من المواضيع

source: Additional posts could not be loaded. Refresh the page and try again.
ar: تعذَّر تحميل مواضيع إضافيّة. حدِّث الصفحة وأعِد المحاولة.

source: Current conversation
ar: المحادثة الحالية

source: Loading posts list
ar: يجري تحميل قائمة المشاركات

source: No results found for {original_query}. Showing results for {suggested_query}.
ar: لم يُعثَر على نتائج لـ {original_query}. تظهر النتائج لـ {suggested_query}.

source: No posts matched your query.
ar: لا توجد مواضيع مطابقة للبحث.

source: Show posts by {username}.
ar: اعرض منشوراتِ حسب {username}.

source: The post you selected has been deleted.
ar: حُذِفَ المنشور الذي قمت بتحديده.

source: Responses could not be loaded. Refresh the page and try again.
ar: تعذر تحميل الردود. حدِّث الصفحة وأعِد المحاولة.

source: Additional responses could not be loaded. Refresh the page and try again.
ar: تعذر تحميل ردود إضافية. حدِّث الصفحة وأعِد المحاولة.

source: {numResponses} other response
ar: لا توجد ردود أخرى

source: {numResponses} response
ar: لا ردود

source: Showing all responses
ar: تظهر كلّ الردود

source: Showing first response
ar: لا يظهر أيّ ردّ

source: Load all responses
ar: حمِّل كلّ الردود

source: Load next {numResponses} responses
ar: حمِّل الردود الـ{numResponses} التالية

source: Are you sure you want to delete this post?
ar: هل أنت واثق من أنّك تريد حذف هذا الموضوع؟

source: Your post will be discarded.
ar: سوف يُلغى موضوعك.

source: anonymous
ar: مجهول

source: Are you sure you want to delete this comment?
ar: هل أنت واثق من أنّك تريد حذف هذا التعليق؟

source: This comment could not be deleted. Refresh the page and try again.
ar: تعذر حذف هذا التعليق. حدِّث الصفحة وأعِد المحاولة.

source: Are you sure you want to delete this response?
ar: هل أنت واثق من أنّك تريد حذف هذا الرد؟

source: The email address you've provided isn't formatted correctly.
ar: صيغة عنوان البريد الإلكتروني الذي كتبته غير صحيحة.

source: %(field)s must have at least %(count)d characters.
ar: يجب على حقل %(field)s أن يحوي %(count)d من المحارِف على الأقل.

source: %(field)s can only contain up to %(count)d characters.
ar: يجب ألا يتجاوز عدد محارف %(field)s الـ %(count)d.

source: Please enter your %(field)s.
ar: يُرجى إدخال بيانات %(field)s.

source: Drop target image
ar: إسقاط الصورة المطلوبة

source: dragging out of slider
ar: السحب خارج شريط التمرير

source: dragging
ar: السحب

source: dropped in slider
ar: أُسقِطَت في شريط التمرير

source: dropped on target
ar: أسقطت على الهدف

source: %s ago
ar: منذ %s

source: %s from now
ar: بعد %s

source: less than a minute
ar: أقلّ من دقيقة

source: about a minute
ar: حوالي دقيقة

source: %d minute
ar: %d دقيقة

source: about an hour
ar: حوالي ساعة

source: about %d hour
ar: حوالي %d ساعة

source: a day
ar: يوم واحد

source: %d day
ar: %d يوم

source: about a month
ar: حوالي شهر

source: %d month
ar: %d شهر

source: about a year
ar: حوالي عام

source: %d year
ar: %d عام

source: User
ar: المستخدم

source: Annotation
ar: الملاحظات

source: Start
ar: البداية

source: End
ar: النهاية

source: #Replies
ar: #الردود

source: Date posted
ar: تاريخ النشر

source: More
ar: المزيد

source: My Notes
ar: ملاحظاتي

source: Instructor
ar: المدرِّس

source: Public
ar: عامّ

source: Search
ar: بحث

source: Users
ar: المستخدمون

source: Tags
ar: الإشارات

source: Annotation Text
ar: نصّ الملاحظات

source: Clear
ar: امسَح

source: Text
ar: نصّ

source: Video
ar: فيديو

source: Image
ar: صورة

source: Reply
ar: الرد

source: Tags:
ar: الإشارات:

source: Check the box to remove all flags.
ar: فعِّل الخيار لإزالة كلّ التبليغات.

source: Check the box to remove %(totalFlags)s flag.
ar: فعِّل الخيار لإزالة %(totalFlags)s تبليغ.

source: Check the box to remove %(count)s flag.
ar: فعِّل الخيار لإزالة %(count)s تبليغ.

source: All flags have been removed. To undo, uncheck the box.
ar: لقد أُزيلت جميع التبليغات. للتراجع، أزل إشارة صَح الموجودة في مربّع الاختيار.

source: You have already reported this annotation.
ar: لقد بلّغت عن هذه الملاحظة من قبل.

source: Report annotation as inappropriate or offensive.
ar: التبليغ عن الملاحظة على أنّها مسيئة أو غير مناسبة.

source: This annotation has %(count)s flag.
ar: لهذه الملاحظة %(count)s تبليغ.

source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقًّع. تُرجى إعادة المحاولة.

source: Financial Assistance
ar: الدعم الماليّ

source: Upset Learner
ar: متعلّم غير راضي

source: Teaching Assistant
ar: مساعد تدريس

source: Please specify a reason.
ar: يُرجى تحديد سبب

source: Something went wrong changing this enrollment. Please try again.
ar: حدث خطأ عند تغيير عملية التسجيل هذه. تُرجى إعادة المحاولة.

source: last activity
ar: النشاط الأخير

source: open slots
ar: الشواغر المتاحة

source: name
ar: الاسم

source: team count
ar: عدد أعضاء الفريق

source: Teams
ar: الفرق

source: Create
ar: أنشئ

source: Update
ar: تحديث

source: Team Name (Required) *
ar: اسم الفريق (مطلوب)*

source: A name that identifies your team (maximum 255 characters).
ar: اسم يعرّف بفريقك (255 حرفًا على الأكثر).

source: Team Description (Required) *
ar: وصف تعريفي بالفريق (مطلوب)*

source: A short description of the team to help other learners understand the goals or direction of the team (maximum 300 characters).
ar: وصف قصير للفريق لمساعدة المتعلمين الآخرين على فهم أهدافه أو توجّهه (300 حرفًا على الأكثر).

source: Language
ar: اللغة

source: The language that team members primarily use to communicate with each other.
ar: اللغة الرئيسية التي يعتمدها أفراد الفريق بشكل أساسي للتواصل فيما بينهم.

source: Country
ar: البلد

source: The country that team members primarily identify with.
ar: البلد الذي يعتمده أعضاء الفريق بشكل أساسي للتعريف بأنفسهم.

source: An error occurred. Please try again.
ar: حدث خطأ. تُرجى إعادة المحاولة.

source: Check the highlighted fields below and try again.
ar: تأكَّد من الحقول الموضَّحة ثم أعِد المحاولة.

source: Enter team name.
ar: أدخل اسم الفريق.

source: Team name cannot have more than 255 characters.
ar: يجب ألا يتجاوز اسم الفريق 255 حرفًا.

source: Enter team description.
ar: أدخل وصفًا تعريفيًا للفريق.

source: Team description cannot have more than 300 characters.
ar: يجب ألا يتجاوز اسم الفريق 300 حرفًا.

source: An error occurred while removing the member from the team. Try again.
ar: حدث خطأ أثناء استبعاد العضو من الفريق. حاول مرة أخرى.

source: This team does not have any members.
ar: لا يضم الفريق أيّ أعضاء.

source: Joined %(date)s
ar: انضم بتاريخ %(date)s

source: Last Activity %(date)s
ar: النشاط الأخير بتاريخ %(date)s

source: Remove this team member?
ar: أتريد استبعاد هذا العضو من الفريق؟

source: This learner will be removed from the team, allowing another learner to take the available spot.
ar: سيُستبعَد هذا المتعلّم من الفريق، مما سيفسح المجال لمتعلّم الآخر ليأخذ مكانه.

source: Delete this team?
ar: أتريد حذف هذا الفريق؟

source: Deleting a team is permanent and cannot be undone. All members are removed from the team, and team discussions can no longer be accessed.
ar: إنَّ حذف الفريق سيكون نهائيًّا ولا يمكن التراجع عنه. سيُستبعد بذلك جميع أعضاء الفريق ولن يكون بالإمكان الوصول إلى مناقشات أعضاء الفريق في المستقبل.

source: Team "{team}" successfully deleted.
ar: تمّ حذف الفريق "{team}" بنجاح.

source: You are not currently a member of any team.
ar: أنت لست عضوًا في أي فريق في الوقت الحالي.

source: and others
ar: وآخرين

source: Last activity %(date)s
ar: النشاط الأخير بتاريخ %(date)s

source: View %(span_start)s %(team_name)s %(span_end)s
ar: اعرِض %(span_start)s %(team_name)s %(span_end)s

source: An error occurred. Try again.
ar: حدث خطأ. حاول مرة أخرى.

source: Leave this team?
ar: أترغب في ترك هذا الفريق؟

source: If you leave, you can no longer post in this team's discussions. Your place will be available to another learner.
ar: في حال اخترت ترك الفريق، فلن تتمكّن مستقبلًا من المشاركة في نقاشات أعضائه.سيكون مكانك متاحًا لمتعلّم آخَر ليحلّ محلّك.

source: Confirm
ar: تأكيد

source: You already belong to another team.
ar: أنت منتمٍ إلى فريق آخر.

source: This team is full.
ar: هذا الفريق مكتمل

source: %(memberCount)s / %(maxMemberCount)s Member
ar: %(memberCount)s عضو من عدد أقصاه %(maxMemberCount)s

source: All teams
ar: جميع الفرق

source: Teams Pagination
ar: ترقيم صفحات الفِرق

source: Topics
ar: المواضيع

source: See all teams in your course, organized by topic. Join a team to collaborate with other learners who are interested in the same topic as you are.
ar: ألقِ نظرة على كلّ الفرق في مساقك، مرتّبةً حسب الموضوع. وانضم إلى أحدها للتعاون مع المتعلّمين الآخرين المهتمّين بالمجال نفسه مثلك.

source: My Team
ar: فريقي

source: Browse
ar: تصفّح

source: Your request could not be completed. Reload the page and try again.
ar: تعذَّر تنفيذ طلبك. أعِد تحميل الصفحة ثم أعِد المحاولة.
