Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

# abbreviated month name
source: Dec
ar: ديسمبر

# month name
source: January
ar: يناير

# month name
source: February
ar: فبراير

# month name
source: March
ar: مارس

# month name
source: April
ar: أبريل

# month name
source: May
ar: مايو

# month name
source: June
ar: يونيو

# month name
source: July
ar: يوليو

# month name
source: August
ar: أغسطس

# month name
source: September
ar: سبتمبر

# month name
source: October
ar: أكتوبر

# month name
source: November
ar: نوفمبر

# month name
source: December
ar: ديسمبر

source: The file must end with the extension '{file_types}'.
ar: يجب أن ينتهي الملف بالامتداد "{file_types}".

source: Maximum upload file size is {file_size} bytes.
ar: الحدّ الأقصى لحجم الملفّ المسموح برفعه هو {file_size} بايت.

source: Course {course_id} requires {prerequisite_course_id}
ar: يتطلّب التسجيل في المساق {course_id} إنهاء المتطلَّب السابق له {prerequisite_course_id}

source: System defined milestone
ar: إنجاز مهمّ يحدّده النظام

source: {num} letter
ar: {num} حرف

source: {num} uppercase letter
ar: {num} حرف كبير

source: {num} lowercase letter
ar: {num} حرف صغير

source: {num} digit
ar: {num} رقم

source: {num} number
ar: {num} رقم

source: {num} punctuation mark
ar: {num} علامة ترقيم

source: {num} symbol
ar: {num} رمز

source: {num} word
ar: {num} كلمة

source: Your password must contain at least {num} character.
ar: يجب عليك ادخال {num} حرف على الأقل لكلمة السر

source: Your password must contain at least {num} character, including {requirements}.
ar: يجب عليك ادخال {num} حرف على الأقل لكلمة السر بالاضافة ل {requirements}.

source: Invalid password.
ar: كلمة السر غير صحيحة.

source: Enter a password with at least {requirements}.
ar: يجب ان تحتوي كلمة السر على {requirements}.

source: You are re-using a password that you have used recently. You must have {num} distinct password before reusing a previous password.
ar: أنت لست بصدد إعادة استخدام كلمة مرور استخدمتها حديثًا. يجب أن تكون لديك كلمتا مرور مختلفتين لتتمكن من إعادة استخدام كلمة مرور مستخدمة سابقًا.

source: You are resetting passwords too frequently. Due to security policies, {num} day must elapse between password resets.
ar: لم تقم بتغيير كلمة المرور منذ مدة قصيرة. تُحتِّم سياسة الأمن لدينا انقضاء يوم واحد على الأقل منذ آخر تغيير لكلمة المرور لتتمكن من تغييرها مرّة أخرى.

source: {num} character
ar: {num} حرف

source: Enter a password with at most {num} character.
ar: يجب عليك ادخال {num} حرف على الأكثر لكلمة السر

source: Password cannot be the same as the username.
ar: لا يمكن أن تكون كلمة المرور نفس اسم المستخدم.

source: Password is too similar to a dictionary word.
ar: كلمة السر شبيهة جدًا بإحدى مدخلات القاموس

source: To disable the XBlock and prevent rendering in the LMS, leave "Enabled" deselected; for clarity, update XBlockStudioConfiguration support state accordingly.
ar: لتعطيل XBlock ومنعه من العرض في LMS، اترك "المربّع" غير محدد؛ وللتوضيح، حدث حالة دعم XBlockStudioConfiguration وفقًا لذلك.

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
ar: يمكن فقط تحديد XBlocks المدرجة في قائمة الوِحدات المتقدّمة للمساق على أنّها أثريّة. تذكر تحديث حالة دعم XBlockStudioConfiguration وفقًا لذلك، لأن حالة "أثريّ" لا تؤثر على إمكانية إنشاء حالات XBlock جديدة في الاستوديو من عدمها.

source: XBlock/template combinations that are disabled cannot be edited in Studio, regardless of support level. Remember to also check if all instances of the XBlock are disabled in XBlockConfiguration.
ar: لا يمكن تحرير تراكيب القالب/XBlock التي تم تعطيلها في الاستوديو بغض النظر عن مستوى الدعم. تذكر أيضًا التحقق مما إذا كانت جميع حالات XBlock معطلة في XBlockConfiguration.

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
ar: يمكن دائمًا إنشاء تراكيب القالب/XBlock الممكّنة مع دعم دائم أو مؤقت في الاستوديو. تتطلب تركيبات القالب/XBlock تدخل مؤلف المساق.

source: show deprecation messaging in Studio
ar: إظهار رسائل استبعاد المحتوى الأثريّ في الاستوديو

source: Fully Supported
ar: مدعوم تماماً

source: Provisionally Supported
ar: مدعوم مؤقتاً

source: Unsupported
ar: غير مدعوم

source: Cannot rescore problems with possible file submissions
ar: لا يمكن إعادة تقييم المسائل التي يُمكن تسليم ملفّات لها.

source: Question {0}
ar: السؤال {0}

source: Incorrect
ar: خطأ

source: Correct
ar: صواب

source: correct
ar: صواب

source: incorrect
ar: خطأ

source: partially correct
ar: صحيح جزئياً

source: incomplete
ar: غير مكتمل.

source: unanswered
ar: غير مُجاب

source: submitted
ar: تم تسليمه

source: processing
ar: يجري العمل

source: This answer is correct.
ar: هذه الإجابة صحيحة.

source: This answer is incorrect.
ar: هذه الإجابة غير صحيحة.

source: This answer is partially correct.
ar: هذه الإجابة صحيحة جزئيًا

source: This answer is being processed.
ar: هذه الإجابة يجري تقييمها.

source: Not yet answered.
ar: لم تتم إجابتها بعد.

source: Select an option
ar: حدِّد خيارًا

source: ChoiceGroup: unexpected tag {tag_name}
ar: مجموعة الاختيار: وسم {tag_name} غير متوقّع.

source: Answer received.
ar: تمّ تلقي الإجابة.

source: Expected a <choice> or <compoundhint> tag; got {given_tag} instead
ar: كان من المتوقَّع وجود الوسم <choice> أو <compoundhint>؛ لكن وُجِدَ الوسم {given_tag} مكانه.

source: Your files have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ar: تمّ تسليم الملفات. ستتحول هذه الرسالة إلى ملاحظات المُصَحِّح حالما يتم تصحيح ملفاتك.

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ar: تمّ تسليم الإجابة، عندما يتم تقييم إجابتك، ستظهر العلامة أو ملاحظات المقيّم لك هنا.

source: {programming_language} editor
ar: مُحرِّر {programming_language}

source: Press ESC then TAB or click outside of the code editor to exit
ar: للخروج، اضغط ESC ثم TAB أو انقر خارج المُحرِّر البرمجيّ

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
ar: تمّ التسليم. ستتحول هذه الرسالة إلى الملاحظات حالما يتواجد ردّ.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
ar: لا استجابة من ’Xqueue‘ خلال {xqueue_timeout} ثانية. أُلغيَت العمليّة.

source: Error running code.
ar: خطأ في تشغيل النصّ البرمجيّ.

source: Cannot connect to the queue
ar: لا يمكن الاتصال بالطابور.

source: No formula specified.
ar: .صيغة تحديد يتم لم

source: Couldn't parse formula: {error_msg}
ar: {error_msg} الصيغة إعراب تعذّر

source: Error while rendering preview
ar: المعاينة تحضير أثناء خطأ حدث

source: Sorry, couldn't parse formula
ar: .الصيغة إعراب تعذّر ،للأسف

source: {input_type}: unexpected tag {tag_name}
ar: {input_type}: وسم {tag_name} غير متوقَّع.

source: Expected a {expected_tag} tag; got {given_tag} instead
ar: كان المتوقَّع وجود وسم {expected_tag}؛ ولكن وُجِد الوسم {given_tag} مكانهمنه.

source: Question {index}
ar: سؤال {index}

source: Correct:
ar: صواب:

source: Incorrect:
ar: خطأ:

source: Answer
ar: إجابة

source: Error {err} in evaluating hint function {hintfn}.
ar: حدث الخطأ {err} أثناء تقييم وظيفة التلميح {hintfn}.

source: (Source code line unavailable)
ar: (سطر المصدر البرمجي غير متاح)

source: See XML source line {sourcenum}.
ar: انظر إلى سطر XML المصدريّ {sourcenum}.

source: Checkboxes
ar: مربعات الاختيار

source: Multiple Choice
ar: اختيارات متعدّدة

source: Do not use shuffle and answer-pool at the same time
ar: لا تستخدِم خياري الخلط و مستودع الإجابات معًا

source: answer-pool value should be an integer
ar: يجب أن تكون قيمة ’answer-pool‘ عددًا صحيحًا.

source: Choicegroup must include at least 1 correct and 1 incorrect choice
ar: يجب أن تحوي مجموعة الخيارات خيارا واحدًا صحيحًا وواحدًا خاطئًا على الأقل

source: True/False Choice
ar: خيار صواب/خطأ

source: Dropdown
ar: قائمة منسدلة

source: Numerical Input
ar: مُدخَل رقمي

source: There was a problem with the staff answer to this problem.
ar: حدثت مشكلة في إجابة طاقم المساق على هذه المسألة.

source: Could not interpret '{student_answer}' as a number.
ar: تعذّر تفسير ’{student_answer}‘ كرقم.

source: You may not use variables ({bad_variables}) in numerical problems.
ar: يجب أن لاتستخدم متغيرات ({bad_variables}) في المسائل العددية

source: Factorial function evaluated outside its domain:'{student_answer}'
ar: تقييم خاصية الضرب خارج نطاقها: '{student_answer}'

source: Invalid math syntax: '{student_answer}'
ar: صياغة رياضية غير صالحة: '{student_answer}'

source: You may not use complex numbers in range tolerance problems
ar: لا يجوز استخدام الأعداد المركّبة في مسائل تحتمل نطاقًا للإجابات

source: There was a problem with the staff answer to this problem: complex boundary.
ar: حدثت مشكلة في إجابة طاقم المساق عن هذه المسألة: حدود مركّبة.

source: There was a problem with the staff answer to this problem: empty boundary.
ar: حدثت مشكلة في إجابة طاقم المساق عن هذه المسألة: حدود خالية.

source: or
ar: أو

source: Text Input
ar: مُدخَل نصّي

source: error
ar: حدث خطأ

source: Custom Evaluated Script
ar: نصّ مقيّم بطريقة مخصّصة

source: error getting student answer from {student_answers}
ar: حدث خفيعند جلب إجابة الطالب من {student_answers}

source: No answer entered!
ar: لم تُدخَل أي إجابة!

source: CustomResponse: check function returned an invalid dictionary!
ar: ردّ مخصّص: أرجعت وظيفة التحقّق قاموسًا غير صالح!

source: Symbolic Math Input
ar: مدخلات رياضيّة رمزيّة

source: An error occurred with SymbolicResponse. The error was: {error_msg}
ar: حدث خطأ في ’SymbolicResponse‘. رسالة الخطأ: {error_msg}

source: Code Input
ar: مُدخل نصّ برمجيّ

source: No answer provided.
ar: لم تُقدَّم أي إجابة.

source: Error: No grader has been set up for this problem.
ar: خطأ: لم يُحدَّد مصحح لهذه المسألة بعد.

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
ar: تعذّر إيصال ما قدّمته إلى المصحِّح (السبب: {error_msg}). تُرجى إعادة المحاولة فيما بعد.

source: Invalid grader reply. Please contact the course staff.
ar: ردّ المصحح غير صالِح. يُرجى الاتصال بطاقم المساق.

source: External Grader
ar: مصحِّح خارجيّ

source: Math Expression Input
ar: مُدخل تعبير رياضيّ

source: Invalid input: {bad_input} not permitted in answer.
ar: مُدخلات غير صالحة: غير مسموح بـ {bad_input} في الإجابة.

source: Factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
ar: لا يسمح باستخدام خاصيّة الضرب في إجابة هذا السؤال. الإجابة المقدّمة: {bad_input}

source: Invalid input: Could not parse '{bad_input}' as a formula.
ar: مُدخلة غير صالحة: تعذّر إعراب ’{bad_input}‘ كصيغة رياضيّة.

source: Invalid input: Could not parse '{bad_input}' as a formula
ar: مُدخلة غير صالحة: تعذّر إعراب ’{bad_input}‘ كصيغة رياضيّة

source: Circuit Schematic Builder
ar: باني مخطّطات الدارات

source: Error in evaluating SchematicResponse. The error was: {error_msg}
ar: حدوث خطأ في تصحيح ’SchematicResponse‘. رسالة الخطأ: {error_msg}

source: Image Mapped Input
ar: مُدخل خريطة صوريّة

source: error grading {image_input_id} (input={user_input})
ar: خطأ في تصحيح {image_input_id} (input={user_input})

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
ar: خطأ في توصيف المسألة! لا يمكن إعراب المستطيل في {sr_coords}

source: Annotation Input
ar: مُدخَل ملاحظة

source: Checkboxes With Text Input
ar: مربعات اختيار ذات مُدخلات نصّية

source: Answer not provided for {input_type}
ar: لم تُقدَّم إجابة لـ {input_type}

source: The Staff answer could not be interpreted as a number.
ar: تعذّر تفسير إجابة طاقم المساق كعدد.

source: Could not interpret '{given_answer}' as a number.
ar: تعذّر تفسير ’{given_answer}‘ كعدد.

source: XML data for the annotation
ar: بيانات ’XML‘ للملاحظات

source: The display name for this component.
ar: اسم العرض لهذا العنصر.

source: Annotation
ar: الملاحظات

source: Blank Advanced Problem
ar: مسألة متقدِّمة فارغة

source: Number of attempts taken by the student on this problem
ar: عدد المحاولات التي قام بها الطالب لحلّ هذه المسألة

source: Maximum Attempts
ar: الحد الأقصى لعدد المحاولات

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
ar: تحدِّد هذه القيمة عدد المرّات التي يمكن فيها للطالب أن يحاول الإجابة على هذه المسألة. إذا لم تُضبط هذه القيمة، فسيُسمح بعدد غير محدود من المحاولات .

source: Date that this problem is due by
ar: آخر موعد لتسليم هذه المسألة

source: Amount of time after the due date that submissions will be accepted
ar: المدّة التي سيستمر خلالها قبول تقديم الواجبات بعد مضي تاريخ الاستحقاق

source: Show Results
ar: إظهار النتائج

source: Defines when to show whether a learner's answer to the problem is correct. Configured on the subsection.
ar: يحدّد وقت الكشف عن صحّة إجابة المتعلّم على السؤال. تمّ تحديده في القسم الفرعي.

source: Always
ar: دائمًا

source: Never
ar: نهائيًا

source: Past Due
ar: انقضى موعد تسليمها

source: Show Answer
ar: أظهر الإجابة

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
ar: تحدّد متى تظهر إجابة المسألة. يمكن تحديد القيمة المبدئيّة في "الإعدادات المتقدّمة".

source: Answered
ar: مُجابة

source: Attempted
ar: حووِلَت

source: Closed
ar: مُغلق

source: Finished
ar: استُكمِلت

source: Correct or Past Due
ar: صحيحة أو انقضى موعد تسليمها

source: Whether to force the save button to appear on the page
ar: إذا كان يجب أن يظهر زرّ ’حفظ‘ على الصفحة أم لا

source: Show Reset Button
ar: آظهر زرّ مسح الإجابة

source: Determines whether a 'Reset' button is shown so the user may reset their answer. A default value can be set in Advanced Settings.
ar: تحدّد إذا كان سيُظهَر زرّ "مسح الإجابة" مما يسمح للمستخدم من مسح إجابته. يمكن تعيين قيمة مبدئيّة من صفحة "الإعدادات المتقدّمة"

source: Randomization
ar: ترتيب عشوائي

source: Defines when to randomize the variables specified in the associated Python script. For problems that do not randomize values, specify "Never".
ar: تحديد متى يمكن إعادة ترتيب المتغيِّرات المحدَّدة في سكرِبت بايثون ذي العلاقة عشوائيًّا. يجب تحديد القيمة "نهائيًا" للمسائل التي لا تُرتَّب فيها القيم عشوائيًّا.

source: On Reset
ar: عند التصفير

source: Per Student
ar: لكلّ طالب

source: XML data for the problem
ar: بيانات XML للمسألة

source: Dictionary with the correctness of current student answers
ar: قاموس يحوي تصحيح أجابات الطالب الحالية

source: Dictionary for maintaining the state of inputtypes
ar: قاموس لحفظ حالة أنواع المدخلات

source: Dictionary with the current student responses
ar: قاموس لردود الطلاب الحاليين

source: Dictionary with the current student score
ar: قاموس لعلامات الطالب الحالية

source: Whether or not the answers have been saved since last submit
ar: سواء تم حفظ الإجابات أم لا منذ آخر تسليم

source: Whether the student has answered the problem
ar: فيما إذا أجاب الطالب عن المسألة

source: Random seed for this student
ar: بِذرة عشوائيّة لهذا المستخدِم

source: Last submission time
ar: وقت آخر تسليم

source: Timer Between Attempts
ar: المؤقّت بين المحاولات

source: Seconds a student must wait between submissions for a problem with multiple attempts.
ar: عدد الثواني التي يجب على الطالب انتظارها بينمحاولات التقديم لمسألة تقبل عدّة محاولات.

source: Problem Weight
ar: وزن المسألة

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
ar: تحدِّد هذه القيمة عدد النقاط التي تستحقّها كلّ مسألة. إذا لم تُضبَط هذه القيمة، فسيكون وزن كل حقل ردّ في المسألة بنقطة واحدة.

source: Markdown source of this module
ar: مصدر ماركداون لهذه الوحدة

source: Source code for LaTeX and Word problems. This feature is not well-supported.
ar: المحتوى المصدريّ للمسائل التي جرى تحرير نصوصها باستخدام LaTeX وWord. هذه الميزة غير مدعومة بشكل جيّد.

source: Enable LaTeX templates?
ar: هل ترغب في تفعيل قوالِب LaTeX؟

source: Matlab API key
ar: مفتاح واجهة برمجة التطبيقات الخاص ببرنامج ’Matlab‘؟

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use by this course for the specified duration. Please do not share the API key with other courses and notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
ar: أدخِل مفتاح واجهة برمجة التطبيقات، الذي تقدّمه شركة ماثووركس، لاستخدام الخدمة المستضافة بلغة MATLAB. يُمنح هذا المفتاح للاستخدام الحصري في هذا المساق خلال مدّة محدّدة. يُرجى عدم استخدام مفتاح واجهة برمجة التطبيقات في مساقات أخرى، وإبلاغ ماثووركس فورًا إذا كنت تعتقد بأنّ المفتاح قد انكشف أو سُرِق. للحصول على مفتاح لمساقك، أو للإبلاغ عن مشكلة ما، تُرجى مراسلة الشركة على هذا العنوان moocsupport@mathworks.com.

source: Submit
ar: أرسِل

source: Submitting
ar: يجري الإرسال

source: Warning: The problem has been reset to its initial state!
ar: تحذير: أُعيد ضبط المسألة إلى حالتها الأوّلية!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
ar: أُفسِدت حالة المسألة بسبب تسليم غير صالح. يتكوّن ما تمّ تسليمه من:

source: If this error persists, please contact the course staff.
ar: إذا استمرّ ظهور هذا الخطأ، يُرجى الاتصال بطاقم المساق.

source: Hint ({hint_num} of {hints_count}):
ar: التلميح ({hint_num} من {hints_count}):

source: Your answers were previously saved. Click '{button_name}' to grade them.
ar: لقد تم حفظ إجاباتك سابقاً. اضغط على '{button_name}' لتقييمها.

source: Incorrect ({progress} point)
ar: غير صحيحة (لا شيء)

source: Correct ({progress} point)
ar: صحيحة (لا شيء)

source: Partially correct ({progress} point)
ar: صحيحة جزئيًّا (لا نقاط)

source: Partially Correct
ar: صحيحة جزئياً

source: Answer submitted.
ar: تمّ تلقّي الإجابة.

source: Problem is closed.
ar: أُغلقت المسألة.

source: Problem must be reset before it can be submitted again.
ar: يجب مسح إجابة المسألة قبل تقديم الحل مرة أخرى.

source: You must wait at least {wait} seconds between submissions.
ar: يجب أن تنتظر ما لا يقلّ عن {wait} من الثواني بين كل تقديمين متتاليين.

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
ar: يجب أن تنتظر ما لا يقلّ عن {wait_secs} من الثواني بين كل تقديمين متتاليين. تبقّى {remaining_secs}.

source: {num_hour} hour
ar: لا ساعات

source: {num_minute} minute
ar: لا دقائق

source: {num_second} second
ar: لا ثواني

source: Problem needs to be reset prior to save.
ar: يجب مسح `جابة المسألة قبل الحفظ.

source: Your answers have been saved.
ar: حُفِّظت إجاباتك.

source: Your answers have been saved but not graded. Click '{button_name}' to grade them.
ar: حُفِّظت إجاباتك ولكنها لم تُقيَّم بعد. اضغط على '{button_name}' لتقييمها.

source: You cannot select Reset for a problem that is closed.
ar: لا يمكنك اختيار مسح إجابة مسألة مغلقة.

source: You must submit an answer before you can select Reset.
ar: يجب تقديم إجابة قبل أن تتمكن من اختيار المَسح.

source: Problem's definition does not support rescoring.
ar: لا يدعم تعريفُ المسألةِ إعادةَ التصحيح.

source: Problem must be answered before it can be graded again.
ar: تجب الإجابة على المسألة قبل إعادة تصحيحها.

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
ar: نعتذر لحدوث خطأ أثناء معالجة طلبك. يُرجى إعادة تحميل صفحتك والمحاولة مرّة أخرى.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
ar: تغيّرت حالة هذه المسألة منذ تحميل هذه الصفحة. يُرجى تحديث صفحتك.

source: Answer ID
ar: الرقم المعرّف للاجابة

source: Question
ar: السؤال

source: Correct Answer
ar: اجابة صحيحة

source: Conditional
ar: مشروط

source: List of urls of children that are references to external modules
ar: قائمة من العناوين الفرعيّة التي تعتبر مراجع للوحدات الخارجية

source: Source Components
ar: عناصر المصدر

source: The component location IDs of all source components that are used to determine whether a learner is shown the content of this conditional module. Copy the component location ID of a component from its Settings dialog in Studio.
ar: معرفات موقع العناصر لجميع عناصر المصدر المستخدمة لتحديد ما إذا كان سيظهر للطالب محتوى هذه الوحدة المشروطة. انسخ معرف موقع العنصر لأحد العناصر من مربع حوار الإعدادات في الستوديو.

source: Conditional Attribute
ar: خاصية مشروطة

source: The attribute of the source components that determines whether a learner is shown the content of this conditional module.
ar: خاصية عناصر المصدر المستخدمة لتحديد ما إذا كان سيظهر للطالب محتوى هذه الوحدة المشروطة.

source: Conditional Value
ar: القيمة المشروطة

source: The value that the conditional attribute of the source components must match before a learner is shown the content of this conditional module.
ar: القيمة التي يجب أن تطابقها الخاصية المشروطة لعناصر المصدر المستخدمة قبل أن يظهر للطالب محتوى هذه الوحدة المشروطة.

source: Blocked Content Message
ar: رسالة محتوى محظور

source: The message that is shown to learners when not all conditions are met to show the content of this conditional module. Include {link} in the text of your message to give learners a direct link to required units. For example, 'You must complete {link} before you can access this unit'.
ar: الرسالة التي تظهر للطلاب عند عدم استيفاء جميع الشروط الخاصة بإظهار محتوى هذه الوحدة المشروطة. أضف {link} في نص رسالتك لإعطاء المتعلمين رابطًا مباشرًا للوحدات المطلوبة. على سبيل المثال: "يجب أن تكمل {link} قبل أن تتمكن من الوصول إلى هذه الوحدة".

source: You must complete {link} before you can access this unit.
ar: يجب أن تكمل {link} قبل أن تتمكن من الوصول إلى هذه الوحدة.

source: This component has no source components configured yet.
ar: لا يتضمّن هذا العنصر أي عناصر مصدر تمّ ضبطها حتّى الآن.

source: Configure list of sources
ar: اضبط قائمة المصادر

source: LTI Passports
ar: جوازات مرور LTI

source: Enter the passports for course LTI tools in the following format: "id:client_key:client_secret".
ar: أدخل جوازات مرور LTI لأدوات المساق بالصيغة التالية: "id:client_key:client_secret".

source: List of Textbook objects with (title, url) for textbooks used in this course
ar: قائمة بمواضيع الكتاب معها (عناوين، وروابط) للكتب المستخدمة في هذا المساق

source: Slug that points to the wiki for this course
ar: الكُتلة التي تُشير إلى صفحة الويكي لهذ المساق

source: Date that enrollment for this class is opened
ar: التاريخ الذي يُفتح فيه الانضمام لهذا الصف

source: Date that enrollment for this class is closed
ar: التاريخ الذي يُغلق فيه التسجيل لهذا الصف

source: Start time when this module is visible
ar: منذ متى ستكون هذه الوحدة مرئية

source: Date that this class ends
ar: التاريخ الذي ينتهي فيه هذا الصف

source: Date that certificates become available to learners
ar: تاريخ إتاحة الشهادات للمتعلّمين

source: Cosmetic Course Display Price
ar: تكلفة العرض المحسَّن للمساق

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
ar: التكلفة التي تُعرَض للطلّاب للتسجيل في المساق. إذا حدَّد أحد المشرِفين في قاعدة البيانات سعر التسجيل في المساق المدفوع، فسيُعرض ذلك السعر بدلًا من هذا.

source: Course Advertised Start
ar: بدء المساق المُعلَن عنه

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
ar: أدخل النص الذي تريد استخدامه كالإطار الزمني المعلن لبداية الدورة، مثل "شتاء 2018". إذا تركت هذه القيمة فارغة، سيتم استخدام تاريخ البدء الذي حدَّدته لهذه الدورة.

source: Pre-Requisite Courses
ar: المتطلبات الأساسية

source: Pre-Requisite Course key if this course has a pre-requisite course
ar: مفتاح المتطلّب إذا كان لهذا المساق متطلَّب سابق.
