Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: You agree to use the APIs solely for the purpose of delivering content that is accessed through the APIs (the "API Content") to your own website, mobile site, app, blog, email distribution list, or social media property ("Your Application") or for another commercial use that you described in your request for access and that {platform_name} has approved on a case-by-case basis. {platform_name_capitalized} may monitor your use of the APIs for compliance with the Terms and may deny your access or shut down your integration if you attempt to go around or exceed the requirements and limitations set by {platform_name}. Your Application or other approved use of the API or the API Content must not prompt your end users to provide their {platform_name} username, password or other {platform_name} user credentials anywhere other than on the {platform_name} website at {platform_url}.
ar: أنت توافق على استخدام واجهات API فقط لغرض تقديم المحتوى الذي يتم الوصول إليه عن طريق واجهات API ("محتوى API") على موقعك الإلكتروني، أو موقعك للأجهزة النقالة، أو تطبيقك، أو مدونتك، أو قائمتك البريدية، أو ملكية شبكات التواصل الاجتماعي، أو لأي استخدام تجاري آخر وصفته في طلبك للوصول وأقرّته {platform_name} عملاً بقاعدة التعامل مع كل حالة على حدة. قد تقوم {platform_name_capitalized} بمراقبة استخدامك لواجهات API للتحقق من الالتزام بالشروط وقد تمنع دخولك أو تقوم بإيقاف خصائص التكامل التي تتمتع بها إذا قمت بأي محاولة للالتفاف على المتطلبات والقيود التي تضعها {platform_name} أو تجاوزها. لا يجوز لتطبيقك أو أي استخدام آخر متفق عليه لواجهة API أو محتوى API أن يطلب من المستخدمين النهائيين لديك تقديم اسم مستخدم {platform_name}، أو كلمة المرور، أو أي بيانات اعتماد أخرى لمستخدم {platform_name} في أي مكان بخلاف موقع {platform_name} على {platform_url}.

source: Prohibited Uses and Activities
ar: الاستخدامات والنشاطات الممنوعة

source: {platform_name_capitalized} shall have the sole right to determine whether or not any given use of the APIs is acceptable, and {platform_name} reserves the right to revoke API access for any use that {platform_name} determines at any time, in its sole discretion, does not benefit or serve the best interests of {platform_name}, its users and its partners.
ar: لـ{platform_name_capitalized} وحدها فقط الحق في تحديد ما إذا كان أي استخدام محدد لواجهات API مقبولا أم لا. كما تحتفظ {platform_name} بالحق في إلغاء الوصول إلى API لأي سبب تراه {platform_name} في أي وقت، ووفقاً لتقديرها فقط، أنه لا يفيد {platform_name} ولا يخدم مصالحها، ولا مصالح مستخدميها، ولا شركائها.

source: The following activities are not acceptable when using the APIs (this is not an exhaustive list):
ar: تعتبر الاستخدامات التالية غير مقبولة عند استخدام واجهات API (هذه ليست قائمة نهائية):

source: collecting or storing the names, passwords, or other credentials of {platform_name} users;
ar: جمع وحفظ الأسماء، الكلمات السرية، أو أي من معلومات عن مستخدمي {platform_name}؛

source: scraping or similar techniques to aggregate or otherwise create permanent copies of API Content;
ar: التفكيك أو الأساليب المشابهة لتجميع أو إنشاء نسخ دائمة من محتوى API؛

source: violating, misappropriating or infringing any copyright, trademark rights, rights of privacy or publicity, confidential information or any other right of any third party;
ar: الانتهاك، أو الاختلاس، أو التعدي على أي حقوق للطبع والنشر، أو حقوق العلامات التجارية، أو حقوق الخصوصية، أو الدعاية، أو المعلومات السرية، أو أي حق آخر لأي طرف ثالث؛

source: altering or editing any content or graphics in the API Content;
ar: تغيير أو تعديل أي محتوى أو رسومات في محتوى API

source: altering or removing any trademark, copyright or other proprietary or legal notices contained in, or appearing on, the APIs or any API Content;
ar: تعديل أو إزالة أي علامة تجارية، أو حقوق طبع ونشر، أو إشعارات أخرى ملكية أو قانونية واردة في أو تظهر على واجهات API أو أي محتوى في API.

source: sublicensing, re-distributing, renting, selling or leasing access to the APIs or your client secret to any third party;
ar: منح تراخيص ثانوية، أو إعادة توزيع، أو تأجير، أو بيع، أو إيجار إمكانية الوصول إلى واجهات API أو كلمة مرور العميل الخاصة بك إلى أي طرف ثالث.

source: distributing any virus, Trojan horse, spyware, adware, malware, bot, time bomb, worm, or other harmful or malicious component; or
ar: توزيع أي فيروس، أو حصان طروادة، أو برمجيات تجسس، أو برمجيات إعلانية، أو برمجيات خبيثة، أو bot، أو قنبلة موقوتة، أو دودة، أو غيرها من المكونات الضارة أو الخبيثة؛ أو

source: using the APIs for any purpose which or might overburden, impair or disrupt the {platform_name} platform, servers or networks.
ar: استخدام واجهات API لأي غرض الذي قد يُثقل على، أو يُضعف، أو يُعطل، أو يؤثر سلبًا على منصة أو خوادم أو شبكات {platform_name}.

source: Usage and Quotas
ar: الاستخدامات والشروط

source: {platform_name_capitalized} reserves the right, in its discretion, to impose reasonable restrictions and limitations on the number and frequency of calls made by you or Your Application to the APIs. You must not attempt to circumvent any restrictions or limitations imposed by {platform_name}.
ar: تحتفظ {platform_name_capitalized} لنفسها بالحق، وفقاً لتقديرها الخاص، في فرض القيود والحدود على عدد ومعدل تكرار الاستدعاءات التي تصدرها أنت أو تطبيقك لواجهات API. ولا يجوز لك محاولة التحايل على أي من القيود أو الحدود التي نفرضها {platform_name}.

source: Compliance
ar: الامتثال

source: You agree to comply with all applicable laws, regulations, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, copyright, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with {platform_name}. You will only access (or attempt to access) an API by the means described in the documentation of that API. You will not misrepresent or mask either your identity or Your Application's identity when using the APIs.
ar: أنت توافق على الامتثال لجميع القوانين المعمول بها، والضوابط، وحقوق أي طرف ثالث (بما في ذلك، وبدون حصر، القوانين التي تتعلق باستيراد أو تصدير البيانات أو البرامج، والخصوصية، وحقوق الطبع والنشر، والقوانين المحلية). ولا يحق لك استخدام واجهات API لتشجيع نشاط غير قانوني أو انتهاك حقوق الغير أو الترويج لذلك. ولا يحق لك مخالفة أي شرط من شروط الخدمة الأخرى التي تم الاتفاق عليها مع {platform_name}. ويحق لك فقط الوصول (أو محاولة الوصول) إلى واجهة API عبر الطرق المذكورة في وثائق واجهة API تلك. ولا يحق لك تمويه أو إخفاء هويتك أو هوية تطبيقك عند استخدام واجهات API.

source: Ownership
ar: الملكية

source: You acknowledge and agree that the APIs and all API Content contain valuable intellectual property of {platform_name} and its partners. The APIs and all API Content are protected by United States and foreign copyright, trademark, and other laws. All rights in the APIs and the API Content, if not expressly granted, are reserved. By using the APIs or any API Content, you do not acquire ownership of any rights in the APIs or API Content. You must not claim or attempt to claim ownership in the APIs or any API Content or misrepresent yourself or your company or your Application as being the source of any API Content. You may not modify, create derivative works of, or attempt to use, license, or in any way exploit any API Content in whole or in part on your own behalf or on behalf of any third party. You may not distribute or modify the APIs or any API Content (including adaptation, editing, excerpting, or creating derivative works).
ar: أنت تقر وتوافق على أن واجهات API ومحتوى API تحتوي على ملكية فكرية قَيِّمة لكل من {platform_name} وشركائها. وتخضع واجهات API ومحتوى API للحماية وفقاً لقوانين حقوق الطبع والنشر والعلامات التجارية وغيرها من القوانين المعمول بها في الولايات المتحدة والبلدان الأخرى. جميع حقوق واجهات API ومحتوى API محفوظة، إذا لم تُمنح للاستعمال بشكل صريح. كما أن استخدام واجهات API أو أي محتوى من محتويات API لا يُكسِبك ملكية لأي حقوق في واجهات API أو محتوى API. ولا يجوز لك ادِّعاء أو محاولة ادِّعاء ملكية واجهات API أو أي محتوى من محتويات API أو تقديم نفسك أو شركتك أو التطبيق الخاص كمصدر لأي محتوى من محتويات API. ولا يحق لك تعديل أو إنشاء أعمال مشتقة من، أو محاولة استخدام، أو ترخيص، أو بأي شكل من الأشكال استغلال أي محتوى من محتويات API كلياً أو جزئياً لاستخدامك الخاص أو بالنيابة عن أي طرف ثالث. ولا يجوز لك توزيع أو تعديل واجهات API أو أي من محتويات API (بما في ذلك الملاءمة، أو التحرير، أو الاقتباس، أو إنشاء أعمال مشتقة).

source: All names, logos and seals ("Trademarks") that appear in the APIs, API Content, or on or through the services made available on or through the APIs, if any, are the property of their respective owners. You may not remove, alter, or obscure any copyright, Trademark, or other proprietary rights notices incorporated in or accompanying the API Content. If any {platform_name} Participant (as hereinafter defined) or other third party revokes access to API Content owned or controlled by that {platform_name} Participant or third party, including without limitation any Trademarks, you must ensure that all API Content pertaining to that {platform_name} Participant or third party is deleted from Your Application and your networks, systems and servers as soon as reasonably possible. "{platform_name_capitalized} Participants" means MIT, Harvard, and the other entities providing information, API Content or services for the APIs, the course instructors and their staffs.
ar: جميع الأسماء والشعارات والأختام ("العلامات التجارية") التي تظهر في واجهات برمجة التطبيقات أو محتوى API أو على أو من خلال الخدمات المتاحة على أو من خلال واجهات برمجة التطبيقات، إن وجدت، هي ملك لأصحابها المعنيين. لا يحقّ لك إزالة أو تغيير أو إخفاء أي حقوق طبع ونشر أو علامة تجارية أو إشعارات حقوق ملكية أخرى مدمجة في محتوى واجهة برمجة التطبيقات أو مرافقة له. إذا قام أي {platform_name} مشارك (كما هو محدد فيما يلي) أو أي جهة خارجية أخرى بإلغاء الوصول إلى محتوى API الذي يملكه أو يتحكم فيه ذلك {platform_name} أو جهة خارجية ، بما في ذلك على سبيل المثال لا الحصر أي علامات تجارية ، يجب عليك التأكد من أن جميع محتوى API المتعلق بذلك {platform_name} يتم حذفها أو الطرف الثالث من التطبيق الخاص بك والشبكات والأنظمة والخوادم الخاصة بك في أسرع وقت ممكن. "المشاركون في {platform_name_capitalized}" يعني معهد ماساتشوستس للتكنولوجيا وجامعة هارفارد والكيانات الأخرى التي توفر المعلومات أو محتوى أو خدمات واجهة برمجة التطبيقات لواجهة برمجة التطبيقات ومدرسي الدورة التدريبية وموظفيها.

source: To the extent that you submit any content to {platform_name} in connection with your use of the APIs or any API Content, you hereby grant to {platform_name} a worldwide, non-exclusive, transferable, assignable, sub licensable, fully paid-up, royalty-free, perpetual, irrevocable right and license to host, transfer, display, perform, reproduce, modify, distribute, re-distribute, relicense and otherwise use, make available and exploit such content, in whole or in part, in any form and in any media formats and through any media channels (now known or hereafter developed).
ar: إلى الحد الذي تقوم بناءً عليه بأرسال أي محتوى إلى {platform_name} مُتعلق باستخدامك لواجهات API أو أي محتوى من محتويات API، فإنك بموجبه تمنح {platform_name} الحق عالمي، وغير الحصري، القابل للنقل، والقابل للتخصيص، والقابل للترخيص بشكل ثانوي، المدفوع بالكامل، والخالي من الامتيازات، الأبدي، والغير قابل للإلغاء لاستضافة هذا المحتوى، ونقله، وعرضه، وتنفيذه، وإعادة إنتاجه، وتعديله، وتوزيعه، وإعادة توزيعه، وإعادة ترخيصه، وغير ذلك من الاستخدامات الأخرى، وإتاحته، واستغلاله، سواء كلياً أو جزئياً، وبأي شكل من الأشكال وبأي نوع من أنواع الوسائط، ومن خلال أي قنوات إعلامية (معروفة الآن أو التي قد يتم تطويرها لاحقاً).

source: Privacy
ar: الخصوصية

source: You agree to comply with all applicable privacy laws and regulations and to be transparent with respect to any collection and use of end user data. You will provide and adhere to a privacy policy for Your Application that clearly and accurately describes to your end users what user information you collect and how you may use and share such information (including for advertising) with {platform_name} and other third parties.
ar: أنت توافق على الامتثال لجميع قوانين ولوائح الخصوصية المعمول بها وعلى أن تكون نزيهاً فيما يتعلق بأي جمع واستخدام لبيانات المستخدم النهائي. ويجب عليك أن تضع سياسة خصوصية وتلتزم بها للتطبيق الخاص بك، بحيث تصف بوضوح وبدقة للمستخدمين النهائيين معلومات المستخدم التي تجمعها وطريقة استخدامك لها وإطلاع الآخرين عليها (بما في ذلك الإعلان) مع {platform_name} وأي طرف ثالث آخر.

source: Right to Charge
ar: الحق في المقاضاة

source: Certain access to the APIs may be provided free of charge, but {platform_name} reserves the right to charge fees for future use or access to the APIs.
ar: قد يتم إتاحة الوصول إلى بعض الAPI مجانًا، ولكن منصة {platform_name} تحتفظ بالحق في فرض رسوم على الاستخدام في المستقبل أو الوصول إلى الـ APIs.

source: {platform_name_capitalized} reserves the right to modify the Terms at any time without advance notice. Any changes to the Terms will be effective immediately upon posting on this page, with an updated effective date. By accessing or using the APIs after any changes have been made, you signify your agreement on a prospective basis to the modified Terms and all of the changes. Be sure to return to this page periodically to ensure familiarity with the most current version of the Terms.
ar: تحتفظ {platform_name_capitalized} لنفسها بالحق في تعديل الشروط في أي وقت وبدون إخطار مسبق. وأي تغييرات قد تطرأ على الشروط تعتبر نافذة فور نشرها على هذه الصفحة، مع تحديث تاريخ السريان. ومن خلال الوصول إلى واجهات API أو استخدامها بعد حدوث أية تغييرات، فإنك تؤكد على موافقتك المُسبقة على الشروط المعدلة وجميع التغييرات. احرص على الرجوع إلى هذه الصفحة من وقت لآخر للاطلاع على أحدث نسخة من الشروط.

source: {platform_name_capitalized} may also update or modify the APIs from time to time without advance notice. These changes may affect your use of the APIs or the way your integration interacts with the API. If we make a change that is unacceptable to you, you should stop using the APIs. Continued use of the APIs means you accept the change.
ar: قد تقوم {platform_name_capitalized} بتحديث أو تعديل واجهات API من وقت لآخر دون إشعار مسبق. وقد تؤثر هذه التغييرات على استخدامك لواجهات API أو طريقة تفاعل الربط مع API لديك. وإذا قمنا بإجراء تغيير غير مقبول بالنسبة لك، فيجب عليك التوقف عن استخدام واجهات API. الاستمرار في استخدام واجهات API يعني أنك موافق على التغييرات.

source: Confidentiality
ar: السرية

source: Your credentials (such as client secret and IDs) are intended to be used solely by you. You will keep your credentials confidential and prevent and discourage others from using your credentials. Your credentials may not be embedded in open source projects.
ar: بيانات الاعتماد الخاصة بك (مثل كلمة مرور العميل والمعرفات) مخصصة لاستخدامك الشخصي فقط. ويجب عليك الحفاظ على سرية بيانات الاعتماد الخاصة بك ومنع الآخرين من استخدامها. ولا يجوز دمج بيانات الاعتماد الخاصة بك في مشاريع مفتوحة المصدر.

source: In the event that {platform_name} provides you with access to information specific to {platform_name} and/or the APIs that is either marked as "Confidential" or which a reasonable person would assume to be confidential or proprietary given the terms of its disclosure ("Confidential Information"), you agree to use this information only to use and build with the APIs. You may not disclose the Confidential Information to anyone without {platform_name}'s prior written consent, and you agree to protect the Confidential Information from unauthorized use and disclosure in the same way that you would protect your own confidential information. Confidential Information does not include information that you independently developed, that was rightfully given to you by a third party without any confidentiality obligation, or that becomes public through no fault of your own. You may disclose Confidential Information when compelled to do so by law if you provide {platform_name} with reasonable prior notice, unless a court orders that {platform_name} not receive notice.
ar: في حالة قيام {platform_name} بمنحك إمكانية الوصول إلى معلومات التي تخص {platform_name} و/أو واجهات API المصنفة تحت بند "سري" والتي قد يفترض أي شخص معقول أنها سرية أو ملكية خاصة مع تحديد شروط للإفصاح عنها ("سرية المعلومات")، فإنك توافق على استخدام هذه المعلومات فقط من أجل استخدام واجهات API واستعمالها في عمليات الإنشاء. ولا يجوز لك الكشف عن المعلومات السرية لأي شخص بدون موافقة خطية مسبقة من {platform_name}، وأنت توافق على حماية المعلومات السرية من الاستخدام والإفصاح غير المصرح بهما بنفس الطريقة التي تحمي بها المعلومات السرية الخاصة بك. لا تتضمن المعلومات السرية المعلومات التي وضعتها بشكل مستقل، أو التي أعطاها لك طرف ثالث بدون إلزامك بالسرية، أو المعلومات التي يتم نشرها بدون خطأ منك. يجوز لك الكشف عن معلومات سرية عندما تُجْبَر على القيام بذلك بموجب القانون شرط أن تقدم إشعارًا مسبقًا ومعقولًا إلى {platform_name}، وذلك ما لم تأمر المحكمة بأنه لا يجب أن تحصل {platform_name} على أي إشعار.

source: Disclaimer of Warranty / Limitation of Liabilities
ar: إخلاء المسؤولية عن الضمان / تحديد الالتزامات

source: THE APIS AND ANY INFORMATION, API CONTENT OR SERVICES MADE AVAILABLE ON OR THROUGH THE APIS ARE PROVIDED "AS IS" AND "AS AVAILABLE" WITHOUT WARRANTY OF ANY KIND (EXPRESS, IMPLIED OR OTHERWISE), INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, EXCEPT INSOFAR AS ANY SUCH IMPLIED WARRANTIES MAY NOT BE DISCLAIMED UNDER APPLICABLE LAW.
ar: واجهات API وأية معلومات، أو محتوى API أو خدمات تتاح على أو من خلال واجهات API يتم تقديمها "كما هي" و"حسب التوافر" دون ضمان من أي نوع (صريح أو ضمني أو غير ذلك)، بما في ذلك، وعلى سبيل المثال لا الحصر، أي ضمانات ضمنية للدعاية والملاءمة لغرض معين وعدم الانتهاك، ما عدا ما يتم تقديمه كضمانات ضمنية من هذا النوع لا يجوز إخلاء المسؤولية تجاهها بموجب القانون المعمول به.

source: {platform_name} AND THE {platform_name} PARTICIPANTS DO NOT WARRANT THAT THE APIS WILL OPERATE IN AN UNINTERRUPTED OR ERROR-FREE MANNER, THAT THE APIS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE APIS OR API CONTENT PROVIDED WILL MEET YOUR NEEDS OR EXPECTATIONS. {platform_name} AND THE {platform_name} PARTICIPANTS ALSO MAKE NO WARRANTY ABOUT THE ACCURACY, COMPLETENESS, TIMELINESS, OR QUALITY OF THE APIS OR ANY API CONTENT, OR THAT ANY PARTICULAR API CONTENT WILL CONTINUE TO BE MADE AVAILABLE.
ar: لا تضمن {platform_name} والمشاركون لدى {platform_name} (كما هو موضح لاحقاً) أن تعمل واجهات API بطريقة دائمة أو خالية من الأخطاء، أو خلو واجهات API من الفيروسات أو غيرها من المكونات الضارة، أو تلبية واجهات API أو محتوى API المقدم لكل احتياجاتك أو توقعاتك. ولا تقدم {platform_name} والمشاركون لدى {platform_name} أي ضمان على دقة أو اكتمال أو ديمومة أو جودة واجهات API أو أي محتوى من محتويات API، أو أن يظل أي محتوى معين من محتويات API متاحاً باستمرار. المقصود بالمشاركين لدى {platform_name} هم MIT، وهارفارد، والأعضاء الآخرين، والمؤسسات التي تقوم بتوفير المعلومات أو محتوى API أو خدمات API، والمدربون، وموظفوهم.

source: USE OF THE APIS, AND THE API CONTENT AND ANY SERVICES OBTAINED FROM OR THROUGH THE APIS, IS AT YOUR OWN RISK. YOUR ACCESS TO OR DOWNLOAD OF INFORMATION, MATERIALS OR DATA THROUGH THE APIS IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH INFORMATION, MATERIALS OR DATA, UNLESS OTHERWISE EXPRESSLY PROVIDED FOR IN THE {platform_name} PRIVACY POLICY.
ar: استخدامك لواجهات API ومحتوى API وأي خدمات يتم الحصول عليها من خلال واجهات API يكون على مسؤوليتك الخاصة. وصولك إلى وتنزيلك للمعلومات، أو المواد، أو البيانات، من خلال واجهات API أو تحميلها يكون بناءً على تقديرك الشخصي، وعلى مسؤوليتك وتتحمل وحدك المسؤولية عن أي ضرر قد يلحق بممتلكاتك (بما في ذلك نظام الحاسوب الخاص بك) أو أي فقدان للبيانات ينتج عن تحميل أو استخدام مثل هذه المواد أو البيانات، ما لم يُذكر خلاف ذلك بشكل صريح في سياسة الخصوصية لدى {platform_name}.

source: TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AGREE THAT NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL BE LIABLE TO YOU FOR ANY LOSS OR DAMAGES, EITHER ACTUAL OR CONSEQUENTIAL, ARISING OUT OF OR RELATING TO THE TERMS, OR YOUR (OR ANY THIRD PARTY'S) USE OF OR INABILITY TO USE THE APIS OR ANY API CONTENT, OR YOUR RELIANCE UPON INFORMATION OBTAINED FROM OR THROUGH THE APIS, WHETHER YOUR CLAIM IS BASED IN CONTRACT, TORT, STATUTORY OR OTHER LAW.
ar: إلى أقصى حد يسمح به القانون المعمول به، أنت توافق على عدم تحمل {platform_name} أو أي من المشاركين لدى {platform_name} لأي مسؤولية تجاهك عن أي خسارة أو أضرار، سواء كانت فعلية أو مترتبة على شيء آخر، تنشأ من أو تتعلق بهذه البنود، أو استخدامك (أو استخدام أي طرف ثالث) أو عدم القدرة على استخدام واجهات API أو أي محتوى من محتويات API، أو اعتمادك على المعلومات التي يتم الحصول عليها من أو عبر واجهات API، سواء كانت مطالبتك قائمة على عقد، أو مسؤولية تقصيرية، أو قانونية، أو أي قانون آخر.

source: IN PARTICULAR, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL HAVE ANY LIABILITY FOR ANY CONSEQUENTIAL, INDIRECT, PUNITIVE, SPECIAL, EXEMPLARY OR INCIDENTAL DAMAGES, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT {platform_name} OR ANY OF THE {platform_name} PARTICIPANTS HAS BEEN NEGLIGENT OR OTHERWISE AT FAULT (INCLUDING, BUT NOT LIMITED TO, CLAIMS FOR DEFAMATION, ERRORS, LOSS OF PROFITS, LOSS OF DATA OR INTERRUPTION IN AVAILABILITY OF DATA).
ar: وعلى وجه الخصوص، وإلى أقصى حد يسمح به القانون المعمول به، لا تتحمل {platform_name} أو أي من المشاركين لدى {platform_name} أي مسئولية عن أي أضرار المترتبة، أو غير المباشرة، أو العقابية، أو الخاصة، أو التحذيرية، أو العرضية، سواء كانت متوقعة أو غير متوقعة، وسواء كانت {platform_name} أو أي من المشاركين لدى {platform_name} مهملين أو مقصرين من أي ناحية (بما في ذلك وعلى سبيل المثال لا الحصر، المطالبات بتهمة التشهير، أو الأخطاء، أو خسارة الأرباح، أو فقدان البيانات، أو حدوث انقطاع في توافر البيانات).

source: CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.
ar: بعض قوانين البلدان لا تسمح بفرض قيود على الضمانات الضمنية أو استثناء أو تقييد بعض الأضرار. إذا كانت هذه القوانين تنطبق عليك، فإن بعض أو كل ما سبق من إخلاءات للمسؤولية، أو استثناءات، أو قيود قد لا تنطبق عليك، وقد تكون لديك حقوق إضافية.

source: The APIs and API Content may include hyperlinks to sites maintained or controlled by others and not affiliated with or under the control of {platform_name}. {platform_name_capitalized} and the {platform_name} Participants are not responsible for and do not routinely screen, approve, review or endorse the contents of or use of any of the products or services that may be offered at these third-party sites. If you decide to access linked third-party websites, you do so at your own risk.
ar: يمكن أن تشمل واجهات API ومحتوى API على روابط مواقع خارجية تقوم جهات أخرى غير تابعة ل{platform_name} بصيانتها أو إدارتها. لا تتحمل {platform_name_capitalized} أو المشاركون لدى {platform_name} أي مسؤولية عنها، ولا تقوم بترشيح، أو اعتماد، أو مراجعة، أو إقرار محتويات أي من المنتجات أو الخدمات التي قد يتم تقديمها في هذه المواقع أو استخدامها. إذا قررت الدخول إلى مواقع أطراف أخرى عبر هذه الروابط، فإنك تقوم بذلك على مسؤوليتك الشخصية.
