Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: Add your post to a relevant topic to help others find it. (Required)
ar: أضف ردك للموضوع ذو الصلة لمساعدة الآخرين في العثور عليه. (مطلوب)

source: Discussion Home
ar: الصفحة الرئيسيّة للمناقشة

source: How to use %(platform_name)s discussions
ar: كيفية استخدام نقاشات %(platform_name)s

source: Find discussions
ar: إيجاد النقاشات

source: Use the All Topics menu to find specific topics.
ar: استخدم قائمة "كل الموضوعات" لتجد موضوعات معينة.

source: Search all posts
ar: البحث في كافّة الموضوعات

source: Filter and sort topics
ar: ترشيح وتصنيف المواضيع

source: Engage with posts
ar: شارك في المنشورات

source: Vote for good posts and responses
ar: صوّت للردود والمنشورات الجيّدة

source: Report abuse, topics, and responses
ar: أبلغ عن أساءة أو مواضيع أو ردود

source: Follow or unfollow posts
ar: تابع أو الغِ متابعة المواضيع

source: Receive updates
ar: تلقَّ أخبار المواضيع

source: Toggle Notifications Setting
ar: بدِّل إعداد الإشعارات

source: Check this box to receive an email digest once a day notifying you about new, unread activity from posts you are following.
ar: اختر هذا المربّع لتتلقّى خلاصة بريدية واحدة يوميًّا تحوي أخبار الأنشطة الجديدة وغير المقروءة في المواضيع التي تتابعها.

source: All Posts
ar: كل المنشورات

source: username or email
ar: اسم المستخدم أو البريد الإلكتروني:

source: course id
ar: معرِّف المساق

source: No results
ar: لا نتائج

source: Course Key
ar: مفتاح المساق

source: Status
ar: الحالة

source: Download URL
ar: نزِّل الرابط

source: Grade
ar: العلامة

source: Last Updated
ar: آخر تحديث

source: Download the user's certificate
ar: نزِّل شهادة المستخدم

source: Not available
ar: غير متاح

source: Regenerate
ar: أعد الإنشاء

source: Regenerate the user's certificate
ar: أعِد إنشاء شهادة المستخدم

source: Generate
ar: أنشئ

source: Generate the user's certificate
ar: أنشئ شهادة المستخدم

source: Current enrollment mode:
ar: وضع التسجيل الحالي:

source: New enrollment mode:
ar: وضع التسجيل الجديد:

source: Reason for change:
ar: أسباب التغيير:

source: Choose One
ar: اختر واحدًا

source: Explain if other.
ar: وضِّح أكثر إذا اخترت "غير ذلك".

source: Submit enrollment change
ar: اعتمد تغيير التسجيل

source: Username or email address
ar: اسم المستخدم أو البريد الإلكتروني

source: Course ID
ar: معرِّف المساق

source: Course Start
ar: موعد بدء المساق

source: Course End
ar: موعد انتهاء المساق

source: Upgrade Deadline
ar: حدِّث الموعِد النهائيّ

source: Verification Deadline
ar: الموعد النهائي للتوثيق

source: Enrollment Date
ar: تاريخ التسجيل

source: Enrollment Mode
ar: وضع التسجيل

source: Verified mode price
ar: تكلفة إصدار شهادة موثّقة

source: Reason
ar: السبب

source: Last modified by
ar: آخر مّن عدَّل:

source: N/A
ar: لا ينطبق

source: Change Enrollment
ar: غيِّر التسجيل

source: Date Joined
ar: تاريخ الانضمام

source: Password Status
ar: حالة كلمة المرور

source: Disable Account
ar: إيقاف الحساب

source: Your team could not be created.
ar: تعذَّر إنشاء فريقك

source: Your team could not be updated.
ar: تعذَّر تحديث فريقك

source: Enter information to describe your team. You cannot change these details after you create the team.
ar: يُرجى إدخال معلومات لوصف فريقك. لا يمكنك تعديل هذه التفاصيل بعد إنشاء الفريق.

source: Optional Characteristics
ar: الخصائص الاختيارية

source: Help other learners decide whether to join your team by specifying some characteristics for your team. Choose carefully, because fewer people might be interested in joining your team if it seems too restrictive.
ar: ساعد المتعلّمين الآخرين في اتخاذ القرار بالانضمام إلى فريق أم لا وذلك بتحديد بعض الخصائص المميّزة لفريقك. اخترها بحذر إذ قد يهتم عدّد أقل من الأشخاص بالانضمام إلى فريقك في حال وجود كثير من القيود.

source: Create team.
ar: أنشئ فريقًا.

source: Update team.
ar: عدّل فريقًا.

source: Cancel team creating.
ar: إلغاء عملية تحديث الفريق

source: Cancel team updating.
ar: إلغاء عملية تحديث الفريق

source: Instructor tools
ar: أدوات المدرِّس

source: Delete Team
ar: حذف الفريق

source: Edit Membership
ar: تعديل العضويّة

source: Are you having trouble finding a team to join?
ar: هل يصعب عليك العثور على فريق لتنضمّ إليه؟

source: Join Team
ar: الانضمام إلى الفريق

source: Team Details
ar: معلومات الفريق

source: You are a member of this team.
ar: أنت عضو في هذا الفريق

source: Team member profiles
ar: صفحات أعضاء الفريق

source: Team capacity
ar: سعة الفريق

source: Leave Team
ar: ترك الفريق

source: Donate
ar: تبرَّع

source: There was an error retrieving preview results for this catalog. Please check that your query is correct and try again.
ar: حدث خطأ أثناء جلب نتائج المعاينة لهذا الدليل. يُرجى التحقق من صحة استعلامك وإعادة المحاولة.

source: This catalog's courses:
ar: مساقات هذا الدليل:

source: Start Date
ar: تاريخ البدء

source: Due Date
ar: تاريخ الاستحقاق

source: remove all
ar: حذف الكل

source: toggle chapter %(displayName)s
ar: تبديل الفصل %(displayName)s

source: Section
ar: القسم

source: Remove chapter %(chapterDisplayName)s
ar: إزالة الفصل %(chapterDisplayName)s

source: remove
ar: أزِل

source: toggle subsection %(displayName)s
ar: تبديل القسم الفرعي %(displayName)s

source: Subsection
ar: القسم الفرعي

source: Remove subsection %(subsectionDisplayName)s
ar: إزالة القسم الفرعي %(subsectionDisplayName)s

source: Remove unit %(unitName)s
ar: إزالة الوحدة %(unitName)s

source: You still need to visit the %(display_name)s website to complete the credit process.
ar: مازلت بحاجة لزيارة الموقع %(display_name)s لإتمام العملية المتعلّقة باعتماد الساعات الدراسيّة.

source: To finalize course credit, %(display_name)s requires %(platform_name)s learners to submit a credit request.
ar: لاستكمال عملية اعتماد الساعات الدراسيّة، يوجب %(display_name)s على متعلّمي %(platform_name)s التقدّم بطلب اعتماد الساعات الدراسيّة.

source: Get Credit
ar: اعتمد الساعات الدراسيّة

source: Thank you %(full_name)s! We have received your payment for %(course_name)s.
ar: شكراً لك يا %(full_name)s! لقد وصلنا المبلغ الذي دفعته للاستفادة من %(course_name)s.

source: Please print this page for your records; it serves as your receipt. You will also receive an email with the same information.
ar: تُرجى طباعة هذه الصفحة للاحتفاظ بها في سجلّاتك، حيث ستكون بمثابة إيصالك. وستستلم أيضًا رسالة بريد إلكتروني تحوي هذه المعلومات نفسها.

source: Order No.
ar: رقم الطلب

source: Amount
ar: عدد الساعات المعتمدة

source: Total
ar: المجموع

source: Please Note
ar: من فضلك لاحظ

source: Crossed out items have been refunded.
ar: تم استرداد قيمة العناصر المشطوبة.

source: Billed to
ar: إصدار الفاتورة لـ

source: No receipt available
ar: ليس هناك إيصال

source: Go to Dashboard
ar: اذهب إلى لوحة المعلومات

source: If you don't verify your identity now, you can still explore your course from your dashboard. You will receive periodic reminders from {platformName} to verify your identity.
ar: إذا لن تقم بالتحقق من هويتك الآن، فسيظلُّ بإمكانك استكشاف الدورة من خلال صفحة "لوحتي التعليمية". سوف تتلقى رسائل تذكير دورية من {platformName} للتحقق من هويتك.

source: Want to confirm your identity later?
ar: هل تريد تأكيد هويّتك لاحقًا؟

source: Verify Now
ar: تحَّق الآن

source: Mark Exam As Completed
ar: أشِر إلى الامتحان بـ"تمّ"

source: You are taking "{exam_link}" as {exam_type}.
ar: انت تقوم بتقديم "{exam_link}" ك{exam_type}.

source: a timed exam
ar: امتحان محدد بوقت

source: The timer on the right shows the time remaining in the exam.
ar: المؤقت الموجود على يسار الشاشة يعرض الوقت المتبقي للتقديم

source: To receive credit for problems, you must select "Submit" for each problem before you select "End My Exam".
ar: من أجل الحصول على نقاط في مسألة معينة عليك اختيار "إرسال" لكل مسألة قبل اختيار "انهِ الامتحان".

source: Show More
ar: اعرض المزيد

source: Show Less
ar: اعرض اقل

source: Exam timer and end exam button
ar: مؤقت الامتحان وزر إنهاء الامتحان

source: End My Exam
ar: انهِ الامتحان

source: Hide Timer
ar: إخفاء الموقت

source: LEARN MORE
ar: اعرف المزيد

source: Starts: %(start_date)s
ar: يبدأ بتاريخ:%(start_date)s

source: Starts
ar: تاريخ البداية

source: Clear All
ar: امسح الكلّ

source: Highlighted text
ar: النص المظلَّل

source: Note
ar: ملاحظة

source: You commented...
ar: كان تعليقك...

source: Noted in:
ar: لوحِظ في:

source: Last Edited:
ar: آخر مراجعة في:

source: Clear search results
ar: امسح نتائج البحث

source: Click to edit
ar: انقر للتعديل

source: Order Number
ar: رقم الطلب

source: Date Placed
ar: تاريخ الإضافة

source: Cost
ar: التكلفة

source: Order Details
ar: تفاصيل الطلبية

source: for
ar: لـ

source: Product Name
ar: اسم المنتج

source: {currentCountOpeningTag}{currentCharacterCount}{currentCountClosingTag} of {maxCharacters}
ar: {currentCountOpeningTag}{currentCharacterCount}{currentCountClosingTag} من {maxCharacters}

source: Financial Assistance Application
ar: طلب دعم مالي

source: About You
ar: نبذة عنك

source: The following information is already a part of your {platform} profile. We\'ve included it here for your application.
ar: المعلومات التالية جزء من ملفّك الشخصي في {platform} بالفِعل، وقد ضمنّاه هنا كجزء من طلبك.

source: Email address
ar: عنوان البريد الإلكتروني

source: Legal name
ar: الاسم القانوني

source: Country of residence
ar: بلد الإقامة

source: Back to {platform} FAQs
ar: العودة إلى الأسئلة الشائعة لمنصّة {platform}

source: Submit Application
ar: تقديم الطلب

source: Thank you for submitting your financial assistance application for {course_name}! You can expect a response in 2-4 business days.
ar: نشكرك لتقديمك طلب دعم مالي للمساق {course_name}! يمكنك أن تتوقع استلام الردّ خلال 2-4 أيام عمل.

source: Bulk Exceptions
ar: مجموعة من الاستثناءات

source: Upload a comma separated values (.csv) file that contains the usernames or email addresses of learners who have been given exceptions. Include the username or email address in the first comma separated field. You can include an optional note describing the reason for the exception in the second comma separated field.
ar: يُرجى تحميل ملف بصيغة (.csv) ذا قيم مفصولة برمز الفاصلة، يحوي أسماء وعناوين البريد الإلكتروني الخاصة بالمتعلّمين الحاصلين على استثناءات. ضمّن اسم المستخدم وعنوان البريد الإلكتروني في الحقل الأول (أي قبل الفاصلة. يمكنك تضمين ملاحظة اختيارية تصف سبب منح الاستثناء في الحقل الثاني المفصول بفاصلة.

source: Upload a CSV file
ar: ارفع ملف CSV

source: Add to Exception List
ar: إضف إلى لائحة الاستثناءات

source: To invalidate a certificate for a particular learner, add the username or email address below.
ar: أضف اسم المستخدم أو عنوان البريد الإلكتروني أدناه لإلغاء شهادة ممنوحة لمتعلّم معيّن.

source: Add notes about this learner
ar: أضف ملاحظات تخصّ هذا المتعلّم

source: Invalidate Certificate
ar: إلغاء شهادة

source: Student
ar: الطالب

source: Invalidated By
ar: ألغاها

source: Invalidated
ar: لاغية

source: Notes
ar: ملاحظات

source: Remove from Invalidation Table
ar: أزِلها من جدول عمليات الإلغاء

source: Individual Exceptions
ar: استثناءات منفردة

source: Enter the username or email address of each learner that you want to add as an exception.
ar: أدخل اسم المستخدم أو عنوان البريد الإلكتروني لكل متعلّم ترعب بإضافته كاستثناء.

source: Student email or username
ar: اسم الطالب او بريده الالكترونيّ

source: Free text notes
ar: ملاحظات نصيّة حرّة

source: Generate Exception Certificates
ar: أنشئ شهادات استثناء

source: All users on the Exception list who do not yet have a certificate
ar: كافة المستخدمين على قائمة الاستثناء ليس لديهم شهادة بعد

source: All users on the Exception list
ar: كافة المستخدمين في قائمة الاستثناء

source: User Email
ar: البريد الإلكتروني الخاص بالمستخدم

source: Exception Granted
ar: اعتُمِد الاستثناء

source: Certificate Generated
ar: أُنشِئَت الشهادة

source: Remove from List
ar: أزِل من القائمة

source: Divided
ar: مقسّمة

source: Manage Learners
ar: نظّم الطلّاب

source: Add learners to this cohort
ar: أضف الطلّاب لهذه الفئة

source: Note: Learners can be in only one cohort. Adding learners to this group overrides any previous group assignment.
ar: ملاحظة: يمكن للطلّاب أن يكونوا ضمن فئة واحدة فقط. إضافة الطلّاب إلى هذه المجموعة سيلغي واجبات المجموعة السابقة.

source: Enter email addresses and/or usernames, separated by new lines or commas, for the learners you want to add. *
ar: أدخل عنوان البريد الإلكتروني و/أو اسم المستخدم، مفصولين بخطوط جديدة أو فواصل، لإضافة الطلّاب.

source: (Required Field)
ar: (حقل مطلوب)

source: e.g. johndoe@example.com, JaneDoe, joeydoe@example.com
ar: مثلًا: ahmad@example.com، Abdullah، عبدالرحيم، i_love_edraak@example.com

source: You will not receive notification for emails that bounce, so double-check your spelling.
ar: لن تتلقّى إشعارًا بعناوين الطلاب الاكترونية الخاطئة التي لم تضف الى الشعبة، لذا تحقّق جيدًا من عدم وجود أخطاء إملائية.

source: Add Learners
ar: أضف الطلّاب

source: Add a New Cohort
ar: إضافة شعبة جديدة

source: Enter the name of the cohort
ar: أدحِل اسم الشعبة

source: Cohort Name
ar: اسم الشعبة

source: Cohort Assignment Method
ar: طريقة توزيع الشعب

source: Automatic
ar: تلقائي

source: Manual
ar: يدوي

source: There must be one cohort to which students can automatically be assigned.
ar: يجب أن تتوفّر شعبة واحدة يتعيَّن فيها الطلّاب تلقائيًا.

source: Associated Content Group
ar: مجموعة محتوى مرتبطة

source: No Content Group
ar: لا توجد مجموعة محتوى

source: Select a Content Group
ar: اختر مجموعة محتوى

source: Choose a content group to associate
ar: اختر مجموعة محتوى لربطها

source: Not selected
ar: غير منتقاة

source: Deleted Content Group
ar: مجموعة محتوى محذوفة

source: {screen_reader_start}Warning:{screen_reader_end} The previously selected content group was deleted. Select another content group.
ar: {screen_reader_start}تحذير:{screen_reader_end} حّذفت مجموعة المحتوى المحدّدة سابقًا. اختر مجموعة محتوى أخرى.

source: {screen_reader_start}Warning:{screen_reader_end} No content groups exist.
ar: {screen_reader_start}تحذير:{screen_reader_end} لا توجد مجموعات محتوى.

source: Only the parent course staff of a CCX can create content groups.
ar: يمكن فقط لطاقم المساق الأصل لـ CCX إنشاء مجموعات المحتوى.

source: Create a content group
ar: أنشئ مجموعة محتوى

source: (contains %(student_count)s student)
ar: (تحوي %(student_count)s طالب)

source: Learners are added to this cohort only when you provide their email addresses or usernames on this page.
ar: لا يُضاف المتعلّمون إلى هذه الشعبة إلّا عند تحديد عنوان البريد الإلكتروني أو اسم المستخدم الخاص بكل واحدٍ منهم على في الصفحة.

source: What does this mean?
ar: ماذا يعني هذا؟

source: Learners are added to this cohort automatically.
ar: يُضاف المتعلّمون إلى هذه الشعبة تلقائيًّا.

source: Select a cohort
ar: اختر شعبة

source: Enable Cohorts
ar: فعّل الشُعب

source: Select a cohort to manage
ar: اختر شعبة لإدارتها.

source: View Cohort
ar: اعرض الشعبة

source: Assign learners to cohorts by uploading a CSV file
ar: ارفع ملف CSV لتوزيع الطلاب على الشعب

source: To review learner cohort assignments or see the results of uploading a CSV file, download course profile information or cohort results on the {link_start}Data Download{link_end} page.
ar: لتقييم واجبات طلّاب الشعبة ولترى نتئاج رفع ملف CSV، قم بتحميل معلومات ملف المساق أو نتائج الشعبة من خلال صفحة {link_start}تحميل المعلومات{link_end}.

source: Specify whether discussion topics are divided
ar: حددّ ما إذا كانت الموضوعات المطروحة للنقاش قد قسّمت.

source: Course-Wide Discussion Topics
ar: مواضيع نقاش على نطاق المساق

source: Select the course-wide discussion topics that you want to divide.
ar: اختر موضوعات النقاش على نطاق المساق التي تريد تقسيمها.

source: Content-Specific Discussion Topics
ar: مواضيع نقاش خاصة بمحتوى معين

source: Specify whether content-specific discussion topics are divided.
ar: حددّ ما إذا كانت الموضوعات على نظاق المساق المطروحة للنقاش قد قسّمت.

source: Always divide content-specific discussion topics
ar: دومًا قسّم موضوعات النقاش الخاصة بالمحتوى.

source: Divide the selected content-specific discussion topics
ar: قسّم موضوعات النقاش الخاصة بالمحتوى التي تم اختيارها.

source: No content-specific discussion topics exist.
ar: لا توجد مواضيع نقاش متعلقة بمحتوى معين.

source: Used
ar: مستخدَم

source: Valid
ar: صالح

source: Certificate Status:
ar: حالة الشهادة:

source: Certificate Purchased
ar: شهادة مشتراة

source: Change or Leave Session
ar: تغيير أو مغادرة الجلسة

source: You must select a session by {expiration_date} to access the course.
ar: يجب ان تختار الجلسة {expiration_date} للوصول الى محتويات المساق

source: You can no longer change sessions.
ar: لا تتمكن من تغيير الجلسات بعد الآن.

source: You can change sessions until {expiration_date}.
ar: يمكنك تغيير الجلسة حتى تاريخ {expiration_date}.

source: Final Grade
ar: العلامة النهائية

source: for {courseName}
ar: ل{courseName}

source: View Archived Course
ar: استعراض المساق المؤرشَف

source: View Course
ar: استعرض المساق

source: Select a session:
ar: اختر الجلسة

source: Enroll Now
ar: سجل الآن

source: Coming Soon
ar: قريبًا

source: Enrollment Opens on
ar: يُفتح باب الانضمام في

source: Not Currently Available
ar: غير متاحٍ الآن

source: More sessions coming soon.
ar: سيتم اصدار جلسات اخرى لهذا المساق

source: Change to a different session or leave the current session.
ar: قم باختيار جلسة اخرى او قم بمغادرة المساق

source: To access the course, select a session.
ar: لتصفح محتويات المساق قم باختيار جلسة

source: Session Selection Dropdown for {courseName}
ar: قائمة اختيار الجلسة ل{courseName}

source: {sessionDates} - Currently Selected
ar: {sessionDates} -المنتقاة حالياً

source: More sessions coming soon
ar: سيتم اصدار جلسات اخرى لهذا المساق

source: Leave the current session and decide later
ar: انهاء الجلسة الحالية واختيارالجلسة لاحقاً

source: You are not enrolled in any programs yet.
ar: أنت لست منضماً إلى أيّ برنامج بعد.

source: Explore Programs
ar: استكشف التخصصات

source: Browse recently launched courses and see what\'s new in your favorite subjects
ar: تصفَّح المساقات الجديدة واكتشف ما استجَدَّ في المواضيع المفضلة لديك

source: Explore New Programs
ar: استكشف تخصصات جديدة

source: Course
ar: المساقات

source: Completed
ar: استُكملت العملية

source: Remaining
ar: لم تستكمل العملية

source: %(programName)s Home Page.
ar: الصفحة الرئيسية ـ%(programName)s.

source: Your {program} Certificate
ar: شهادة {program} الخاصة بك

source: Open the certificate you earned for the %(title)s program.
ar: افتح الشهادة التي حصلت عليها لبرنامج %(title)s

source: View Program Record
ar: عرض سجل البرنامج

source: Congratulations!
ar: تهانينا!

source: Your Program Journey
ar: رحلتك في البرنامج التعليميّ

source: To complete the program, you must earn a verified certificate for each course.
ar: لإتمام البرنامج، عليك الحصول على شهادة مصدقة لكل مساق.

source: Upgrade All Remaining Courses (
ar: ترقية جميع المساقات المتبقية (

source: COURSES IN PROGRESS
ar: المساقات الجارية

source: REMAINING COURSES
ar: المساقات المتبقية

source: COMPLETED COURSES
ar: المساقات المكتملة

source: As you complete courses, you will see them listed here.
ar: عندما تنهي المساقات، ستجدهم مدرجين هنا.

source: Complete courses on your schedule to ensure you stand out in your field!
ar: أتمّ المساقات المجدولة لك لتضمن تميزك في مجالك!

source: {organization}\'s logo
ar: شعار {organization}

source: Needs verified certificate
ar: بحاجة لشهادة موثقة

source: Upgrade to Verified
ar: سجِّل للحصول على شهادة موثقة

source: New Address
ar: عنوان جديد

source: Change My Email Address
ar: تغيير عنوان البريد الإلكتروني

source: Reset Password
ar: تغيير كلمة المرور

source: Account Settings
ar: إعدادات الحساب

source: An error occurred. Please reload the page.
ar: حدث خطأ. تُرجى إعادة تحميل الصفحة.

source: Forgot password?
ar: هل نسيت كلمة المرور؟

source: Would you like to sign in using your %(providerName)s credentials?
ar: هل تريد الدخول باستخدام بيانات حسابك لدى %(providerName)s؟

source: Sign in using %(providerName)s
ar: الدخول باستخدام حساب %(providerName)s

source: Show me other ways to sign in or register
ar: أرِني طرقًا أخرى للدخول أو إنشاء الحساب

source: Sign in with Institution/Campus Credentials
ar: الدخول باستخدام بيانات الدخول إلى المؤسّسة/الجامعة

source: Choose your institution from the list below:
ar: اختر مؤسّستك من القائمة أدناه:

source: Back to sign in
ar: العودة إلى بوّابة الدخول

source: Register with Institution/Campus Credentials
ar: التسجيل باستخدام بيانات الدخول إلى المؤسّسة/الجامعة

source: Register through edX
ar: التسجيل من خلال "إدراك"

source: First time here?
ar: أول مرة لك هنا؟

source: Create an Account.
ar: أنشئ حسابًا.

source: Sign in to continue learning as {email}
ar: للاستمرار بالتعلم قم بتسجيل الدخول بإستخدام عنوان بريدك الإلكتروني التالي {email}

source: Sign in to continue learning
ar: للاستمرار بالتعلم قم بتسجيل الخول

source: You already have an edX account with your {enterprise_name} email address.
ar: لديك حساب على إدراك بعنوان {enterprise_name} الخاص بك

source: Going forward, your account information will be updated and maintained by {enterprise_name}.
ar: للمضي قدمًا ، سيتم تحديث معلومات حسابك وصيانتها بواسطة {enterprise_name}.

source: You can view your information or unlink from {enterprise_name} anytime in your Account Settings.
ar: بأمكانك مراجعة معلومات حسابك او فصل ربط حسابك من {enterprise_name} في اي وقت من خلال "اعدادات الحساب"

source: To continue learning with this account, sign in below.
ar: للاستمرارية بالتعلم من خلال ها الحساب قم بتسجيل الدخول

source: Sign In
ar: تسجيل الدخول

source: Sign in here using your email address and password, or use one of the providers listed below.
ar: ادخل من هنا باستخدام عنوان بريدك الإلكتروني وكلمة مرورك، أو من خلال أحد المزوِّدين المذكورين أدناه.

source: Sign in here using your email address and password.
ar: ادخل باستخدام بريدك الإلكتروني وكلمة مرورك.

source: If you do not yet have an account, use the button below to register.
ar: إذا لم تكن تملك حسابًا بعد، فاستخدِم الزرّ أدناه للتسجيل.

source: or sign in with
ar: أو ادخل باستخدام

source: Sign in with %(providerName)s
ar: ادخل باستخدام حساب %(providerName)s

source: Use my institution/campus credentials
ar: استخدِم بيانات دخولي إلى المؤسّسة/الجامعة

source: Password assistance
ar: المساعدة فيما يتعلق بكلمة المرور

source: Please enter your email address below and we will send you instructions for setting a new password.
ar: أدخِل عنوان بريدك الإلكتروني أدناه، وسنرسل لك تعليمات ضبط كلمة مرور جديدة.

source: Reset my password
ar: تغيير كلمة المرور

source: Already have an {platformName} account?
ar: لديك حساب {platformName} بالفعل؟

source: Sign in.
ar: تسجيل الدخول

source: Create an account using
ar: أنشئ حساباً باستخدام

source: Create account using %(providerName)s.
ar: أنشئ حساباً باستخدام حساب %(providerName)s.

source: or create a new one here
ar: أو أنشئ حساباً جديداً من هنا

source: Create an Account
ar: أنشئ حسابًا

source: Support education research by providing additional information
ar: دعم البحوث التعليمية من خلال توفير معلومات إضافية

source: Congratulations! You are now verified on %(platformName)s!
ar: تهانينا! هويّتك موثّقة الآن على %(platformName)s!

source: You are now enrolled as a verified student for:
ar: أنت الآن مسجِّل كطالب موثَّق لدى:

source: A list of courses you have just enrolled in as a verified student
ar: قائمة المساقات التي سجّلت فيها لتوّك كطالب موثَّق

source: Explore your course!
ar: استكشف مساقك!

source: Go to your Dashboard
ar: اذهب إلى صفحة "لوحتي التعليمية"

source: Verified Status
ar: يجري التحقّق منها

source: Thank you for submitting your photos. We will review them shortly. You can now sign up for any %(platformName)s course that offers verified certificates. Verification is good for one year. After one year, you must submit photos for verification again.
ar: نشكرك على تقديم صورك. سنراجعها قريبًا. يمكنك الآن التسجيل في أيً من مساقات %(platformName)s التي تمنح شهادات موثَّّقة. يسري مفعول عملية التحقّق لمدّة عام واحد، وبعد انقضائه يجب أن تقدّم الصور للتحقّق منها مجدّدًا.

source: Error:
ar: خطأ:

source: What You Need for Verification
ar: ما الذي تحتاجه للتوثيق

source: Webcam
ar: كاميرا الويب
