Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: You have been unenrolled from the course %(course_name)s by a member of the course staff. Please disregard the invitation previously sent.
ar: قام أحد أفراد طاقم المساق بإلغاء تسجيلك من مساق %(course_name)s. الرجاء إهمال الدعوة التي أُرسلت إليك سابقاً.

source: Dear Student,
ar: عزيزي الطالب،

source: You have been unenrolled from %(course_name)s
ar: تم إلغاء تسجيلك من %(course_name)s

source: You have been unenrolled from %(course_name)s at %(site_name)s by a member of the course staff. This course will no longer appear on your %(site_name)s dashboard.
ar: تمَّ إلغاء تسجيلك من %(course_name)s في %(site_name)s من قِبَل أحد أفراد طاقم المساق. هذا المساق لن يظهر مجدداً على سطح المكتب في %(site_name)s

source: Your other courses have not been affected.
ar: لم يؤثر ذلك على باقي مساقاتك.

source: This email was automatically sent from %(site_name)s to %(full_name)s
ar: أُرسِلَت هذه الرسالة إليًّا من %(site_name)s إلى %(full_name)s

source: You have been enrolled in %(course_name)s
ar: لقد تم تسجيلك في مساق %(course_name)s

source: You have been enrolled in %(course_name)s at %(site_name)s by a member of the course staff. This course will now appear on your %(site_name)s dashboard.
ar: لقد سجّلك احد أعضاء طاقم مساق %(course_name)s في %(site_name)s في المساق. يفترضّ أن يظهر المساق الآن في صفحة "لوحتي التعليمية" الخاصة بك في %(site_name)s

source: Access the Course Materials Now
ar: الوصول لمواد المساق الآن

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s
ar: لقد قام أحد أفراد طاقم المساق بإلغائك من مجموعة مختبري الإصدار التجريبي للمساق %(course_name)s في %(site_name)s

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff.
ar: لقد قام أحد أفراد طاقم المساق بإلغائك من مجموعة مختبري الإصدار التجريبي للمساق %(course_name)s في %(site_name)s

source: This course will remain on your dashboard, but you will no longer be part of the beta testing group.
ar: هذا المساق سيبقى ظاهراً على سطح المكتب، ولكنك لن تكون جزءاً من مجموعة الاختبار التجريبي

source: You have been removed as a beta tester for %(course_name)s at %(site_name)s by a member of the course staff. This course will remain on your dashboard, but you will no longer be part of the beta testing group.
ar: لقد قام أحد أفراد طاقم المساق بإلغائك من مجموعة مختبري الإصدار التجريبي للمساق %(course_name)s في %(site_name)s. سيبقى المساق على صفحة "لوحتي التعليمية" الخاصة بك، لكنك لن تكون ضمن مجموعة اختبار بيتا.

source: You have been removed from a beta test for %(course_name)s
ar: لقد تم إلغاؤك من اختبار بيتا للمساق %(course_name)s

source: Signed Out
ar: خرجت

source: You have signed out.
ar: لقد خرَجت

source: If you are not redirected within 5 seconds, <a href="%(target)s">click here to go to the home page</a>.
ar: إذا لم يتم تحويلك خلال ثوانٍ، <a href="%(target)s">فانقُر هنا للذهاب إلى الصفحة الرئيسيّة</a>.

source: Skip to main content
ar: انتقل إلى المحتوى الرئيسي

source: Authorize
ar: التخويل

source: The above application requests the following permissions from your account:
ar: يطلب التطبيق أعلاه الصلاحيات التالية من حسابك:

source: These permissions will be granted for data from your courses associated with the following content providers:
ar: سيتم منح الوصول للبيانات من مساقاتك المرتبطة بمزوّدي المحتوى التاليين:

source: Please click the 'Allow' button to grant these permissions to the above application. Otherwise, to withhold these permissions, please click the 'Cancel' button.
ar: يُرجى النقر على زر "اسمَح" لمنح هذه الصلاحيات للتطبيق أعلاه. إذا كنت ترغب بمنع هذه الصلاحيات، انقر على زر "الغِ".

source: Cancel
ar: الغِ

source: Allow
ar: اسمَح

source: Error
ar: خطأ

source: Last modified:
ar: آخر تعديل:

source: See all children
ar: أظهِر كل الفروع

source: This article was last modified:
ar: آخر مرّة عُدِّلَت فيها هذه المقالة:

source: Add new article
ar: أضِف مقالًا جديدًا

source: Create article
ar: أنشئ مقالًا

source: Go back
ar: ارجِع

source: Delete article
ar: احذف المقال

source: Delete
ar: احذِف

source: You cannot delete a root article.
ar: لا يمكنك حذف مقال رئيسي.

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
ar: لا يمكنك حذف هذا المقال لأنّه ليس لديك صلاحية حذف المقالات التي لها فروع. تُرجى محاولة حذف المقالات الفرعية يدويًّا واحدة تلو الأخرى.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
ar: أنت تُقدِم على حذف مقال، وهذا يعني أنّ فروعه ستُحذَف أيضًا. فإذا اخترت التخلّص منه، فستفقد فروعه أيضًا!

source: Articles that will be deleted
ar: المقالات التي ستُحذَف

source: ...and more!
ar: ... وأكثر من ذلك!

source: You are deleting an article. Please confirm.
ar: أنت مقدِم على حذف مقال. يُرجى التأكيد.

source: Edit
ar: عدِّل

source: Save changes
ar: احفظ التغييرات

source: Preview
ar: معاينة

source: Close
ar: أغلِق

source: Wiki Preview
ar: معاينة صفحة الويكي

source: window open
ar: النافذة المفتوحة

source: Back to editor
ar: العودة إلى محرّر النصوص

source: History
ar: السجل

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
ar: انقر على أيّ مراجعة لرؤية قائمة الأسطر المعدّلة، وانقر على زرّ المعاينة لرؤية كيف يبدو المقال في هذه المرحلة. ويمكنك في أسفل هذه الصفحة أن تختار مراجعة معيّنة أو تدمج مراجعة قديمة مع المراجعة الحالية.

source: (no log message)
ar: (لا توجد رسالة سجل)

source: Preview this revision
ar: معاينة هذه المراجعة

source: Auto log:
ar: سجل تلقائي:

source: Change
ar: تغيير

source: Merge selected with current...
ar: ادمج اختيارك مع الحالي...

source: Switch to selected version
ar: تحوّل إلى الإصدار المختار

source: Wiki Revision Preview
ar: عاين مراجعة ويكي

source: Back to history view
ar: عُد إلى عرض التاريخ

source: Switch to this version
ar: تحوّل إلى هذه النسخة

source: Merge Revision
ar: ادمج المراجعة

source: Merge with current
ar: ادمج مع الحالية

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
ar: عندما تَدمِج مراجعة معيّنة مع المراجعة الحالية، ستُحفَظ جميع البيانات في كلتي النسختين وتُدمَج في موقعها التقريبي من كل مراجعة.

source: After this, it's important to do a manual review.
ar: بعد القيام بهذا، من المهم مراجعتها يدويًا.

source: Create new merged version
ar: أنشئ إصدارًا جديدًا بالدمج

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
ar: يجب عليك <a href="%(login_url)s">الدخول</a> أو <a href="%(signup_url)s">التسجيل</a> ليتسنّى لك استخدام هذه الوظيفة.

source: You need to log in or sign up to use this function.
ar: يجب عليك أن تدخل أو تسجِّل لتتمكن من استخدام هذه الوظيفة.

source: Wiki Cheatsheet
ar: ملخص طريقة استخدام الويكي

source: Wiki Syntax Help
ar: المساعدة في صياغة الويكي

source: This wiki uses <strong>Markdown</strong> for styling. There are several useful guides online. See any of the links below for in-depth details:
ar: تستخدم صفحة الويكي هذه <strong>لغة ماركداون</strong> لتنسيق النص. وعلى الإنترنت العديد من الأدلّة الإرشادية المفيدة. تُرجى زيارة أيٍّ من الروابط أدناه لمزيد من التفاصيل:

source: Markdown: Basics
ar: ماركداون: الأساسيات

source: Quick Markdown Syntax Guide
ar: دليل سريع لصياغة ماركداون

source: Miniature Markdown Guide
ar: دليل مصغّّر للغة ماركداون

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
ar: لإنشاء مقال جديد على صفحة الويكي، ابدأ بإنشاء رابط له. النقر على الرابط يفتح صفحة إنشاء المقال.

source: [Article Name](wiki:ArticleName)
ar: [اسم المقال](wiki:اسم_المقال)

source: %(platform_name)s Additions:
ar: إضافات %(platform_name)s:

source: Math Expression
ar: تعبير رياضي

source: Useful examples:
ar: أمثلة مفيدة:

source: Wikipedia
ar: ويكيبيديا

source: %(platform_name)s Wiki
ar: ويكي %(platform_name)s

source: Huge Header
ar: عنوان كبير

source: Smaller Header
ar: عنوان أصغر

source: *emphasis* or _emphasis_
ar: *خط بارز* أو _خط بارز_

source: **strong** or __strong__
ar: **خط عريض** أو __خط عريض__

source: Unordered List
ar: قائمة غير مرتبة

source: Sub Item 1
ar: العنصر الفرعي 1

source: Sub Item 2
ar: العنصر الفرعي 2

source: Ordered
ar: مرتّبة

source: List
ar: قائمة

source: Quotes
ar: اقتباسات

source: Markdown syntax is allowed. See the %(start_link)scheatsheet%(end_link)s for help.
ar: يُسمح بالكتابة بصيغة ماركداون. انظر إلى %(start_link)s طريقة الكتابة %(end_link)s لمزيد من المساعدة.

source: Attachments
ar: المرفقات

source: Upload new file
ar: ارفع ملفًا جديدًا

source: Search and add file
ar: ابحث وأضف ملفًا

source: Upload File
ar: ارفع ملفًا

source: Upload file
ar: ارفع ملفًا

source: Search files and articles
ar: ابحث عن ملفات أو مقالات

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
ar: يمكنك أن تعيد استخدام ملفّات من مقالات أخرى. وهذه الملفات عرضة للتحديث في مقالات أخرى، ما قد يكون أمرًا جيّدًا أو غير جيّد.

source: Search
ar: بحث

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
ar: الملفات التالية متاحة لهذا المقال. انسخ وسم ماركداون للإشارة مباشرةً إلى ملف معين مذكور في المقال.

source: Markdown tag
ar: وسم ماركداون

source: Uploaded by
ar: رفعه

source: Size
ar: الحجم

source: File History
ar: تاريخ الملف

source: Detach
ar: افصل

source: Replace
ar: استبدِل

source: Restore
ar: استعد

source: anonymous (IP logged)
ar: مجهول (حُفِظ عنوان IP)

source: File history
ar: تاريخ الملف

source: revisions
ar: مراجعات

source: There are no attachments for this article.
ar: لا توجد ملفّات مرفقة بهذا المقال.

source: Previewing revision:
ar: تجري معاينة المراجعة:

source: Previewing a merge between two revisions:
ar: تجري معاينة عملية دمج بين مراجعتين:

source: This revision has been deleted.
ar: تم حذف هذه المراجعة.

source: Restoring to this revision will mark the article as deleted.
ar: ستشير العودة إلى هذه المراجعة أنّ المقال قد حُذِف

source: ACE Common
ar: ACE المشتركة

source: Go to %(platform_name)s Home Page
ar: الصفحة الرئيسية لمنصّة %(platform_name)s

source: Sign In
ar: تسجيل الدخول

source: %(platform_name)s on LinkedIn
ar: %(platform_name)s على لينكد إن

source: %(platform_name)s on Twitter
ar: %(platform_name)s على تويتر

source: %(platform_name)s on Facebook
ar: %(platform_name)s على فيسبوك

source: %(platform_name)s on Google Plus
ar: %(platform_name)s على جوجل بلاس

source: %(platform_name)s on Reddit
ar: %(platform_name)s على راديت

source: Download the iOS app on the Apple Store
ar: نزل تطبيق iOS على متجر أبل

source: Download the Android app on the Google Play Store
ar: نزّل تطبيق أندرويد على متجر جوجل بلاي

source: Our mailing address is
ar: عنواننا البريدي هو

source: edX Email
ar: بريد إدراك الإلكتروني

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate. Upgrade by %(user_schedule_upgrade_deadline_time)s.
ar: لا تفوت فرصة إبراز المعرفة والمهارات الجديدة التي اكتسبتها عن طريق الحصول على شهادة موثّقة. قم بالترقية قبل %(user_schedule_upgrade_deadline_time)s.

source: Upgrade Now
ar: طوّر اشتراكك الآن

source: Once you have approved this request, go to {catalog_admin_url} to set up a catalog for this user.
ar: بمجرد الانتهاء من الموافقة على هذا الطلب، انتقل إلى {catalog_admin_url} لإنشاء كتالوج لهذا المستخدم.

source: Organization Name
ar: اسم المنظمة

source: Organization Address
ar: عنوان المؤسسة

source: Describe what your application does.
ar: صف ما يفعله تطبيقك.

source: The URL of your organization's website.
ar: رابط موقع شركتك.

source: The name of your organization.
ar: اسم شركتك.

source: The contact address of your organization.
ar: عنوان التواصل مع شركتك.

source: The following users do not exist: {usernames}.
ar: المستخدمون التالية أسماؤهم غير موجودين: {usernames}.

source: Comma-separated list of usernames which will be able to view this catalog.
ar: قائمة مفصولة بفاصلة لأسماء المستخدمين الذين سيكون بإمكانهم رؤية هذا الكتالوج.

source: Denied
ar: مرفوض

source: Approved
ar: موافق عليه

source: Status of this API access request
ar: حالة طلب الوصول إلى واجهة برمجة التطبيقات API.

source: The URL of the website associated with this API user.
ar: رابط الموقع المرتبط بمستخدم واجهة برمجة التطبيقات هذا.

source: The reason this user wants to access the API.
ar: السبب وراء رغبة هذا المستخدم باستخدام واجهة برمجة التطبيقات.

source: API access request from {company}
ar: طلب وصول لواجهة برمجة التطبييقات من {company}

source: API access request
ar: طلب وصول لواجهة برمجة التطبييقات

source: I, and my organization, accept the {link_start}{platform_name} API Terms of Service{link_end}.
ar: انا وشركتي وافقنا على {link_start}{platform_name} بنود واجهة برمجة التطبيقات {link_end}.

source: Bookmarks
ar: الإشارات المرجعية

source: An error has occurred. Please try again.
ar: حدث خطأ. تُرجى إعادة المحاولة.

source: No data provided.
ar: لم تُقدّم أي بيانات.

source: Parameter usage_id not provided.
ar: لم يُقدّم المعامل ’usage_id‘

source: Invalid usage_id: {usage_id}.
ar: قيمة usage_id غير صالحة: {usage_id}.

source: Block with usage_id: {usage_id} not found.
ar: كُتلة مُحتوى فيها usage_id: لم يُعثَر على {usage_id}.

source: You can create up to {max_num_bookmarks_per_course} bookmarks. You must remove some bookmarks before you can add new ones.
ar: يمكنك إنشاء ما لا يزيد عن {max_num_bookmarks_per_course} من العلامات المرجعية. يجب حذف بعض العلامات قبل أن تتمكن من إضافة علامات جديدة.

source: Bookmark with usage_id: {usage_id} does not exist.
ar: ضع علامة باستخدام ’usage_id‘: {usage_id} غير موجود.

source: Internal API URL
ar: العنوان الداخلي لواجهة برمجة التطبيقات

source: DEPRECATED: Use the setting COURSE_CATALOG_API_URL.
ar: مهمل: استخدم الإعدادات COURSE_CATALOG_API_URL.

source: Specified in seconds. Enable caching of API responses by setting this to a value greater than 0.
ar: حدد مدة الذاكرة المؤقتة بالثواني لتفعل تخزين النتائج مؤقتاً عند إدخالك قيمةً أكبر من 0.

source: Long Term Cache Time To Live
ar: حفظ الـ Cache لمدة طويلة

source: Specified in seconds (defaults to 86400s, 24hr). In some cases the cache does needs to be refreshed less frequently. Enable long term caching of API responses by setting this to a value greater than 0.
ar: محدد بالثواني (بوضع افتراضي 86400 ثانية "24 ساعة"). في بعض الحالات يجب تفريغ الـ Cache بتكرار أقل. يمكن السماح لمدد Cache طويلة لطلبات API عن طريق تحديد قيمة أعلى من صفر.

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
ar: اسم المستخدم الذي تم إنشاؤه من أجل تكامل دليل المساقات، على سبيل المثال، lms_catalog_service_user.

source: Page Size
ar: حجم الصفحة

source: Maximum number of records in paginated response of a single request to catalog service.
ar: العدد الأقصى للسجلات مرقمة الردود للطلب الواحد الموجه إلى خدمة الكتالوج.

source: List of domains that are allowed to make cross-domain requests to this site. Please list each domain on its own line.
ar: قائمة بالمجالات المختلفة التي يُسمح لها بتقديم طلبات خارج مجالاتها إلى هذا الموقع. يرجى ذكر كل مجال في سطر منفصل.

source: You cannot create two cohorts with the same name
ar: لا يمكنك إنشاء شعبتين بنفس الاسم

source: There must be one cohort to which students can automatically be assigned.
ar: يجب أن تتوفّر شعبة واحدة يتعيَّن فيها الطلّاب تلقائيًا.

source: A cohort with the same name already exists.
ar: توجد شعبة تحمل الاسم ذاته.

source: Credentials
ar: اعتماد

source: Internal Service URL
ar: رابط خدمة داخلي

source: Public Service URL
ar: رابط خدمة عامّ

source: Enable Learner Issuance
ar: فعّل الإصدار للمتعلّم

source: Enable issuance of credentials via Credential Service.
ar: فعّل إصدار الوثائق من خلال خدمة الوثائق المعتمدة.

source: Enable Authoring of Credential in Studio
ar: فعّل إنشاء الوثائق المعتمدة في الاستديو

source: Enable authoring of Credential Service credentials in Studio.
ar: فعّل خدمة إصدار الوثائق المُعتمدة لخدمة الوثائق في الاستديو

source: Course Credit Eligibility
ar: التأهُّل لاعتماد الساعات الدراسيّة

source: You are eligible for credit from {providers_string}
ar: أنت مؤهّل لاعتماد الساعات الدراسية من {providers_string}

source: {first_provider} and {second_provider}
ar: {first_provider} و{second_provider}

source: {first_providers}, and {last_provider}
ar: {first_providers}، و{last_provider}

source: [{username}] is not eligible for credit for [{course_key}].
ar: المستخدم [{username}] غير مؤهّل للحصول على ساعات معتمدة لمساق [{course_key}].

source: [{course_key}] is not a valid course key.
ar: [{course_key}] ليس مفتاح مساق صالِح

source: Unique identifier for this credit provider. Only alphanumeric characters and hyphens (-) are allowed. The identifier is case-sensitive.
ar: معرّف فريد لمانج الساعات المعتمدة. لا يُسمَح سوى بالحروف الأبجدية والأرقام ورمز الشَرطة (-). هذا المعرّف حسّاس لحالة الأحرف.

source: Whether the credit provider is currently enabled.
ar: فيما إذا كان مانح الساعات المعتمدة مفعّلًا حاليًّا.

source: Name of the credit provider displayed to users
ar: اسم مانح الساعات المعتمدة المعروض للمستخدمين

source: When true, automatically notify the credit provider when a user requests credit. In order for this to work, a shared secret key MUST be configured for the credit provider in secure auth settings.
ar: باختيارك للقيمة ’true‘، يُعلم مانح الساعات المعتمدة تلقائيًّا بمجرّد طلب المستخدم لساعات معتمدة. لتنجح هذه العملية، "يجب" ضبط مفتاح سرّي مشترك لمانح الساعات المعتمدة من خلال قسم إعدادات التفويض الآمن.

source: URL of the credit provider. If automatic integration is enabled, this will the the end-point that we POST to to notify the provider of a credit request. Otherwise, the user will be shown a link to this URL, so the user can request credit from the provider directly.
ar: رابط مانح الساعات المعتمدة. إذا تم تفعيل الدمج الأوتوماتيكي، ستكون هذه نقطة الوصول الهائية التي يتم عندها إعلام المزوِّد عن طلب الساعات المعتمدة. وإلا، سيرى المستخدم رابطًا يوصل إلى هذا الرابط ويسمح للطالب طلب الوحدات من المزوِّد مباشرةً.

source: URL from the credit provider where the user can check the status of his or her request for credit. This is displayed to students *after* they have requested credit.
ar: رابط من مانِح الساعات المعتمدة حيث يسمح للمستخدم بتفقّد حالة طلبه/طلبها للساعات الدراسية. يُعرض هذا الرابط للطلّاب "بعد" طلبهم للساعات المعتمدة.

source: Description for the credit provider displayed to users.
ar: وصف مانح الساعات المعتمدة المعروض للمستخدمين

source: Plain text or html content for displaying further steps on receipt page *after* paying for the credit to get credit for a credit course against a credit provider.
ar: نصّ صَرِف أو مكتوب بلغة html لعرض خطوات إضافية على صفحة الإيصال "بعد" دفع تكلفة اعتماد الساعات الدراسية من مانحها للحصول على الساعات المعتمدة للمساق.

source: Plain text or html content for displaying custom message inside credit eligibility email content which is sent when user has met all credit eligibility requirements.
ar: نصّ صَرِف أو مكتوب بلغة html لعرض رسالة مخصَّصة ضمن محتوى رسالة البريد الإلكتروني المُرسلة إلى المستخدم بخصوص التأهل للحصول على ساعات معتمدةوالتي تُرسَل ما أن يستوفي المستخدم كافة المتطلّبات.

source: Plain text or html content for displaying custom message inside credit receipt email content which is sent *after* paying to get credit for a credit course.
ar: نصّ صَرِف أو مكتوب بلغة html لعرض رسالة مخصَّصة كجزء من محتوى رسالة البريد الإلكتروني المرسَلة بخصوص إيصال دفعة الساعات الدراسية والتي تُرسل "بعد" سداد الدفةعة لاعتماد الساعات لمساق ذي ساعات معتمدة.

source: Thumbnail image url of the credit provider.
ar: رابط الصورة المصغّرة لمانح الساعات المعتمدة.

source: Credit requirement statuses
ar: حالات متطلبات اعتماد الساعات الدراسيّة

source: Deadline for purchasing and requesting credit.
ar: الموعد النهائي لدفع تكلفة اعتماد الساعات الدراسية وطلب اعتمادها.

source: Preview Language Administration
ar: إدارة لغة المعاينة

source: Language not provided
ar: اللغة غير متوفرة

source: Language set to {preview_language}
ar: تم ضبط اللغة على: {preview_language}

source: Language reset to the default
ar: إعادة تعيين اللغة إلى الوضع الافتراضي

source: This is a test message
ar: هذه رسالة تجريبية

source: This is a success message
ar: هذه رسالة نجاح

source: This is a test warning
ar: هذا هو تحذير تجريبي

source: This is a test error
ar: هذا خطأ تجريبي

source: COURSE NOT FOUND. Please check that the course ID is valid.
ar: لم يُعثَر على المساق. يُرجى التأكد من صحّة معرّف المساق.

source: The course key for the restricted course.
ar: مفتاح المساق المقيَّد.

source: The message to show when a user is blocked from enrollment.
ar: الرسالة الواجب عرضها عندما يُمنَع المستخدم من الانضمام للساق.

source: The message to show when a user is blocked from accessing a course.
ar: الرسالة الواجب عرضها عندما يُمنَع المستخدم من الوصول إلى المساق.

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
ar: السماح للمستخدمين المسجّلين والمقيمين في بلد مسموح بالوصول إلى المساقات المقيَّدة من البلدان المحظورة.

source: Two character ISO country code.
ar: رمز ’أيزو‘ للبلد مؤلّف من حرفين.

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
ar: سواء سيُدرج أو يٌستثنى مساق معيَّن. إذا تم تحديد بلدان اللائحة البيضاء، ستقتصر السماح بالوصول إلى المساق على طلاب هذه البلدان فقط. ومن جهة أخرى، إذا تم تحديد بلدان اللائحة السوداء، فلن يٌسمح للطلاب من هذه البلدان بالوصول إلى المساق.

source: The course to which this rule applies.
ar: المساق الذي تنطبق عليه هذه القاعدة.

source: The country to which this rule applies.
ar: البلد الذي تنطبق عليه هذه القاعدة.

source: Whitelist {country} for {course}
ar: أدرج {country} على اللائحة البيضاء لمساق {course}

source: Blacklist {country} for {course}
ar: أردج {country} على اللائحة السوداء لمساق {course}

source: You have already created an account using an external login like WebAuth or Shibboleth. Please contact {tech_support_email} for support.
ar: لقد قمت بإنشاء حساب في وقت سابق باستخدام دخول خارجي مثل WebAuth أو Shibboleth . يرجى الاتصال بـ{tech_support_email} للحصول على الدعم.

source: Your university identity server did not return your ID information to us. Please try logging in again. (You may need to restart your browser.)
ar: لم يُرجِع خادم الرقم الجامعي الخاص بك بإرجاع معلومات هويتك إلينا. تُرجى محاولة الدخول مرة أخرى. (قد تحتاج إلى إعادة تشغيل المتصفح.)

source: Comma-separated list of scopes that this application will be allowed to request.
ar: قائمة مفصولة بفاصلة بالـ (scopes) التي سيسمح لهذا التطبيق باستخدامها.

source: Content Provider
ar: مزود المحتوى

source: Password Policy
ar: سياسة كلمة المرور

source: {platform_name} now requires more complex passwords. Your current password does not meet the new requirements. Change your password now using the "Forgot password?" link below to continue using the site. Thank you for helping us keep your data safe.
ar: يتطلب {platform_name} الآن كلمات مرور أكثر تعقيدًا. كلمة المرور الحالية الخاصة بك لا توافق المتطلبات الجديدة. عليك تغييرها الآن باستخدام رابط "هل نسيت كلمة المرور؟" أدناه لمواصلة استخدام الموقع. شكرًا لك على مساعدتنا في الحفاظ على أمان بياناتك.
