Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: ar

source: Your request could not be completed due to a server problem. Reload the page and try again. If the issue persists, click the Help tab to report the problem.
ar: تعذَّر تنفيذ طلبك بسبب مشكلة في الخادم. أعِد تحميل الصفحة ثم أعِد المحاولة. إذا استمرت المشكلة، انقر على "مساعدة" للإبلاغ عن المشكلة.

source: Team Search
ar: البحث في الفِرق

source: Showing results for "{searchString}"
ar: عرض نتائج "{searchString}"

source: Create a New Team
ar: إنشاء فريق جديد

source: Create a new team if you can't find an existing team to join, or if you would like to learn with friends you know.
ar: أنشئ فريقًا جديدًا في حال لم تجد فريقًا موجودًا للانضمام إليه أو كنت ترغب بالتعلّم برفقة أصدقاء تعرفهم.

source: Edit Team
ar: تعديل الفريق

source: If you make significant changes, make sure you notify members of the team before making these changes.
ar: في حال أجريت تعديلات مهمّة، تأكّد من إخبار بقية أعضاء الفريق قبل اعتماد هذه التغييرات.

source: Membership
ar: العضوية

source: You can remove members from this team, especially if they have not participated in the team's activity.
ar: يمكنك استبعاد أعضاء من هذا الفريق، وخاصةً في حال عدم مشاركتهم بأنشطة الفريق.

source: Search teams
ar: بحث في الفرق

source: All Topics
ar: كافّة المواضيع

source: The page "{route}" could not be found.
ar: لم يُعثَر على الصفحة "{route}"

source: The topic "{topic}" could not be found.
ar: لم يُعثَر على الموضوع "{topic}"

source: The team "{team}" could not be found.
ar: لم يُعثَر على الفريق "{team}"

source: %(team_count)s Team
ar: %(team_count)s فريق

source: Topic
ar: الموضوع

source: View Teams in the %(topic_name)s Topic
ar: استعراض الفِرق في موضوع %(topic_name)s

source: {browse_span_start}Browse teams in other topics{span_end} or {search_span_start}search teams{span_end} in this topic. If you still can't find a team to join, {create_span_start}create a new team in this topic{span_end}.
ar: {browse_span_start}تصفّح الفرق في الموضوعات الأخرى{span_end} أو {search_span_start} ابحث في الفرق{span_end} ضمن هذا الموضوع. وإذا لم تتمكن من العثور على فريق للانضمام إليه، {create_span_start}أنشئ فريقًا جديدًا ضمن هذا الموضوع{span_end}.

source: All topics
ar: كافّة المواضيع

source: Insert Hyperlink
ar: أدرِج رابطًا

source: e.g. 'http://google.com'
ar: مثل 'http://google.com'

source: Link Description
ar: وصف الرابط

source: e.g. 'google'
ar: مثلًا: 'Google'

source: Please provide a description of the link destination.
ar: تُرجى إضافة وصف لوجهة الرابط.

source: Insert Image (upload file or type URL)
ar: أدرِج صورة (برفع ملف أو بإدخال رابط)

source: Type in a URL or use the "Choose File" button to upload a file from your machine. (e.g. 'http://example.com/img/clouds.jpg')
ar: أضف رابطًا أو استخدم زر "اختَر ملفًّا" لرفع ملف من جهازك. (مثال: 'http://example.com/img/clouds.jpg')

source: Image Description
ar: وصف الصورة

source: Please describe this image or agree that it has no contextual value by checking the checkbox.
ar: يُرجى وصف هذه الصورة، أو الموافقة على عدم احتوائها على قيمة سياقية وذلك بتحديد مربع الاختيار.

source: e.g. 'Sky with clouds'. The description is helpful for users who cannot see the image.
ar: مثال "سماءٌ صافية". يفيد هذا الوصف المستخدمين الذين لا يمكنهم رؤية الصورة.

source: How to create useful text alternatives.
ar: كيفية إنشاء بدائل نصيّة مفيدة.

source: This image is for decorative purposes only and does not require a description.
ar: استُخدمت هذه الصورة لأهداف تزينية فقط ولا تتطلّب وصفًا.

source: Markdown Editing Help
ar: المساعدة في تحرير لغة ماركداون

source: URL
ar: الرابط

source: Please provide a valid URL.
ar: تُرجى إضافة عنوان URL صحيح.

source: %(errorCount)s error found in form.
ar: عُثِرَ على %(errorCount)s خطأ في النموذج

source: Bold (Ctrl+B)
ar: خط عريض (Ctrl+B)

source: Italic (Ctrl+I)
ar: مائل (Ctrl+I)

source: Hyperlink (Ctrl+L)
ar: رابط (Ctrl+L)

source: Blockquote (Ctrl+Q)
ar: نص مقتبس (Ctrl+Q)

source: Code Sample (Ctrl+K)
ar: نموذج نصّ برمجيّ (Ctrl+K)

source: Image (Ctrl+G)
ar: صورة (Ctrl+G)

source: Numbered List (Ctrl+O)
ar: قائمة مرقّمة (Ctrl+O)

source: Bulleted List (Ctrl+U)
ar: قائمة منقّطة (Ctrl+U)

source: Heading (Ctrl+H)
ar: عنوان رئيسي (Ctrl+H)

source: Horizontal Rule (Ctrl+R)
ar: خط أفقي (Ctrl+R)

source: Undo (Ctrl+Z)
ar: إلغاء (Ctrl+Z)

source: Redo (Ctrl+Y)
ar: إعادة (Ctrl+Y)

source: Redo (Ctrl+Shift+Z)
ar: إعادة (Ctrl+Shift+Z)

source: strong text
ar: نصّ هامّ (strong)

source: emphasized text
ar: نصّ هامّ (emphasized)

source: enter link description here
ar: أضِف وصفًا للرابط هنا

source: enter code here
ar: أدخل النصَّ البرمجيّ هنا

source: List item
ar: أحد عناصر القائمة

source: Heading
ar: عنوان رئيسي

source: You have been logged out of your edX account. Click Okay to log in again now. Click Cancel to stay on this page (you must log in again to save your work).
ar: لقد أُخرِجتَ من حسابك في إدراك. انقر "موافق" لإعادة الدخول الآن. انقر على "إلغاء" للبقاء في هذه الصفحة (يجب عليك إعادة الدخول لحفظ عملك).

source: Preview this query
ar: معاينة هذا الاستعلام

source: Open Calculator
ar: افتح الآلة الحاسبة

source: Close Calculator
ar: اغلق الآلة الحاسبة

source: All subsections
ar: جميع الأقسام الفرعية

source: All units
ar: جميع الوحدات

source: Click to change
ar: أضغط للتغير

source: Select a chapter
ar: اختر فصلًا

source: Save changes
ar: حفظ التغييرات

source: Please enter valid start date and time.
ar: يُرجى إدخال تاريخ بدء وتوقيت صالحين.

source: Due date cannot be before start date.
ar: لايمكن أن يسبق تاريخ الاستحقاق تاريخ الابتداء.

source: Enter Due Date and Time
ar: يُرجى إدخال تاريخ ووقت الاستحقاق.

source: Enter Start Date and Time
ar: يُرجى إدخال تاريخ ووقت البدء

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
ar: حقل اسم الطالب/عنوان البريد الإلكتروني مطلوب ولا يمكن تركه فارغًا. يُرجى ملئ اسم المستخدم/البريد الإلكتروني ومن ثم الضغط على زر "أضف إلى قائمة الاستثناء"

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
ar: حقل اسم المستخدم/البريد الإلكتروني للطالب مطلوب ولا يمكن تركه فارغًا. لطفًا، املأ حقل اسم المستخدم/البريد الإلكتروني ومن ثم اضغط على زر الغِ الشهادة‘.

source: Uploaded file issues. Click on "+" to view.
ar: توجد إشكاليّات تتعلق بالملف المرفوع. يُرجى النقر على "+" لعرضها.

source: learners are successfully added to exception list
ar: تمّت إضافة المتعلّمين بنجاح إلى قائمة الإستثناء

source: learner is successfully added to the exception list
ar: تمّت إضافة المتعلّم بنجاح إلى قائمة الإستثناء

source: records are not in correct format and not added to the exception list
ar: السجلّات ليست بالصيغة الصحيحة ولم تجرِ إضافتها إلى قائمة الاستثناءات

source: record is not in correct format and not added to the exception list
ar: السجل ليس بالصيغة الصحيحة ولم تتم إضافته إلى قائمة الاستثناءات

source: learners do not exist in LMS and not added to the exception list
ar: المتعلّمون غير موجودين في LMS ولم تتم إضافتهم إلى قائمة الاستثناءات

source: learner does not exist in LMS and not added to the exception list
ar: المتعلّم غير موجود في LMS ولم تتم إضافته إلى قائمة الاستثناء

source: learners are already white listed and not added to the exception list
ar: المتعلّمون موجودون بالفعل في القائمة البيضاء ولم تتم إضافتهم إلى قائمة الاستثناءات

source: learner is already white listed and not added to the exception list
ar: المتعلّم موجود بالفعل في القائمة البيضاء ولم تتم إضافته إلى قائمة الاستثناءات

source: learners are not enrolled in course and not added to the exception list
ar: المتعلّمون غير ملتحقين بمساق ولم تتم إضافتهم إلى قائمة الاستثناءات

source: learner is not enrolled in course and not added to the exception list
ar: المتعلّم غير ملتحق بمساق ولم تتم إضافته إلى قائمة الاستثناءات

source: Certificate of <%= user %> has already been invalidated. Please check your spelling and retry.
ar: سبق أن أُلغيت شهادة المستخدم <%= user %>. يُرجى التأكّد من التهجئة وأعادة المحاولة.

source: Certificate has been successfully invalidated for <%= user %>.
ar: تمّ إلغاء شهادة <%= user %> بنجاح.

source: Server Error, Please refresh the page and try again.
ar: خطأ في الخادِم. يُرجى تحديث الصفحة وإعادة المحاولة.

source: The certificate for this learner has been re-validated and the system is re-running the grade for this learner.
ar: أُعيد توثيق شهادة هذا المتعلّم ويقوم النظام الآن بإعادة تقييمه.

source: Could not find Certificate Invalidation in the list. Please refresh the page and try again
ar: تعذّر إيجاد خيار إلغاء توثيق الشهادة ضمن القائمة. يُرجى تحديث الصفحة والمحاولة مرة أخرى

source: Student Removed from certificate white list successfully.
ar: أُزيل الطالب من القائمة البيضاء للشهادات بنجاح.

source: Could not find Certificate Exception in white list. Please refresh the page and try again
ar: تعذّر العثور على خيار استثناء الشهادة ضمن القائمة البيضاء. يُرجى تحديث الصفحة وإعادة المحاولة.

source: <%= user %> already in exception list.
ar: سبق أن أُدرج <%= user %> في قائمة الاستثناء.

source: <%= user %> has been successfully added to the exception list. Click Generate Exception Certificate below to send the certificate.
ar: أُُضيف المستخدم <%= user %> بنجاح إلى قائمة الاستثناء. انقر على "أنشئ شهادة استثناء" أدناه لإرسال الشهادة.

source: There has been an error processing your survey.
ar: حدث خطأ في معالجة استبيانك.

source: Less
ar: أقلّ

source: HTML preview of post
ar: معاينة HTML للموضوع

source: Your question or idea (required)
ar: سؤالك أو فكرتك (مطلوب)

source: Please enter a valid donation amount.
ar: يُرجى إدخال قيمة صالحة للتبرُّع.

source: Your donation could not be submitted.
ar: تعذّر تقديم تبرعك.

source: You will be refunded the amount you paid.
ar: سوف يعاد لك المبلغ الذي دفعته.

source: You will not be refunded the amount you paid.
ar: لن يعاد لك المبلغ الذي دفعته.

source: Are you sure you want to unenroll from the purchased course %(courseName)s (%(courseNumber)s)?
ar: هل أنت متأكّد من رغبتك في إلغاء تسجيلك في المساق %(courseName)s (%(courseNumber)s) الذي اشتريته؟

source: Are you sure you want to unenroll from %(courseName)s (%(courseNumber)s)?
ar: هل أنت متأكّد من رغبتك في إلغاء تسجيلك في مساق %(courseName)s (%(courseNumber)s)؟

source: Are you sure you want to unenroll from the verified %(certNameLong)s track of %(courseName)s (%(courseNumber)s)?
ar: هل أنت متأكّد من رغبتك بإلغاء تسجيلك من المسار الموثق%(certNameLong)s لـ%(courseName)s (%(courseNumber)s)؟

source: Are you sure you want to unenroll from the verified %(certNameLong)s track of %(courseName)s (%(courseNumber)s)?
ar: هل أنت متأكّد من رغبتك بإلغاء تسجيلك من المسار الموثق%(certNameLong)s لـ%(courseName)s (%(courseNumber)s)؟

source: The refund deadline for this course has passed,so you will not receive a refund.
ar: لقد انتهت الفترة القصوى لإعادة المبلغ لهذا المساق، لذا لن تتمكن من استعادة المبلغ الذي دفعته.

source: Viewing %s course
ar: يجري عرض %s مساق

source: We couldn't find any results for "%s".
ar: لم نتمكن من العثور على أيّة نتائج لـ "%s".

source: There was an error, try searching again.
ar: لقد حدث خطأ، حاول البحث مرة أخرى.

source: Not divided
ar: غير مقسّمة

source: Discussions are unified; all learners interact with posts from other learners, regardless of the group they are in.
ar: المناقشات غير موحّدة؛ جميع الطلّاب يتفاعلون مع منشورات الطلّاب الآخرين، بغض النظر عن مجموعاتهم.

source: Enrollment Tracks
ar: مسارات التسجيل

source: Use enrollment tracks as the basis for dividing discussions. All learners, regardless of their enrollment track, see the same discussion topics, but within divided topics, only learners who are in the same enrollment track see and respond to each others’ posts.
ar: استخدم مسارات التسجيل كقاعدة لتقسيم النقاشات. جميع الطلّاب، بغض النظر عن مسارات التسجيل خاصتهم، يرون نفس الموضوعات المطروحة للنقاش، لكن ضمن الموضوعات المقسّمة، وحدهم الطلّاب ذوي مسارات التسجيل عينها قادرون على رؤية منشورات أحدهم الآخر والتفاعل معها.

source: Cohorts
ar: الشُعب

source: Use cohorts as the basis for dividing discussions. All learners, regardless of cohort, see the same discussion topics, but within divided topics, only members of the same cohort see and respond to each others’ posts.
ar: استخدم الفئات كقاعدة لتقسيم النقاشات. جميع الطلّاب، بغض النظر عن فئاتهم، يرون نفس الموضوعات المطروحة للنقاش، لكن ضمن الموضوعات المقسّمة، وحدهم الطلّاب ذوي الفئات عينها قادرون على رؤية منشورات أحدهم الآخر والتفاعل معها.

source: Discussion topics in the course are not divided.
ar: الموضوعات المطروحة للنقاش ضمن المساق لا تكون مقسّمة.

source: Any divided discussion topics are divided based on enrollment track.
ar: أيّ موضوعات مقسّمة مطروحة للنقاش تكون قد قسّمت بحسب مسار التسجيل.

source: Any divided discussion topics are divided based on cohort.
ar: أيّ موضوعات مقسّمة مطروحة للنقاش تكون قد قسّمت بحسب الفئة.

source: Your changes have been saved. {details}
ar: تم حفظ التغييرات التي أجريتها. {details}

source: We have encountered an error. Refresh your browser and then try again.
ar: واجهنا خطئ. أعد فتح متصفّحك وأعد المحاولة من جديد.

source: We've encountered an error. Refresh your browser and then try again.
ar: لقد واجهنا خطأً. حدِّث الصفحة ثم حاول مرة أخرى.

source: All
ar: الكل

source: Processing...
ar: يجري العمل...

source: Show _MENU_ entries
ar: أظهِر محتويات _MENU_

source: No records where found
ar: لم يُعثَر على أيّ سجلات

source: Showing _START_ to _END_ out of _TOTAL_ entries.
ar: يجري عرض المدخلات من _START_ إلى _END_ من أصل _TOTAL_.

source: No records to show.
ar: لا توجد سجلات لعرضها.

source: Filtered out of _MAX_ entries.
ar: تم ترشيحها من _MAX_ مدخلة.

source: Search:
ar: بحث:

# pagination
source: First
ar: الأولى

# pagination
source: Previous
ar: السابقة

# pagination
source: Next
ar: التالية

# pagination
source: Last
ar: الأخيرة

source: An error has occurred. Make sure that you are connected to the Internet, and then try refreshing the page.
ar: حدث خطأ. تأكّد من أنّك متّصل بالإنترنت، ثمّ حاول تحديث الصفحة.

source: Hide notes
ar: اخفِ الملاحظات

source: Notes visible
ar: الملاحظات مرئية

source: Show notes
ar: أظهِر الملاحظات

source: Notes hidden
ar: الملاحظات مخفية

source: Please enter a term in the {anchorStart} search field{anchorEnd}.
ar: يرجى إدخال عبارة في {anchorStart}صندوق البحث{anchorEnd}.

source: Current tab
ar: التبويب الحالي

source: Location in Course
ar: مكانها في المساق

source: Recent Activity
ar: النشاطات الحديثة

source: No results found for "%(query_string)s". Please try searching again.
ar: لم يُعثَر على نتائج لـ"%(query_string)s". تُرجى محاولة البحث مرة أخرى.

source: Search Results
ar: نتائج البحث

source: [no tags]
ar: [لا وسوم]

source: Unable to submit application
ar: تعذَّر تقديم الطلب

source: An error has occurred. Check your Internet connection and try again.
ar: حدث خطأ. تأكّد من اتصالك بالإنترنت ثم حاول مرة اخرى.

source: Choose one
ar: اختر واحدًا

source: Selected tab
ar: التبويب المنتقى

source: Saved cohort
ar: الشُعبة المحفوظة

source: Error adding learners.
ar: خطأ في إضافة الطلّاب.

source: Enter a username or email.
ar: أدخِل اسم المستخدم أو البريد الإلكتروني

source: {numUsersAdded} learner has been added to this cohort.
ar: {numUsersAdded} طلّاب تمّ إضافتهم إلى هذه الفئة.

source: {numMoved} learner was moved from {prevCohort}
ar: {numMoved} طلّاب تمّ نقلهم من {prevCohort}

source: {numPresent} learner was already in the cohort
ar: {numPresent} طلّاب تمّ إضافتهم إلى الفئة.

source: {numPreassigned} learner was pre-assigned for this cohort. This learner will automatically be added to the cohort when they enroll in the course.
ar: {numPreassigned} طلّاب تمّ إدراجهم مسبقًا إلى هذه الفئة. هؤلاء الطلّاب سيتمّ إضافتهم تلقائيًا إلى هذه الفئة عندما يلتحقون بالمساق.

source: Unknown username: {user}
ar: اسم مستخدم غير معروف: {user}

source: Invalid email address: {email}
ar: عنوان بريد إلكتروني لاغٍ: {email}

source: There was an error when trying to add learners:
ar: {numErrors} طلّاب تعذّرت إضافتهم إلى هذه الفئة:

source: View all errors
ar: اعرض كلّ الأخطاء

source: You must specify a name for the cohort
ar: يجب أن تحدّد اسمًا للشعبة.

source: You did not select a content group
ar: لم تختر مجموعة محتوى

source: The selected content group does not exist
ar: مجموعة المحتوى المنتقاة غير موجودة

source: The cohort cannot be saved
ar: لا يمكن حفظ الشعبة

source: The cohort cannot be added
ar: لا يمكن إضافة الشعبة

source: You currently have no cohorts configured
ar: ليس لديك حاليًّا أي شعب مضبوطة

source: Add Cohort
ar: أضِف شُعبة

source: The {cohortGroupName} cohort has been created. You can manually add students to this cohort below.
ar: أُنشئت شعبة {cohortGroupName}، ويمكنك أن تضيف الطلّاب بنفسك إلى هذه الشعبة أدناه.

source: Assign students to cohorts by uploading a CSV file.
ar: وزِّع الطلاب على الشعب وذلك برفع ملف CSV.

source: Choose a .csv file
ar: اختر ملف csv.

source: Only properly formatted .csv files will be accepted.
ar: لن تُقبل سوى ملفّات .csv المنسّقة تنسيقًا صحيحًا.

source: Upload File and Assign Students
ar: ارفع الملف ووزّع الطلّاب

source: Your file '{file}' has been uploaded. Allow a few minutes for processing.
ar: تم رفع ملفّك '{file}'. يُرجى الانتظار لبضع دقائق لإتمام المعالجة.

source: Cohorts Enabled
ar: الشعب مفعّلة

source: Cohorts Disabled
ar: الشعب معطّلة

source: This course uses automatic cohorting for verified track learners. You cannot disable cohorts, and you cannot rename the manual cohort named '{verifiedCohortName}'. To change the configuration for verified track cohorts, contact your edX partner manager.
ar: يستخدم هذا المساق ميزة التوزيع الآلي على الشُعَب لمتعلمي المسار الموثَّق. لا يمكنك تعطيل الشُعب، ولا يمكنك إعادة تسمية المجموعة اليدوية المسماة "{verifiedCohortName}". لتغيير الإعدادات لشُعب المسار الموثَّق، تواصل مع مدير شريك إدراك الذي تعمل معه.

source: This course has automatic cohorting enabled for verified track learners, but the required cohort does not exist. You must create a manually-assigned cohort named '{verifiedCohortName}' for the feature to work.
ar: إن التوزيع الآلي على الشعب مفعَّل لهذا المساق لمتعلّمي المسار الموثّق، ولكن الشُعبة المطلوبة غير موجودة. يجب أن تُنشئ شُعبة يُنقَل إليها الطُلاب يدويًّا وتسميتها "{verifiedCohortName}" لكي تعمَل هذه الميزة.

source: This course has automatic cohorting enabled for verified track learners, but cohorts are disabled. You must enable cohorts for the feature to work.
ar: إن التوزيع الآلي على الشعب مفعَّل لهذا المساق لمتعلّمي المسار الموثّق، ولكن ميزة الشُعب معطّلة. يجب أن تُفعِّل ميزة الشُعب لتعمل هذه الميزة.

source: Allow students to generate certificates for this course?
ar: أترغب بالسماح للطلاب بإنشاء شهادات لهذا المساق؟

source: Prevent students from generating certificates in this course?
ar: أترغب بمنع الطلاب من إنشاء شهادات لهذا المساق؟

source: Start generating certificates for all students in this course?
ar: هل تريد البدء بإنشاء الشهادات لجميع الطلّاب في هذا المساق؟

source: Error while generating certificates. Please try again.
ar: حدث خطأ أثناء إنشاء الشهادات. تُرجى إعادة المحاولة.

source: Start regenerating certificates for students in this course?
ar: أترغب في البدء بإعادة إنشاء الشهادات لطلّاب هذا المساق؟

source: Error while regenerating certificates. Please try again.
ar: حدث خطأ أثناء إعادة إنشاء الشهادات. تُرجى إعادة المحاولة.

source: Loading data...
ar: يجري تحميل البيانات...

source: Error getting issued certificates list.
ar: حدث خطأ في الحصول على قائمة بالشهادات الصادرة.

source: Error generating proctored exam results. Please try again.
ar: حدث خطأ في نتائج الامتحان المراقَب. تُرجى إعادة المحاولة.

source: Error generating survey results. Please try again.
ar: حدث خطأ في إنشاء نتائج الاستبيان. تُرجى إعادة المحاولة.

source: Error generating student profile information. Please try again.
ar: حدث خطأ في إنشاء معلومات ملف الطالب. تُرجى إعادة المحاولة.

source: Loading
ar: يجري التحميل

source: Error getting student list.
ar: حدث خطأ في الحصول على قائمة الطلاب.

source: Error generating list of students who may enroll. Please try again.
ar: حدث خطأ في إنشاء قائمة بالطلاب الذين يمكنهم الالتحاق بالمساق. تُرجى إعادة المحاولة.

source: Error retrieving grading configuration.
ar: حدث خطأ في جلب إعدادات التقييم.

source: Error generating grades. Please try again.
ar: حدث خطأ إنشاء العلامات. تُرجى إعادة المحاولة.

source: Error generating problem grade report. Please try again.
ar: حدث خطأ في إنشاء تقرير علامات المسائل. تُرجى إعادة المحاولة.

source: Error generating ORA data report. Please try again.
ar: حدث خطأ في إنشاء تقرير بيانات ORA. تُرجى إعادة المحاولة.

source: There was a problem creating the report. Select "Create Executive Summary" to try again.
ar: حدثت مشكلة في إنشاء التقرير. اختر "أنشئ موجزًا تحليليًّا" لإعادة المحاولة.

source: Enter the enrollment code.
ar: أدخِل رمز التسجيل.

source: Cancel enrollment code
ar: الغِ رمز التسجيل

source: Restore enrollment code
ar: استعِد رمز التسجيل

source: Mark enrollment code as unused
ar: أشِر إلى رمز التسجيل على أنه غير مستخدَم

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Revoke access
ar: إلغاء صلاحيات الوصول

source: Group
ar: مجموعة

source: Enter username or email
ar: أدخل اسم المستخدم أو البريد الإلكتروني

source: Please enter a username or email.
ar: يُرجى إدخال اسم مستخدم او عنوان بريد إلكتروني.

source: This role requires a divided discussions scheme.
ar: يتطلب هذا الدور أن يكون مخطط المحادثات مقسّما.

source: Error changing user's permissions.
ar: حدث خطأ في تغيير صلاحيات المستخدم.

source: Could not find a user with username or email address '<%- identifier %>'.
ar: لم يُعثَر على مستخدِم له هذا الاسم أو البريد الإلكتروني '<%- identifier %>'.

source: Error: User '<%- username %>' has not yet activated their account. Users must create and activate their accounts before they can be assigned a role.
ar: خطأ: لم يُفعِّل '<%- username %>' حسابه بعد. على المستخدمين إنشاء وتفعيل حساباتهم قبل أن يُسند إليهم أيُّ دور.

source: Error: You cannot remove yourself from the Instructor group!
ar: خطأ: لا يمكنك إزالة نفسك من مجموعة المدرِّسين!

source: Errors
ar: أخطاء

source: The following errors were generated:
ar: نتجت الأخطاء التالية:

source: Warnings
ar: تحذيرات

source: The following warnings were generated:
ar: نتجت التحذيرات التالية:

source: Success
ar: نجحت العمليّة

source: All accounts were created successfully.
ar: تمّ إنشاء جميع الحسابات بنجاح.

source: Error adding/removing users as beta testers.
ar: حدث خطأ في إضافة/إزالة بعض المستخدمين من مجموعة مختبري الإصدار التجريبيّ (بيتا).

source: These users were successfully added as beta testers:
ar: أضيف المستخدمون التالون إلى مجموعة مختبري الإصدار التجريبيّ (بيتا) بنجاح:

source: These users could not be added as beta testers because their accounts are not yet activated:
ar: هؤلاء المتسخدمون تعذّرت إضافتهم إلا قائمة أعضاء مختبري النسخة التجريبية لأنّ حساباتهم لم تفعّل بعد:

source: These users were successfully removed as beta testers:
ar: أُزيلَ المستخدمون التالون إلى مجموعة مختبري الإصدار التجريبيّ (بيتا) بنجاح:

source: These users were not added as beta testers:
ar: لم يُضَف هؤلاء المستخدمون إلى مجموعة مختبري الإصدار التجريبيّ (بيتا):

source: These users were not removed as beta testers:
ar: لم يُزَل هؤلاء المستخدمون من مجموعة مختبري الإصدار التجريبيّ (بيتا):

source: Users must create and activate their account before they can be promoted to beta tester.
ar: يجب على المستخدمين إنشاء حساباتهم وتفعيلها قبل أن تتاح لهم إمكانية الانضمام إلى مختبري الإصدار التجريبيّ (بيتا).

source: Could not find users associated with the following identifiers:
ar: لم يُعثَر على مستخدمين لهم المعرِّفات التالية:

source: Reason field should not be left blank.
ar: لا يمكن ترك حقل السبب فارغًا.

source: Role field should not be left unselected.
ar: لا يمكن ترك حقل الدور فارغاً

source: Error enrolling/unenrolling users.
ar: حدث خطأ في تسجيل أو إلغاء تسجيل المستخدمين.

source: The following email addresses and/or usernames are invalid:
ar: عناوين البريد الإلكتروني أو أسماء المستخدمين أو كليهما مما يلي غير صالحين:
