Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Post a Facebook message to say you've enrolled in this course
ar: انشر رسالة على صفحتك على الفيسبوك لتعلن عن التحاقِك بهذا المساق

source: Email someone to say you've enrolled in this course
ar: أخبر شخصًا أنّك التحقت بطلاب هذا المساق عبر رسالة بريد إلكتروني

source: current location
ar: الموقع الحالي

source: needs attention
ar: يستدعي الانتباه

source: Course Material
ar: المواد الدراسيّة للمساق

source: Hide
ar: اخفِ

source: Show
ar: أظهِر

source: Show Earlier Course Updates
ar: اعرض التحديثات السابقة للمساق

source: List of Courses
ar: قائمة المساقات

source: Refine Your Search
ar: خصِّص بحثك

source: {course_number} Courseware
ar: المادة التعليمية {course_number}

source: Course Utilities
ar: خدمات المساق

source: Courseware
ar: المادة التعليمية

source: Course Search
ar: البحث في المساقات

source: No content has been added to this course
ar: لم يُضَف أي محتوى إلى هذا المساق

source: To access course materials, you must score {required_score}% or higher on this exam. Your current score is {current_score}%.
ar: للوصول إلى مواد المساق، يجب أن تحصل على النتيجة {required_score}% أو أعلى في هذا الامتحان. النتيجة الحالية الخاصة بك هي {current_score}%.

source: Your score is {current_score}%. You have passed the entrance exam.
ar: لقد نجحت في امتحان القبول، وعلامتك هي {current_score}%.

source: Gradebook
ar: سجل العلامات

source: Search students
ar: البحث عن الطلّاب

source: previous page
ar: الصفحة السابقة

source: of
ar: من

source: next page
ar: الصفحة التالية

source: {course_number} Course Info
ar: {course_number} معلومات المساق

source: You are not enrolled yet
ar: لستَ مسجّلًا بعد.

source: You are not currently enrolled in this course. {link_start}Enroll now!{link_end}
ar: لستَ مسجّلًا بعد في هذا المساق. {link_start} سجِّل الآن!{link_end}

source: Welcome to {org}'s {course_title}!
ar: مرحبًا بك في مساق{course_title} المقدَّم من {org}!

source: Welcome to {course_title}!
ar: مرحبًا بك في {course_title}!

source: Resume Course
ar: استمر في المساق

source: View Updates in Studio
ar: اعرض التحديثات في الاستوديو

source: Course Updates and News
ar: تحديثات وأخبار المساق

source: Handout Navigation
ar: تصفّح أوراق العمل

source: Course Tools
ar: أدوات المساق

source: News - MITx 6.002x
ar: أخبار- MITx 6.002x

source: Updates to Discussion Posts You Follow
ar: تحديثات المناقشات التي تتابعها

source: Purchase the Program (
ar: شراء البرنامج (

source: Original Price
ar: السعر الأساسي

source: ${oldPrice}
ar: السعر ${oldPrice}

source: Discounted Price
ar: السعر بعد الخصم

source: Start Learning
ar: ابدأ التعلّم

source: Play
ar: تشغيل

source: YouTube Video
ar: فيديو على يوتيوب

source: View Courses
ar: اعرض المساقات

source: Meet the Instructors
ar: تعرّف على الأساتذة

source: Frequently Asked Questions
ar: الأسئلة الشائعة

source: Job Outlook
ar: آفاق الوظيفة

source: Real Career Impact
ar: تأثير فعلي في المسيرة المهنية

source: What You'll Learn
ar: ما سوف تتعلمه

source: Average Length
ar: متوسّط الطول

source: {weeks_to_complete} weeks per course
ar: {weeks_to_complete} أسبوع مخصّص لكلّ مساق

source: Effort
ar: الجهد

source: {min_hours_effort_per_week}-{max_hours_effort_per_week} hours per week, per course
ar: {min_hours_effort_per_week}-{max_hours_effort_per_week} ساعة مخصّصة في الأسبوع لكلّ مساق

source: Number of Courses
ar: عدد المساقات

source: {number_of_courses} courses in program
ar: {number_of_courses} مساقًا في البرنامج

source: Price (USD)
ar: السعر (دولار أمريكي)

source: ${newPrice}{htmlEnd} for entire program
ar: السعر ${newPrice}{htmlEnd} للبرنامج كاملًا

source: You save ${discount_value} {currency}
ar: مما يعني أنّك توفّر ${discount_value} {currency}

source: ${full_program_price} for entire program
ar: السعر ${full_program_price} للبرنامج كاملًا

source: Courses in the {}
ar: مساقات في {}

source: Starts on {}
ar: تبدأ في {}

source: {course_number} Progress
ar: تقدّمك في {course_number}

source: View Grading in studio
ar: اعرض التصحيح في الاستوديو

source: Course Progress for Student '{username}' ({email})
ar: تقدّم الطالب '{username}'‏ ({email}) في المساق

source: View Certificate
ar: أظهر الشهادة

source: Opens in a new browser window
ar: يُفتَح في نافذة متصفح جديدة

source: Download Your Certificate
ar: نزِّل شهادتك

source: Request Certificate
ar: اطلب الشهادة

source: Requirements for Course Credit
ar: متطلبات النجاح في مواد المساق

source: {student_name}, you are no longer eligible for credit in this course.
ar: {student_name}، لم تعد مؤهلاً للحصول على ساعات معتمدة في هذا المساق.

source: {student_name}, you have met the requirements for credit in this course. {a_start}Go to your dashboard{a_end} to purchase course credit.
ar: لقد حققت متطلبات النجاح في هذا المساق يا {student_name}. {a_start} توجه إلى مكتبك{a_end} لدفع رسوم ساعاتك المعتمدة.

source: {student_name}, you have not yet met the requirements for credit.
ar: لم تحقق يا {student_name} متطلبات النجاح بعد.

source: Information about course credit requirements
ar: معلومات حول متطلبات الحصول على ساعات معتمدة

source: display_name
ar: الاسم الظاهِر

source: Verification Submitted
ar: تمّ تقديم طلب التوثيق

source: Verification Failed
ar: فشل التوثيق

source: Verification Declined
ar: رُفِضَ التوثيق

source: Completed by {date}
ar: أُكمِل بتاريخ {date}

source: Upcoming
ar: قريبًا

source: Less
ar: أقلّ

source: Details for each chapter
ar: تفاصيل كل فصل

source: {earned} of {total} possible points
ar: النقاط التي حصلت عليها: {earned} من {total}

source: Suspicious activity detected during proctored exam review. Exam score 0.
ar: الكشف عن نشاط مشبوه خلال مراجعة الإمتحان المراقب. نتيجة الامتحان 0.

source: Section grade has been overridden.
ar: تم تجاوز درجة القسم.

source: Problem Scores:
ar: علامات المسألة:

source: Practice Scores:
ar: علامات التدريب:

source: Problem scores are hidden until the due date.
ar: تم إخفاء درجات المسألة حتى تاريخ الاستحقاق.

source: Practice scores are hidden until the due date.
ar: تم إخفاء درجات التدريب حتى تاريخ الاستحقاق.

source: Problem scores are hidden.
ar: تم إخفاء درجات المسألة.

source: Practice scores are hidden.
ar: تم إخفاء درجات التدريب.

source: No problem scores in this section
ar: لا توجد علامات للمسائل في هذا القسم

source: {course.display_number_with_default} Course Info
ar: معلومات المساق {course.display_number_with_default}

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
ar: لقد زرتَ مؤخّرًا القسم {section_link}. فإذا انتهيت من العمل فيه، يُرجى اختيار قسم آخر من الجهة اليمنى.

source: Hi {name},
ar: مرحبًا يا {name}،

source: Hi,
ar: مرحبًا،

source: Congratulations! You are now eligible to receive course credit from {providers} for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
ar: تهانينا! أنت مؤهل للحصول على ساعات معتمدة من {providers} لنجاحك في إتمام مساق في {platform_name}! {link_start}احصل على ساعاتك المعتمدة الآن{link_end}.

source: Congratulations! You are now eligible to receive course credit for successfully completing your {platform_name} course! {link_start}Purchase credit now.{link_end}
ar: تهانينا! أنت مؤهل للحصول على ساعات معتمدة لنجاحك في إتمام مساق في {platform_name}! {link_start}احصل على ساعاتك المعتمدة الآن{link_end}.

source: Course credit can help you get a jump start on your university degree, finish a degree already started, or fulfill requirements at a different academic institution.
ar: يمكن لنجاحك في المساق أن يساعدك في الانطلاق نحو الحصول على شهادة جامعية أو مساعدتك في أكمال دراستك الجامعية بشكل أسرع، أو أن تستكمل متطلبات الجامعة عبر مؤسسة أكاديمية مختلفة.

source: There are 2 steps to getting course credit.
ar: خطوتان للحصول على الساعات المعتمدة.

source: Purchase credit by going to your {link_start}{platform_name} dashboard{link_end} and clicking the {bold_start}Get Credit{bold_end} button below the course title.
ar: يمكنك شراء ساعات معتمدة من خلال الانتقال إلى لوحة التحكم {link_start} {platform_name} {link_end} والنقر على الزر {bold_start} الحصول على رصيد {bold_end} أسفل عنوان الدورة التدريبية.

source: When your payment is complete, return to the dashboard and click the {bold_start}Request Credit{bold_end} button under the course title to request an official academic transcript at the institution that granted the credit.
ar: عند اكتمال دفعتك ، ارجع إلى لوحة المعلومات وانقر على زر {bold_start} طلب ساعات معتمدة{bold_end} تحت عنوان المساق لطلب نسخة أكاديمية رسمية في المؤسسة التي منحت الائتمان.

source: We hope you enjoyed the course, and we hope to see you in future {platform_name} courses!
ar: نأمل أن تكون قد استمتعتَ بحضور المساق ونرجو أن نراك مجددًا في مساقات مستقبلية في {platform_name}!

source: The {platform_name} Team
ar: فريق {platform_name}

source: {link_start}Click here for more information on credit at {platform_name}{link_end}.
ar: {link_start}انقر هنا للمزيد من المعلومات المتعلقة بالساعات المعتمدة من {platform_name}{link_end}.

source: Your certificate will be available on or before {date}
ar: ستكون شهادتك متاحة في أو قبل {date}

source: Your final grade:
ar: علامتك النهائيّة:

source: Grade required for a {cert_name_short}:
ar: العلامة المطلوبة لشهادة {cert_name_short}:

source: Grade required to pass this course:
ar: العلامة المطلوبة للنجاح في هذا المساق:

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
ar: يجري حاليًّا تعليق شهادتك الموثّقة ({cert_name_long}) بانتظار التأكيد على أنّ إصدار شهادتك ({cert_name_short}) هذه يتماشى مع الحظر الصارم الذي تفرضه الولايات المتحدة على كلٍّ من إيران وكوبا وسوريا والسودان. وإذا كنت تعتقد بأنّ نظامنا قد نسبك خطأً إلى إحدى تلك البلدان، يُرجى إعلامنا بذلك عبر مراسلتنا على {email}. وإذا رغبت في استرداد تكلفة شهادتك {cert_name_long}، يُرجى الاتصال بقسمنا المسؤول عن الفواتير {billing_email}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
ar: يجري حاليًّا تعليق شهادتك ({cert_name_long}) بانتظار التأكيد على أنّ إصدار شهادتك ({cert_name_short}) هذه يتماشى مع الحظر الصارم الذي تفرضه الولايات المتحدة على كلٍّ من إيران وكوبا وسوريا والسودان. وإذا كنت تعتقد بأنّ نظامنا قد نسبك خطأً إلى إحدى تلك البلدان، يُرجى إعلامنا بذلك عبر مراسلتنا على {email}.

source: Your certificate was not issued because you do not have a current verified identity with {platform_name}.
ar: لم نُصدر شهادتك لأنك لم تقم توثِّق هويتك في {platform_name} أو لم تحدّث توثيقك.

source: Verify your identity now.
ar: وثِّق هويتك الآن.

source: Your {cert_name_short} is Generating
ar: جاري إعداد شهادتك {cert_name_short}

source: This link will open the certificate web view
ar: هذا الرابط سيفتح عارض الشهادات

source: View {cert_name_short}
ar: اعرض {cert_name_short}

source: This link will open/download a PDF document
ar: سيقوم هذا الرابط بفتح/تنزيل وثيقة بصيغة PDF

source: Download {cert_name_short} (PDF)
ar: تنزيل {cert_name_short} (PDF)

source: Download Your {cert_name_short} (PDF)
ar: نزِّل شهادتك {cert_name_short} (بصيغة PDF)

source: This link will open/download a PDF document of your verified {cert_name_long}.
ar: هذا الرابط على سيفتح أو ينزيل نسخة PDF من شهادتك الموثّقة {cert_name_long}.

source: Download Your ID Verified {cert_name_short} (PDF)
ar: نزِّل شهادتك الموثّقة {cert_name_short} (بصيغة PDF).

source: Complete our course feedback survey
ar: استكمال استبيان مساقنا لإبداء آرائك وملاحظاتك

source: Add Certificate to LinkedIn Profile
ar: إضافة الشهادة إلى ملفك على لينكد إن

source: Share on LinkedIn
ar: شارك على لينكد إن

source: Since we did not have a valid set of verification photos from you when your {cert_name_long} was generated, we could not grant you a verified {cert_name_short}. An honor code {cert_name_short} has been granted instead.
ar: بما أنّنا لم نحصل منك على مجموعة مناسبة من الصور الخاصة بالتحقّق من الهوية عندما أُعِدَّت شهادتك {cert_name_long}، فلم نستطع منحك شهادة موثّقة من {cert_name_short}، ومنحناك عوضًا عنها شهادة ميثاق شرف {cert_name_short}.

source: Course details
ar: تفاصيل المساق

source: {course_number} {course_name} Home Page
ar: {course_number} {course_name} الصفحة الرئيسية

source: {course_number} {course_name} Cover Image
ar: صورة الغلاف {course_number} {course_name}

source: Enrolled as:
ar: مسجَّل كـ:

source: Coming Soon
ar: قريبًا

source: Ended - {date}
ar: انتهى بتاريخ {date}

source: Started - {date}
ar: بدأ بتاريخ {date}

source: Starts - {date}
ar: يبدأ بتاريخ {date}

source: You must select a session by {expiration_date} to access the course.
ar: يجب ان تختار الجلسة {expiration_date} للوصول الى محتويات المساق

source: You must select a session to access the course.
ar: يجب ان تختار جلسة للوصول الى محتويات المساق

source: Change or Leave Session
ar: تغيير أو مغادرة الجلسة

source: You can no longer change sessions.
ar: لا تتمكن من تغيير الجلسات بعد الآن.

source: You can change sessions until {entitlement_expiration_date}.
ar: يمكنك تغيير الجلسات حتى تاريخ {entitlement_expiration_date}.

source: View Archived Course
ar: استعراض المساق المؤرشَف

source: I'm taking {course_name} online with {facebook_brand}. Check it out!
ar: أنا تعلم {course_name} عبر الإنترنت مع {facebook_brand}. تحقق من ذلك

source: Share {course_name} on Facebook
ar: شارك {course_name} على فاسيبوك

source: Share on Facebook
ar: انشر على فيسبوك

source: I'm taking {course_name} online with {twitter_brand}. Check it out!
ar: أنا تعلم {course_name} عبر الإنترنت مع{twitter_brand}. تحقق من ذلك

source: Share {course_name} on Twitter
ar: شارك {course_name} على تويتر

source: Course options for
ar: خيارات المساق لـ

source: Available Actions
ar: الإجراءات المتاحة

source: Email Settings
ar: إعدادات عنوان البريد الإلكتروني

source: Related Programs
ar: التخصصات ذات الصلة

source: You can no longer access this course because payment has not yet been received. You can contact the account holder to request payment, or you can unenroll from this course
ar: لم يعد بإمكانك الوصول إلى هذه الدورة التدريبية لأن الدفعة لم يتم استلامها بعد. يمكنك التواصل مع صاحب الحساب لطلب الدفع ، أو يمكنك إلغاء التسجيل في هذه الدورة التدريبية

source: You can no longer access this course because payment has not yet been received. You can {contact_link_start}contact the account holder{contact_link_end} to request payment, or you can {unenroll_link_start}unenroll{unenroll_link_end} from this course
ar: عذرًا، لم يعد بإمكانك الدخول إلى هذا المساق لأنّ الدُفعة لم تُستلَم بعد. يمكنك {contact_link_start}الاتصال بصاحب الحساب{contact_link_end} لطلب الدفعة، أو يمكنك {unenroll_link_start}إلغاء التسجيل{unenroll_link_end} في هذا المساق.

source: Verification not yet complete.
ar: لم يتمّ التوثيق بعد.

source: You only have {days} day left to verify for this course.
ar: لم يتبقى لديك أي يوم لتوثيق هذا المساق.

source: Almost there!
ar: أوشكتَ على الانتهاء!

source: You still need to verify for this course.
ar: ما زال عليك خوض عملية التحقّق والتوثيق لهذا المساق.

source: Verify Now
ar: وثِّق الآن

source: You have submitted your verification information.
ar: قمت بتقديم معلومات التوثيق الخاصة بك.

source: You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
ar: سوف تصلك رسالة عبر مكتبك فور اكتمال عملية التحقق (عادة خلال يوم أو اثنين).

source: Your current verification will expire soon!
ar: سوف تنتهي صلاحية توثيقك الحالي قريباً!

source: You have submitted your reverification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
ar: لقد قمت بتقديم معلومات إعادة التوثيق الخاصة بك. سترى رسالة في صفحة "لوحتي التعليمية" الخاصة بك عندما تتم عملية التوثيق (عادة خلال يوم واحد أو يومين).

source: You have successfully verified your ID with edX
ar: لقد أتممت عملية التحقّق من هويتك مع إدراك بنجاح

source: Your current verification is effective until {date}.
ar: عملية التوثيق الخاصة بك سارية المفعول حتى تاريخ {date}.

source: Your current verification will expire soon.
ar: سوف تنتهي صلاحية توثيق هويتك قريباً.

source: Your current verification will expire in {days} days. {start_link}Re-verify your identity now{end_link} using a webcam and a government-issued photo ID.
ar: تنتهي صلاحية التوثيق الحالي لهويتك خلال {days} من الأيام. {start_link}أعد التحقق من هويتك الآن{end_link} باستخدام كامرا الويب وهوية صادرة عن الحكومة.

source: Pursue a {cert_name_long} to highlight the knowledge and skills you gain in this course.
ar: احصل على شهادة {cert_name_long} لتبرز المعارف والمهارات التي اكتسبتها في المساق.

source: It's official. It's easily shareable. It's a proven motivator to complete the course. {line_break}{link_start}Learn more about the verified {cert_name_long}{link_end}.
ar: رسميّة، وسهلة المشاركة، وهي حافز مجرّب لاستكمال هذا المساق {line_break}{link_start}اعرف المزيد عن توثيق {cert_name_long}{link_end}.

source: You have completed this course and are eligible to purchase course credit. Select <strong>Get Credit</strong> to get started.
ar: لقد أتممت هذا المساق أصبحت مؤهّلًا لدفع رسوم الساعات المعتمدة.اختر<strong>احصل على الساعات المعتمدة</strong> للبدء في الإجراءات.

source: You are now eligible for credit from {provider}. Congratulations!
ar: أنت مؤهّل للحصول على ساعات معتمدة من {provider}. تهانينا!

source: Get Credit
ar: اعتمد الساعات الدراسيّة

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select <b>Request Credit</b> to get started.
ar: شكرًا لتسديدك الدفعة. للحصول على الساعات المعتمدة يجب أن تتقدّم بطلب بزيارة {link_to_provider_site}. اختر <b>طلب ساعات معتمدة</b> لتباشر بالطلب.

source: Request Credit
ar: طلب اعتماد الساعات الدراسيّة

source: {provider_name} has received your course credit request. We will update you when credit processing is complete.
ar: لقد استلم {provider_name} طلب اعتماد الساعات الدراسيّة الذي تقدّمت به. سنطلعك بالمستجدّات بمجرّد اكتمال معالجة طلبك.

source: View Details
ar: اعرض التفاصيل

source: <b>Congratulations!</b> {provider_name} has approved your request for course credit. To see your course credit, visit the {link_to_provider_site} website.
ar: <b>تهانينا!</b> لقد صادق {provider_name} على طلبك لاعتماد ساعاتك الدراسية. للاطلاع على الساعات الدراسيّة لهذا المساق، قم بزيارة {link_to_provider_site}.

source: View Credit
ar: اعرض الساعات المعتمدة

source: {provider_name} did not approve your request for course credit. For more information, contact {link_to_provider_site} directly.
ar: لقد رفض {provider_name} طلبك لاعتماد الساعات الدراسيّة. لمزيد من المعلومات، تواصل مع {link_to_provider_site} مباشرةً.

source: An error occurred with this transaction. For help, contact {support_email}.
ar: حدث خطأ أثناء تنفيذ هذه العملية. للحصول على المساعدة، اتصل بـ{support_email}.

source: Course options for {courseName}
ar: خيارات مساق {courseName}

source: Consent to share your data
ar: الاذن بمشاركة بيناتك

source: To access this course, you must first consent to share your learning achievements with {enterprise_customer_name}.
ar: للدخول إلى هذا المساق ، عليك أولاً الموافقة على مشاركة إنجازاتك التعليمية مع {enterprise_customer_name}.

source: View Consent
ar: عرض الموافقة

source: Current Verification Status: Approved
ar: الوضع الحالي للتوثيق: تمت الموافقة عليه

source: Your edX verification has been approved. Your verification is effective for one year after submission.
ar: لقد تمت مراجعة طلب توثيق هويتك في إدراك والموافقة عليه. هذه الموافقة صالحة لمدة سنة واحدة من تاريخ التقديم.

source: Current Verification Status: Pending
ar: الوضع الحالي للتوثيق: قيد الانتظار

source: Your edX ID verification is pending. Your verification information has been submitted and will be reviewed shortly.
ar: لا يزال طلبك لتوثيق هويتك في إدراك قيد الانتظار. لقد وصلت معلومات التحقق من هويتك وسنقوم بمراجعتها قريباً.

source: Current Verification Status: Denied
ar: وضع التحقق الحالي: مرفوض

source: Your verification submission was not accepted. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
ar: لقد تمّ رفض وثائقك المقدّمة للتحقّق. للحصول على شهادة موثّقة، عليك تقديم صورة حديثة لك إلى جانب هوية تعريفية مزوّدة بصورة ومصدرة من الحكومة، وذلك قبل انتهاء مدة التحقّق المخصّصة لهذا المساق.

source: Your verification was denied for the following reasons:
ar: تمّ رفض منحك الشهادة الموثّقة للأسباب التالية:

source: Resubmit Verification
ar: أعِد إرسال متطلّبات التحقّق من الهويّة

source: Current Verification Status: Expired
ar: الوضع الحالي للتوثيق: انتهت صلاحيته

source: Your verification has expired. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
ar: لقد انتهت صلاحية توثيق هويتك. إذا أردت الحصول على شهادات موثّقة، يجب أن تقدم صورة جديدة لك ولأي بطاقة حكومية تحمل صورتك الشخصية قبل انتهاء الموعد النهائي للتوثيق للمساق.

source: Could Not Link Accounts
ar: تعذَّر ربط الحسابات

source: The {provider_name} account you selected is already linked to another {platform_name} account.
ar: إنّ حساب {provider_name} الذي اخترتَه مرتبط مسبقًا بحساب آخر في {platform_name}.

source: We're sorry to see you go! Please share your main reason for unenrolling.
ar: نحن آسفون لرؤيتكم غادرون! يرجى مشاركة السبب الرئيسي لعدم التسجيل.

source: I just wanted to browse the material
ar: أردت فقط أن تصفح المواد

source: This won't help me reach my goals
ar: هذا لن يساعدني على تحقيق أهدافي

source: I don't have the time
ar: ليس لدي الوقت

source: I don't have the academic or language prerequisites
ar: ليس لدي المتطلبات الأكاديمية أو اللغة

source: I don't have enough support
ar: ليس لدي ما يكفي من الدعم

source: I am not happy with the quality of the content
ar: أنا لست سعيدا بنوعية المحتوى

source: The course material was too hard
ar: مواد المساق كانت صعبة للغاية

source: The course material was too easy
ar: مواد المساق كانت سهلة للغاية

source: Something was broken
ar: حدث خطأ ما

source: Other
ar: آخر

source: Thank you for sharing your reasons for unenrolling.
ar: شكرا لك على مشاركة أسباب إلغاء التسجيل.

source: You are unenrolled from
ar: لقد تم إلغاء تسجيلك من

source: Return To Dashboard
ar: الرجوع إلى لوحة التحكم

source: Browse Courses
ar: تصفّح المساقات

source: Results:
ar: النتائج:

source: Topic:
ar: الموضوع:

source: Show Discussion
ar: أظهِر المناقشة

source: To view live discussions, click Preview or View Live in Unit Settings.
ar: لمشاهدة النقاشات المباشرة، انقر على "معاينة" أو "عرض مباشر" في إعدادات الوحدة.

source: Discussion ID: {discussion_id}
ar: معرِّف المناقشة: {discussion_id}

source: Discussion topics list
ar: قائمة مواضيع النقاش

source: Filter Topics
ar: ترشيح المواضيع

source: filter topics
ar: رشِّح المواضيع

source: All Discussions
ar: كافّة المناقشات

source: Posts I'm Following
ar: المواضيع التي أتابعها

source: Filter:
ar: الترشيح:

source: Show all posts
ar: عرض جميع المشاركات

source: Unread posts
ar: المشاركات غير المقروءة

source: Unanswered posts
ar: المشاركات التي لم يتم الرد عليها

source: Flagged
ar: المعلَّمة

source: Group:
ar: الشُعبة:

source: in all groups
ar: في كافّة المجموعات

source: Sort:
ar: رتِّب:

source: by recent activity
ar: حسب أحدث الأنشطة

source: by most activity
ar: حسب أكبر عدد من الأنشطة

source: by most votes
ar: حسب أكبر عدد من الأصوات

source: Please wait...
ar: يرجى الانتظار...

source: You have Not completed this course
ar: لم تكمل هذا المساق بعد
