Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Could not find the {0} file in the package.
ar: تعذّر العثور على الملف {0} في الحزمة.

source: Deleted Group
ar: مجموعة محذوفة

source: Upload completed
ar: تم الرفع

source: File {filename} exceeds maximum size of {maximum_size_in_megabytes} MB.
ar: يتجاوز الملف {filename} الحد الأقصى لحجم {maximum_size_in_megabytes} ميغابايت.

source: must have name of the certificate
ar: يجب أن يتوفر اسم الشهادة

source: Certificate dict {0} missing value key '{1}'
ar: القاموس {0} للشهادة تنقصه القيمة ذات المفتاح '{1}'

source: PermissionDenied: Failed in authenticating {user}
ar: رُفِض الإذن:فشل استيثاق {user}

source: {platform_name} Support Levels:
ar: مستويات دعم {platform_name}:

source: Video
ar: فيديو

source: Blank
ar: صفحة فارغة

source: Course has been successfully reindexed.
ar: تمت إعادة فهرسة المساق بنجاح.

source: Unscheduled
ar: غير مجدوَل

source: Special characters not allowed in organization, course number, and course run.
ar: لا يُسمح باستخدام الأحرف الخاصة ضمن اسم المؤسسة ورقم المساق ورقم تشغيله.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
ar: يوجد من قبل مساق يحمل اسم المؤسّسة ورقم المساق نفسهما. يُرجى تغيير إمّا المؤسّسة أو رقم المساق ليكون فريدًا.

source: Please change either the organization or course number so that it is unique.
ar: يُرجى تغيير إمّا المؤسسة أو رقم المساق ليكون فريدًا.

source: Unable to create course '{name}'. {err}
ar: تعذّر إنشاء المساق ’{name}‘. {err}

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
ar: يجب ربط هذا المساق بمؤسّسة لتتمكّن من المتابعة. المؤسّسة التي اخترتها غير موجودة في النظام، ولهذا تحتاج لإضافتها إليه.

source: Invalid prerequisite course key
ar: مفتاح المساق المتطلب غير صالح

source: An error occurred while trying to save your tabs
ar: حدث خطأ أثناء محاولتك حفظ تبويباتك

source: Tabs Exception
ar: استثناء التبويبات

source: An error occurred while trying to save the speciliazation id
ar: حدث خطأ أثناء حفظ الـ ID الخاص بالتخصص

source: Specialization id error
ar: خطأ في الID الخاص بالتخصص

source: This group configuration is in use and cannot be deleted.
ar: إنّ إعدادات المجموعة هذه قيد الاستخدام ولا يمكن حذفها.

source: This content group is in use and cannot be deleted.
ar: إنّ مجموعة المحتوى هذه قيد الاستخدام ولا يمكن حذفها.

source: Entrance Exam - Subsection
ar: امتحان القبول - قسم فرعي

source: Completed Course Entrance Exam
ar: استُكمِل امتحان القبول في للمساق

source: Course successfully exported to git repository
ar: تمّ بنجاح تصدير المساق إلى مستودع git

source: Vertical
ar: عمودية

source: File upload corrupted. Please try again
ar: تلف الملف المرفوع. تُرجى المحاولة مرة أخرى.

source: Invalid data
ar: بيانات غير صالحة

source: Invalid data ({details})
ar: بيانات غير صالحة ({details})

source: You can not move {source_type} into {target_parent_type}.
ar: لا تستطيع تحريك {source_type} إلى {target_parent_type}.

source: Item is already present in target location.
ar: البند موجود بالفعل ضمن الموقع المستهدف.

source: You can not move an item into itself.
ar: لا تستطيع تحريك بندٍ إلى بندٍ مماثل.

source: You can not move an item into it's child.
ar: لا تستطيع تحريك بندٍ إلى بندٍ مستخرجٍ عنه.

source: You can not move an item directly into content experiment.
ar: لا تستطيع تحريك بندٍ مباشرةً إلى تجربة المحتوى

source: {source_usage_key} not found in {parent_usage_key}.
ar: {source_usage_key} غير موجود في {parent_usage_key}.

source: You can not move {source_usage_key} at an invalid index ({target_index}).
ar: لا تستطيع تحريك {source_usage_key} ضمن فهرس غير صالح ({target_index}).

source: You must provide target_index ({target_index}) as an integer.
ar: عليك أن توفر فهرسًا_مستهدفًا ({target_index} كثيمة صحيحة.

source: Duplicate of {0}
ar: نسخة مطابقة لـ {0}

source: Duplicate of '{0}'
ar: نسخة مطابقة لـ ’{0}‘

source: Students must score {score}{pct_sign} or higher to access course materials.
ar: يجب أن يحصل الطلّاب على علامة {score}{pct_sign} أو أكثر ليتمكّنوا من الوصول إلى محتويات المساق.

source: Unable to create library - missing required field '{field}'
ar: تعذّر إنشاء المكتبة - الحقل المطلوب غير موجود '{field}'

source: Unable to create library '{name}'. {err}
ar: تعذّر إنشاء المكتبة '{name}'. {err}

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
ar: هناك مكتبة تحمل اسم المؤسّسة نفسها والرمز نفسه. يُرجى تغيير رمز مكتبتك لجعلها فريدة من نوعها ضمن مؤسّستك.

source: Access restricted to: {list_of_groups}
ar: لا يسمح إلاّ بدخول: {list_of_groups}

source: The information you entered is incorrect.
ar: المعلومات المدخلة غير صحيحة

source: Transcripts are supported only for "video" modules.
ar: يتوفّر دعم التفريغ النصي لوحدات الفيديو فقط.

source: Cannot find item by locator.
ar: تعذّر العثور على العنصر باستخدام مُحدّد الموقع.

source: Video locator is required.
ar: محدد مواقع الفيديو (Video locator) مطلوب.

source: This transcript file type is not supported.
ar: نوع ملف نص الفيديو غير مدعوم.

source: Video ID is required.
ar: معرِّف الفيديو (Video ID) مطلوب

source: Incoming video data is empty.
ar: بيانات الفيديو الوارد فارغة.

source: Can't find item by locator.
ar: تعذّر العثور على العنصر باستخدام مُحدّد الموقع.

source: No such transcript.
ar: لا يوجد تفريغ النصيّ بالاسم المطلوب.

source: There is a problem with the chosen transcript file.
ar: هناك مشكلة في ملف نص الفيديو المحدد.

source: There is a problem with the existing transcript file. Please upload a different file.
ar: هناك مشكلة في ملف نص الفيديو هذا. حاول تحميل ملف مختلف.

source: YouTube ID is required.
ar: معرِّف اليوتيوب (YouTube ID) مطلوب

source: There is a problem with the YouTube transcript file.
ar: هناك مشكلة في ملف نص فيديو اليوتيوب المحدد.

source: Insufficient permissions
ar: صلاحيات غير كافية

source: Could not find user by email address '{email}'.
ar: تعذّر العثور على المستخدم من خلال عنوان البريد الإلكتروني ’{email}‘.

source: No `role` specified.
ar: لم يحدَّد أيُّ دور.

source: User {email} has registered but has not yet activated his/her account.
ar: لقد أنشأ المستخدم {email} حسابه ولكنه لم يفعِّله بعد.

source: Invalid `role` specified.
ar: الدور المحدَّد غير صالح

source: You may not remove the last Admin. Add another Admin first.
ar: لا يُسمح لك بإزالة المدير الأخير. يُرجى إضافة مدير آخر أوّلًا.

source: Uploading
ar: يجري الرفع

source: In Progress
ar: قيد المعالجة

source: Ready
ar: جاهز

source: Uploaded
ar: تم رفعُه

source: Failed
ar: فشِل رفعُه

source: Cancelled
ar: مُلغى

source: Failed Duplicate
ar: فشل بسبب تكراره

source: YouTube Duplicate
ar: نسخة مطابقة على يوتيوب

source: Invalid Token
ar: رمز الوصول غير صالح

source: Imported
ar: مُستورد

source: Unknown
ar: مجهول

source: Transcription in Progress
ar: جاري عمل التفريغ النصي

source: Transcript Ready
ar: التفريغ النصي جاهز

source: The image must have name, content type, and size information.
ar: يجب أن يكون للصورة اسم ونوع المحتوى ومعلومات الحجم.

source: This image file type is not supported. Supported file types are {supported_file_formats}.
ar: نوع ملف الصورة هذا غير مدعوم. أنواع الملفات المدعومة هي {supported_file_formats}.

source: This image file must be smaller than {image_max_size}.
ar: يجب أن يكون حجم ملف الصورة هذا أصغر من {image_max_size}.

source: This image file must be larger than {image_min_size}.
ar: يجب أن يكون حجم ملف الصورة هذا أكبر من {image_min_size}.

source: There is a problem with this image file. Try to upload a different file.
ar: هناك مشكلة في ملف الصورة هذا. حاول تحميل ملف مختلف.

source: Recommended image resolution is {image_file_max_width}x{image_file_max_height}. The minimum resolution is {image_file_min_width}x{image_file_min_height}.
ar: دقة الصورة الموصى بها {image_file_max_width} x {image_file_max_height}. الحد الأدنى للدقة هو {image_file_min_width} x {image_file_min_height}.

source: This image file must have an aspect ratio of {video_image_aspect_ratio_text}.
ar: يجب أن تكون نسبة العرض إلى الارتفاع لملف الصورة {video_image_aspect_ratio_text}.

source: The image file name can only contain letters, numbers, hyphens (-), and underscores (_).
ar: يجب أن يحتوي اسم ملف الصورة فقط على أحرف وأرقام وواصلات (-) وشرطات سفلية (_).

source: An image file is required.
ar: ملف الصورة مطلوب.

source: {profile_name} URL
ar: رابط {profile_name}

source: Duration
ar: المدّة

source: Date Added
ar: تاريخ الإضافة

source: unrequested
ar: غير مطلوب

source: pending
ar: في الانتظار

source: granted
ar: ممنوح

source: denied
ar: مرفوض

source: Studio user
ar: مستخدم الاستوديو

source: The date when state was last updated
ar: تاريخ آخر تحديث للحالة

source: Current course creator state
ar: الحالة الحالية لمُنشئ المساق

source: Optional notes about this user (for example, why course creation access was denied)
ar: ملاحظات عن هذا المستخدم (لماذا مثلًا رُفض الوصول لإنشاء مساق)

source: Force Publish Course
ar: النشر القسري لمسودات المساق

source: Sometimes the draft and published branches of a course can get out of sync. Force publish course command resets the published branch of a course to point to the draft branch, effectively force publishing the course. This view dry runs the force publish command
ar: في بعض الأحيان، تكون الفروع المنشورة ومسودات الدورة التدريبية غير متزامنة. يقوم أمر النشر القسري للمساق بإعادة تعيين الفرع المنشور للمساق للإشارة إلى فرع المسودة، مما يعني - عمليًا - نشرالمساق قسريًا. يقوم هذا العرض بتنفيذ تجربة أمر النشر القسريّ.

source: Please provide course id.
ar: يُرجى إدخال معرِّف المساق.

source: Invalid course key.
ar: مفتاح مساق غير صالح.

source: No matching course found.
ar: لم يُعثَر على مساق مطابق.

source: Force publishing course is not supported with old mongo courses.
ar: النشر القسريّ غير مدعوم لمساقات مونجو القديمة.

source: Course is already in published state.
ar: المساق في حالة "منشور" بالفعل.

source: Incorrect format for field '{name}'. {detailed_message}
ar: تنسيق غير صحيح لحقل ’{name}‘. {detailed_message}

source: Your Platform Studio
ar: إستوديو منصتك

source: Studio
ar: استوديو

source: Dictionary with the available tags
ar: قاموس بالوسوم المتاحة

source: Page Not Found
ar: لم يُعثر على الصفحة

source: Page not found
ar: لم يُعثر على الصفحة

source: Content
ar: المحتوى

source: Settings
ar: الإعدادات

source: Loading
ar: يجري التحميل

source: Course Number
ar: رقم المساق

source: Course Outline
ar: مخطّط المساق

source: Error:
ar: خطأ:

source: Organization:
ar: المؤسّسة:

source: Course Number:
ar: رقم المساق:

source: Course Run:
ar: تشغيل المساق:

source: Courses
ar: المساقات

source: Sign In to {studio_name}
ar: الدخول إلى {studio_name}

source: Don't have a {studio_name} Account? Sign up!
ar: أليس لديك حساب {studio_name} ؟ سجِّل الآن!

source: Required Information to Sign In to {studio_name}
ar: المعلومات المطلوبة لدخول {studio_name}

source: E-mail
ar: البريد الإلكتروني

source: example: username@domain.com
ar: مثال: username@domain.com

source: Forgot password?
ar: هل نسيت كلمة المرور؟

source: example: Jane Doe
ar: مثال: أحمد شوقي

source: Public Username
ar: اسم المستخدم العلنيّ

source: example: JaneDoe
ar: مثال:أحمد_شوقي

source: Course End Date
ar: تاريخ انتهاء المساق

source: Instructors
ar: المُدرسين في المساق

source: Requirements
ar: المتطلّبات

source: Details
ar: التفاصيل

source: View
ar: عرض

source: Reset
ar: امسَح

source: Legal
ar: القانوني

source: Choose Language
ar: اختر لغة

source: Account
ar: الحساب

source: Help
ar: المساعدة

source: Looking for help with {studio_name}?
ar: هل تحتاج إلى مساعدة في استخدام {studio_name}؟

source: Hide {studio_name} Help
ar: اخفِ المساعدة المتعلِّقة بـ {studio_name}

source: {studio_name} Documentation
ar: توثيق {studio_name}

source: Access documentation on http://docs.edx.org
ar: يمكنك الاطلاع على التوثيق بزيارة http://docs.edx.org

source: edX Documentation
ar: توثيق edX

source: Enroll in edX101: Overview of Creating an edX Course
ar: التحِق بمساق edX101: مدخل إلى إنشاء مساقات في edX

source: Enroll in edX101
ar: التحِق بمساق edX101

source: Enroll in StudioX: Creating a Course with edX Studio
ar: التحق بمساق StudioX: إنشاء مساق باستخدام edX Studio

source: Enroll in StudioX
ar: التحق بمساق StudioX

source: Send an email to {email}
ar: أرسل رسالةً إلى {email}

source: name
ar: الاسم

source: Usermenu
ar: قائمة المستخدم

source: Usermenu dropdown
ar: قائمة المستخدم المنسدلة

source: Sign Out
ar: خروج

source: Code Editor
ar: محرِّر النصوص البرمجية

source: Feedback Form
ar: استمارة الآراء والملاحظات

source: Email: {email}
ar: البريد الإلكتروني: {email}

source: Full Name: {realname}
ar: الاسم الكامل: {realname}

source: Inquiry Type: {inquiry_type}
ar: طبيعة الرسالة: {inquiry_type}

source: Message: {message}
ar: الرسالة: {message}

source: Tags: {tags}
ar: الوسوم: {tags}

source: Additional Info:
ar: معلومات إضافية:

source: Feedback from user
ar: ملاحظات المستخدمين

source: The email associated with your {platform_name} account has changed from {old_email} to {new_email}.
ar: البريد الالكتروني المرتبط بحسابك لدى منصة {platform_name} قد تغير من {old_email} إلى {new_email}.

source: No action is needed on your part.
ar: ليس هناك حاجة لاتخاذ أي إجراء من جانبك.

source: If this change is not correct, contact {link_start}{platform_name} Support{link_end} or your administrator.
ar: إذا كان هذا التغيير غير صحيح، تواصل مع {link_start}{platform_name} الدعم الفني {link_end} أو المسؤول الخاص بك.

source: Your {platform_name} account email has been updated
ar: تم تحديث البريد الإلكتروني الخاص بحسابك على منصة {platform_name}

source: Add a Post
ar: أضف موضوعًا

source: New topic form
ar: نموذج موضوع جديد

source: Discussion thread list
ar: قائمة مواضيع المناقشة

source: %s discussion started
ar: بدأ %s نقاش

source: %s comment
ar: %s تعليق

source: Discussion unavailable
ar: المناقشة غير متاحة

source: The discussions are currently undergoing maintenance. We'll have them back up shortly!
ar: تخضع المناقشات حاليًّا لأعمال الصيانة. سنعيد تفعيلها قريبًا!

source: Content Locked
ar: محتوى مغلق

source: You must complete the prerequisites for '{prereq_section_name}' to access this content.
ar: يجب إكمال المتطلبات المسبقة التالية '{prereq_section_name}' للوصول إلى هذا المحتوى.

source: Go to Prerequisite Section
ar: انتقل إلى قسم المتطلبات الأساسية

source: Collapse Instructions
ar: اخفِ التعليمات

source: Guided Discussion
ar: مناقشة موجَّهة

source: Hide Annotations
ar: اخفِ الملاحظات

source: Bookmarked
ar: تم إضافته إلى الإشارات المرجعية

source: Bookmark this page
ar: أضف هذه الصفحة إلى علامات المتصفِّح

source: You do not have access to this dependency module.
ar: عذرًا، لا تملك صلاحية دخول هذه الوحدة المطلوبة.

source: LEARN MORE
ar: اعرف المزيد

source: Starts
ar: البداية

source: Starts: {date}
ar: يبدأ في: {date}

source: View all Courses
ar: اعرض جميع المساقات

source: Dashboard
ar: لوحتي التعليمية

source: You are not enrolled in any courses yet.
ar: لست ملتحقًا بأيّ مساقات بعد.

source: Explore courses
ar: تصفح المساقات

source: Activate your account!
ar: قم بتفعيل حسابك!

source: Course-loading errors
ar: الأخطاء المتعلّقة بتحميل المساقات

source: Search Your Courses
ar: ابحث في مساقاتك

source: Clear search
ar: امسح البَحث

source: Account Status Info
ar: معلومات حالة الحساب

source: Order History
ar: سجلّ المشتريات

source: Email Settings for {course_number}
ar: إعدادات البريد الإلكتروني للمساق رقم {course_number}

source: Receive course emails
ar: استلم رسائل البريد الإلكتروني المتعلقة بالمساق

source: Save Settings
ar: احفظ الإعدادات

source: Unenroll
ar: إلغاء التسجيل

source: View Unit in Studio
ar: اعرض الوحدة في استديو

source: E-mail change failed
ar: فشل تغيير البريد الإلكتروني

source: We were unable to send a confirmation email to {email}
ar: لم نتمكَّن من إرسال رسالة تأكيد إلى {email}

source: Go back to the {link_start}home page{link_end}.
ar: ارجِع إلى{link_start}الصفحة الرئيسيّة{link_end}.

source: E-mail change successful!
ar: نجح تغيير البريد الإلكتروني

source: You should see your new email in your {link_start}dashboard{link_end}.
ar: سيظهر عنوان بريدك الإلكتروني الجديد في صفحة {link_start}"لوحتي التعليمية"{link_end} الخاصة بحسابك.

source: An account with the new e-mail address already exists.
ar: يوجد حساب موجود بالفعل بعنوان البريد الإلكتروني الجديد.

source: You should Register before trying to access the Unit
ar: عليك إنشاء حساب في المنصة قبل أن تستطيع مشاهدة الوحدة.

# self
source: Enroll
ar: سجّل

source: Don't enroll
ar: لا تسجّل

source: Student Enrollment Form
ar: نموذج تسجيل الطالب

source: Course:
ar: المساق:

source: Add new students
ar: أضِف طلّاب جدد

source: Existing students:
ar: الطلّاب الحاليّون:

source: New students added:
ar: الطلاب الذين أضيفوا حديثًا:

source: Students rejected:
ar: الطلّاب الذين رُفِضوا:

source: Debug:
ar: تصحيح الأخطاء:

source: External Authentication failed
ar: فشلت عملية الاستيثاق الخارجية

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
ar: يُرجى إدخال عنوان بريدك الإلكتروني أدناه وسنرسل لك تعليمات ضبط كلمة مرور جديدة.

source: Required Information
ar: معلومات مطلوبة

source: Your E-mail Address
ar: عنوان بريدك الإلكتروني

source: This is the e-mail address you used to register with {platform}
ar: هذا هو عنوان البريد الإلكتروني الذي استخدمته للتسجيل في {platform}

source: Reset My Password
ar: غيِّر كلمة مروري

source: Email is incorrect.
ar: عنوان البريد الإلكتروني غير صحيح

source: Support
ar: الدعم

source: For {strong_start}questions on course lectures, homework, tools, or materials for this course{strong_end}, post in the {link_start}course discussion forum{link_end}.
ar: انشر أي سؤال متعلق بالمادة مثل {strong_start}كأن تسأل عن المحاضرات أو الواجبات أو الأدوات أو المادّة الدراسيّة لهذا المساق{strong_end} في {link_start}منتدى المناقشة الخاص بالمساق{link_end}.

source: Have {strong_start}general questions about {platform_name}{strong_end}? You can find lots of helpful information in the {platform_name} {link_start}FAQ{link_end}.
ar: هل لديك {strong_start}أسئلة عامّة عن {platform_name}{strong_end} ؟ستجد الكثير من الإجابات والمعلومات المفيدة في صفحة {link_start}الأسئلة الشائعة{link_end}.

source: Have a {strong_start}question about something specific{strong_end}? You can contact the {platform_name} general support team directly:
ar: هل لديك{strong_start}سؤال حول شيء محدد{strong_end}؟ إذا كان كذلك، فبإمكانك التواصل مع فريق الدعم والمساعدة في {platform_name}:

source: Report a problem
ar: الإبلاغ عن مشكلة

source: Make a suggestion
ar: تقديم اقتراح

source: Ask a question
ar: طرح سؤال

source: Please note: The {platform_name} support team is English speaking. While we will do our best to address your inquiry in any language, our responses will be in English.
ar: تُرجى ملاحظة: أنّ فريق الدعم لدى {platform_name} ناطق باللغة العربية. وبينما سنبذل قصارى جهدنا للإجابة على تساؤلاتك المطروحة بأي لغة، إلّا أنّ ردودنا غالبًا ستكون باللغة العربية.

source: Briefly describe your issue
ar: اشرح مشكلتك باختصار

source: Tell us the details
ar: أخبرنا عن التفاصيل

source: Describe what you were doing when you encountered the issue. Include any details that will help us to troubleshoot, including error messages that you saw.
ar: صف ما كنت تفعله عندما واجهت المشكلة. أدرج أي تفاصيل التي قد تساعدنا على استكشاف الخطأ وإصلاحه، بما في ذلك رسائل الخطأ التي رأيتها.

source: Thank You!
ar: شكرًا لك!

source: Thank you for your inquiry or feedback. We typically respond to a request within one business day, Monday to Friday. In the meantime, please review our {link_start}detailed FAQs{link_end} where most questions have already been answered.
ar: نشكرك على تقديم تساؤلك أو آرائك وملاحظاتك. نردّ عادةً على أي طلب في غضون يوم عمل واحد (أيام العمل: الأحد إلى الخميس). بينما تنتظر، نرجو منك مراجعة صفحتنا {link_start}للأسئلة الشائعة المفصّلة{link_end} حيث ستجد إجابات لغالبية الأسئلة المطروحة.

source: - Select -
ar: - اختر -

source: problem
ar: المشكلة

source: Report a Problem
ar: بلِّغ عن مشكلة

source: Brief description of the problem
ar: شرح موجز للمشكلة

source: Details of the problem you are encountering{asterisk}
ar: تفاصيل المشكلة التي واجهتها {asterisk}

source: suggestion
ar: اقتراح

source: Make a Suggestion
ar: تقديم اقتراح

source: Brief description of your suggestion
ar: شرح موجز لمقترحك

source: question
ar: سؤال

source: Ask a Question
ar: طرح سؤال

source: Brief summary of your question
ar: ملخّص موجز عن سؤالك

source: An error has occurred.
ar: حدث خطأ ما.

source: Please {link_start}send us e-mail{link_end}.
ar: يُرجى {link_start}مراسلتنا على بريدنا الإلكتروني{link_end}.

source: Please try again later.
ar: تُرجى إعادة المحاولة فيما بعد.

source: The course has ended.
ar: انتهى هذا المساق.

source: The due date for this assignment has passed.
ar: انقضى الموعد النهائي لهذا الواجب.

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
ar: لأن المساق قد انتهى، هذا الواجب لم يعد متوفرًا.{line_break}إذا كنت قد أكملت هذا الواجب يمكنك رؤية علامتك على {link_start}progress page{link_end}.

source: Because the due date has passed, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
ar: لأن الموعد المحدد قد انقضى، هذا الواجب لم يعد متوفرًا.{line_break}إذا كنت قد أكملت هذا الواجب يمكنك رؤية علامتك على {link_start}progress page{link_end}.

source: Note: only instructors may annotate.
ar: ملاحظة: يستطيع المدرِّسون فقط أن يضيفوا ملاحظات.

source: Search for a course
ar: ابحث عن مساق

source: Welcome to the Open edX{registered_trademark} platform!
ar: أهلًا بك في منصّة إدراك{registered_trademark}!

source: It works! This is the default homepage for this Open edX instance.
ar: نجح الأمر! أنت الآن في الصفحة الرئيسية الافتراضية لهذه النسخة من Open edX.

source: Invalid email change key
ar: مفتاح تغيير البريد الإلكتروني غير صالح

source: This e-mail key is not valid. Please check:
ar: مفتاح البريد الإلكتروني هذا غير صالح. يُرجى التحقّق منه:

source: Was this key already used? Check whether the e-mail change has already happened.
ar: هل سبق أن استُخدم هذا المفتاح؟ يُرجى التحقّق إذا تمّ تغيير البريد الإلكتروني بالفعل.

source: Did your e-mail client break the URL into two lines?
ar: هل قام برنامج البريد الإلكتروني الخاص بك بتقسيم الرابط على سطرين؟

source: The keys are valid for a limited amount of time. Has the key expired?
ar: المفاتيح صالحة لمدّة محدودة فقط. هل انتهت صلاحية المفتاح؟

source: Showing all matching content eligible to be added into {display_name}. Each student will be assigned {max_count} component drawn randomly from this list.
ar: يظهر كلّ المحتوى المطابق والذي يمكن إضافته إلى {display_name}. لا يُعيَّن لكل طالب أيُّ مكوّنعشوائيًا من هذه القائمة.

source: Helpful Information
ar: معلومات مفيدة

source: Login via OpenID
ar: الدخول باستخدام OpenID

source: You can now start learning with {platform_name} by logging in with your <a rel="external" href="http://openid.net/">OpenID account</a>.
ar: بإمكانك الآن أن تبدأ التعلّم في {platform_name} من خلال الدخول باستخدام <a rel="external" href="http://openid.net/">حسابك في OpenID</a>.

source: Not Enrolled?
ar: هل أنت غير مسجَّل؟

source: Sign up for {platform_name} today!
ar: سجّل عضويتك اليوم في {platform_name}!

source: Need Help?
ar: هل تحتاج إلى مساعدة؟

source: Looking for help signing in or with your {platform_name} account?
ar: هل تحتاج إلى مساعدة في الدخول إلى حسابك في {platform_name}؟

source: View our help section for answers to commonly asked questions.
ar: تصفّح قسم المساعدة الخاص بنا لتجد الإجابات على الأسئلة الشائعة.

source: Log into your {platform_name} Account
ar: ادخل إلى حسابك في {platform_name}
