Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: A unique identifier for the example certificate. This is used when we receive a response from the queue to determine which example certificate was processed.
ar: معرّف فريد للشهادة النموذجية. يُستخدَم عند تلقّي إجابة من "queue" لتحديد الشهادات النموذجية التي جرت معالجتها.

source: An access key for the example certificate. This is used when we receive a response from the queue to validate that the sender is the same entity we asked to generate the certificate.
ar: مفتاح وصول إلى الشهادة النموذجية، يُستخدَم عندما نتلقّى إجابة من ’الطابور‘ للتثبّت من أنّ الجهة المرسِلة هي ذاتها الجهة التي طلبنا منها إصدار الشهادة.

source: The full name that will appear on the certificate.
ar: الاسم الكامل كما سيظهر على الشهادة.

source: The template file to use when generating the certificate.
ar: ملفّ القالب الذي سيُستخدم عند إنشاء الشهادة.

source: The status of the example certificate.
ar: حالة الشهادة النموذجية.

source: The reason an error occurred during certificate generation.
ar: سبب حدوث خطأ أثناء إنشاء الشهادة.

source: The download URL for the generated certificate.
ar: رابط التنزيل للشهادة المُعدّة.

source: Name of template.
ar: اسم النموذَج.

source: Description and/or admin notes.
ar: الوصف أو ملاحظات المشرف أو كلاهما.

source: Django template HTML.
ar: نموذج "Django" بصيغة "HTML".

source: Organization of template.
ar: المؤسسة صاحِبة النموذَج.

source: The course mode for this template.
ar: وَضع المساق المعتمد لهذا النموذج.

source: On/Off switch.
ar: مفتاح التشغيل والإيقاف.

source: Description of the asset.
ar: وصف الموجودات.

source: Asset file. It could be an image or css file.
ar: ملف الموجودات. يمكن أن يكون صورة أو ملف css.

source: Asset's unique slug. We can reference the asset in templates using this value.
ar: الكتلة الفريدة للمحتوى. يمكننا الإشارة إلى المحتوى ضمن النماذج باستخدام هذه القيمة.

source: user is not given.
ar: لم يُحدّد المستخدم.

source: user '{user}' does not exist
ar: المستخدم '{user}' غير موجود

source: Course id '{course_id}' is not valid
ar: معرِّف المساق '{course_id}' غير صالِح

source: The course does not exist against the given key '{course_key}'
ar: لا يتوفر مساق للمفتاح '{course_key}' المُعطى.

source: User {username} does not exist
ar: المستخدم {username} غير موجود.

source: {course_key} is not a valid course key
ar: {course_key} ليس مفتاح مساق صالحًا

source: The course {course_key} does not exist
ar: المساق {course_key} غير موجود

source: User {username} is not enrolled in the course {course_key}
ar: إن المستخدم {username} غير ملتحق بالمساق {course_key}

source: An unexpected error occurred while regenerating certificates.
ar: حدث خطأ غير متوقّع أثناء إعادة إنشاء الشهادات.

source: An {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
ar: تُفيد شهادة {cert_type} بأنّ المتعلِّم قد وافق على الالتزام بميثاق الشرف المتعمَد لدى {platform_name} واستكمَل كافة المهام المطلوبة منه في هذا المساق بموجب التعليمات.

source: A {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines. A {cert_type} certificate also indicates that the identity of the learner has been checked and is valid.
ar: تُفيد شهادة {cert_type} بأنّ المتعلِّم قد وافق على الالتزام بميثاق الشرف المتعمَد لدى {platform_name} واستكمَل كافة المهام المطلوبة في هذا المساق بموجب التعليمات. كما وتشير الشهادة {cert_type} إلى أن هوية المتعلّم صحيحة وقد تمّ توثيقها والتحقق منها.

source: An {cert_type} certificate demonstrates a high level of achievement in a program of study, and includes verification of the student's identity.
ar: تعبِّر شهادة {cert_type} عن مستوى عالٍ من الإنجازات في برنامج دراسي ما، وتتضمّن توثيقًا لهويّة الطالب.

source: {month} {day}, {year}
ar: {day}/{month}/{year}

source: This is a valid {platform_name} certificate for {user_name}, who participated in {partner_short_name} {course_number}
ar: هذه شهادة صالحة من {platform_name} لـ{user_name} الذي شارك في مساق {course_number} الذي تقدّمه {partner_short_name}

source: {partner_short_name} {course_number} Certificate | {platform_name}
ar: شهادة {course_number} من {partner_short_name} | {platform_name}

source: successfully completed, received a passing grade, and was awarded this {platform_name} {certificate_type} Certificate of Completion in
ar: قد نجح في إتمام المساق، حصل على علامة النجاح، ومُنِح بناءً على ذلك شهادة إتمام {certificate_type} من {platform_name} في

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
ar: تُقرّ {platform_name} الإنجازات من خلال شهادات، تُمنح وِفقًا لأنشطة المساق التي يُكملها طلّاب {platform_name}.

source: All rights reserved
ar: جميع الحقوق محفوظة

source: Invalid Certificate
ar: شهادة غير صالحة

source: Certificate Validation
ar: توثيق الشهادة

source: About {platform_name} Accomplishments
ar: نبذة عن إنجازات {platform_name}

source: Issued On:
ar: صدرت في:

source: Certificate ID Number
ar: مُعرِّف الشهادة

source: About {platform_name} Certificates
ar: نبذة عن شهادات {platform_name}

source: How {platform_name} Validates Student Certificates
ar: كيف توثِّق {platform_name} شهادات الطلّاب

source: Certificates issued by {platform_name} are signed by a gpg key so that they can be validated independently by anyone with the {platform_name} public key. For independent verification, {platform_name} uses what is called a "detached signature"&quot;".
ar: توقَّع الشهادات الصادرة عن {platform_name} بمفتاح GPG للسماح لأي شخص يحمل مفتاح {platform_name} العام من التحقق منها بشكل مستقلّ. بالنسبة لعمليّة التحقق المستقلّ، تستخدم {platform_name} ما يُسمّى بـ"التوقيع المنفصل"&quot;".

source: Validate this certificate for yourself
ar: وثِّق هذه الشهادة لنفسك

source: {platform_name} offers interactive online classes and MOOCs.
ar: تُقدّم المنصّة {platform_name} صفوفًا ومساقات MOOC تفاعلية مُتاحة عبر الإنترنت.

source: About {platform_name}
ar: نبذة عن {platform_name}

source: Learn more about {platform_name}
ar: اعرف المزيد عن {platform_name}

source: Learn with {platform_name}
ar: تعلَّم في {platform_name}

source: Work at {platform_name}
ar: اعمل لدى {platform_name}

source: Contact {platform_name}
ar: تواصل مع {platform_name}

source: {platform_name} acknowledges the following student accomplishment
ar: تُقِرّ {platform_name} بإنجازات الطالب التالية

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
ar: مساق تعليمي تقدِّمه {partner_short_name}، كمبادرة تعليم عبر الإنترنت من {partner_long_name}.

source: a course of study offered by {partner_short_name}.
ar: مساق دروس تعليمية تقدِّمه {partner_short_name}.

source: I completed the {course_title} course on {platform_name}.
ar: لقد أتممتُ مساق {course_title} على {platform_name}.

source: I completed a course at {platform_name}. Take a look at my certificate.
ar: لقد أتممتُ مساقًا على {platform_name}. ألقِ نظرة على شهاداتي.

source: More Information About {user_name}'s Certificate:
ar: المزيد من المعلومات عن شهادة {user_name}:

source: {fullname}, you earned a certificate!
ar: تهانينا يا {fullname}؛ لقد حصلت على شهادة.

source: Congratulations! This page summarizes what you accomplished. Show it off to family, friends, and colleagues in your social and professional networks.
ar: تهانينا! في هذه الصفحة تجد شهادتك المستحقة لهذا المساق. نحن تؤمن بأنك قد حزت على هذه الشهادة بجدارتك بعد بذلك لجهد متواصل وعطاء لم ينضب؛ بإمكانك مشاركة إنجازك هذا مع عائلتك وأصدقائك وزملائك في العمل في أي وقت

source: More about {fullname}'s accomplishment
ar: المزيد من التفاصيل عن إنجازات {fullname}

source: Username
ar: اسم المستخدم

source: Grade
ar: العلامة

source: Percent
ar: النسبة

source: Opened by this number of students
ar: فتحها هذا العدد من الطلاب

source: subsections
ar: أقسام فرعية

source: Count of Students
ar: عدد الطلّاب

source: Percent of Students
ar: نسبة الطلّاب

source: Score
ar: النتيجة

source: problems
ar: المسائل

source: {course_id} is not a valid course key.
ar: مفتاح المساق {course_id} غير صالِح

source: Course {course_id} does not exist.
ar: المساق {course_id} غير موجود

source: Use the checkout page hosted by the E-Commerce service.
ar: استخدِم صفحة الدفع التي تتيحها خدمة التجارة الإلكترونيّة.

source: Path to course(s) checkout page hosted by the E-Commerce service.
ar: مسار إلى صفحة الخروج من المساق (المساقات) التي تستضيفها خدمة التجارة الإلكترونية.

source: Cache Time To Live
ar: مدّة الحفظ المؤقت (cache)

source: Specified in seconds. Enable caching by setting this to a value greater than 0.
ar: محدّد بالثواني. فعّل ميزة الاحتفاظ بالبيانات في الذاكرة المؤقتة Cache بتعيين هذه القيمة لتصبح أكبر من 0.

source: Path to order receipt page.
ar: مسار صفحة إيصال المدفوعات

source: Automatically approve valid refund requests, without manual processing
ar: الموافقة تلقائياً على طلبات الاسترداد الصالحة، دون المعالجة اليدوية

source: [Refund] User-Requested Refund
ar: [Refund] استرداد المال بطلب من المستخدم

source: A refund request has been initiated for {username} ({email}). To process this request, please visit the link(s) below.
ar: أُصدِر طلب استرداد المال للمستخدم {username} ({email}). تُرجى زيارة الرابط (أو الروابط) أدناه لمعالجة هذا الطلب.

source: Receipt
ar: إيصال

source: Payment Failed
ar: فشلت عملية الدفع

source: There was a problem with this transaction. You have not been charged.
ar: حدثت مشكلة في هذه المعاملة. ولم تُخصم منك أيّه دفعة.

source: Make sure your information is correct, or try again with a different card or another form of payment.
ar: تأكّد من صحّة معلوماتك، أو أعِد المحاولة باستخدام بطاقة مختلفة أو وسيلة دفع أخرى.

source: A system error occurred while processing your payment. You have not been charged.
ar: حدث خطأ في النظام أثناء معالجة دفعتك. لم تُخصَم منك أيّ دفعة.

source: Please wait a few minutes and then try again.
ar: يُرجى الانتظار لبضع دقائق ثمّ إعادة المحاولة.

source: For help, contact {payment_support_link}.
ar: للمساعدة، اتصل بـ {payment_support_link}

source: An error occurred while creating your receipt.
ar: حدث خطأ أثناء إعداد إيصالك.

source: If your course does not appear on your dashboard, contact {payment_support_link}.
ar: إذا لم يظهر مساقك على صفحة "لوحتي التعليمية" الخاصة بك، يُرجى التواصل مع {payment_support_link}.

source: Earn a certificate
ar: إكتسب شهادة

source: Complete the course
ar: أكمل المساق

source: Explore the course
ar: تصفح المساق

source: Not sure yet
ar: لست متأكدا بعد

source: Wiki
ar: الويكي

source: This is the wiki for **{organization}**'s _{course_name}_.
ar: هذه هي صفحة الويكي الخاصة بمساق _{course_name}_ التابع لـ**{organization}**.

source: Course page automatically created.
ar: أُنشئت صفحة المساق آليًّا.

source: Welcome to the {platform_name} Wiki
ar: مرحبًا بك في صفحة ويكي لمنصّة {platform_name}

source: Visit a course wiki to add an article.
ar: تفضّل بزيارة إحدى صفحات الويكي الخاصة بالمساق لإضافة مقال.

source: Course has not started
ar: لم يبدأ المساق

source: Course does not start until {}
ar: لن يبدأ المساق حتى {}

source: You have unfulfilled milestones
ar: لديك مراحل مهمّة غير منجَزة.

source: You do not have access to this course
ar: لا تملك صلاحية دخول هذا المساق

source: You do not have access to this course on a mobile device
ar: لا تملك صلاحية دخول هذا المساق من جهاز محمول

source: Upgrade to Verified
ar: قم بالترقية لتحصل على شهادة موثّقة

source: {relative} ago - {absolute}
ar: منذ {relative} - {absolute}

source: in {relative} - {absolute}
ar: خلال {relative} - {absolute}

source: Course Starts
ar: يبدأ المساق في

source: Don't forget to add a calendar reminder!
ar: لا تنسى إضافة تذكير في الروزنامة!

source: Course starts in {time_remaining_string} on {course_start_date}.
ar: يبدأ المساق في {time_remaining_string} بتاريخ {course_start_date}.

source: Course starts in {time_remaining_string} at {course_start_time}.
ar: يبدأ المساق في {time_remaining_string} عند الساعة {course_start_time}.

source: Course End
ar: نهاية المساق

source: To earn a certificate, you must complete all requirements before this date.
ar: لتحصل على شهادة، لابدّ من إتمام جميع المتطلّبات قبل هذا التاريخ.

source: After this date, course content will be archived.
ar: ستتم أرشفة محتوى المادة بعد هذا التاريخ.

source: This course is archived, which means you can review course content but it is no longer active.
ar: هذا المساق مؤرشَف، يعني هذا أنّ بإمكانك مراجعة محتوى المساق، إلا أنّ المساق لم يعد نشِطًا.

source: This course is ending in {time_remaining_string} on {course_end_date}.
ar: ينتهي هذا المساق خلال {time_remaining_string} بتاريخ {course_end_date}.

source: This course is ending in {time_remaining_string} at {course_end_time}.
ar: ينتهي هذا المساق خلال {time_remaining_string} في تمام الساعة: {course_end_time}.

source: Certificate Available
ar: الشهادة متوفرة

source: Day certificates will become available for passing verified learners.
ar: التاريخ الذي ستصبح فيه الشهادات متاحة للطلّاب الناجحين والمعرّفين.

source: We are working on generating course certificates.
ar: نحن نعمل على إنشاء الشهادات الخاصة بالمساق.

source: Upgrade to Verified Certificate
ar: سجِّل للحصول على شهادة موثقة

source: Verification Upgrade Deadline
ar: الموعد النهائي للتسجيل للحصول على شهادة موثّقة.

source: Don't miss the opportunity to highlight your new knowledge and skills by earning a verified certificate.
ar: لا تفوت فرصة إبراز المعرفة والمهارات الجديدة التي اكتسبتها عن طريق الحصول على شهادة موثّقة.

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
ar: ما زلت مؤهلًا للتسجيل للحصول على شهادة موثقة! اسعَ لنيلها لتُبرز المعارف والمهارات التي اكتسبتها في هذا المساق.

source: by {date}
ar: بتاريخ {date}

source: Don't forget, you have {time_remaining_string} left to upgrade to a Verified Certificate.
ar: لا تنس أن لديك {time_remaining_string} متبقية للترقية إلى شهادة موثّقة.

source: Don't forget to upgrade to a verified certificate by {localized_date}.
ar: لا تنس ترقية الشهادة إلى شهادة موثّقة ب{localized_date}.

source: In order to qualify for a certificate, you must meet all course grading requirements, upgrade before the course deadline, and successfully verify your identity on {platform_name} if you have not done so already.{button_panel}
ar: لكي تتأهل للحصول على شهادة، يجب أن تستوفي جميع متطلبات الدرجات للمساق وتقوم بالترقية قبل الموعد النهائي للدورة، وتتحقق من هويتك بنجاح على {platform_name} إذا لم تكن قد فعلت ذلك من قبل. {button_panel}

source: Upgrade ({upgrade_price})
ar: ترقية ({upgrade_price})

source: Learn More
ar: اعرف المزيد

source: Retry Verification
ar: أعد محاولة التوثيق

source: Verify My Identity
ar: وثِّق هويتي

source: Missed Verification Deadline
ar: فاتك الموعد النهائي للتوثيق

source: Unfortunately you missed this course's deadline for a successful verification.
ar: لسوء الحظ، لقد فاتك الموعد النهائي المحدّد لعملية التوثيق الناجحة.

source: You must successfully complete verification before this date to qualify for a Verified Certificate.
ar: يجب أن تنجح في استكمال عملية التوثيق قبل هذا التاريخ لتتأهل للحصول على شهادة موثّقة.

source: There is no user with the username or email address {user_name} enrolled in this course.
ar: لا يوجَد مستخدم مسجّل في هذا المساق باستخدام اسم المستخدم أو عنوان البريد الإلكتروني {user_name}.

source: This type of component cannot be shown while viewing the course as a specific student.
ar: بصفتك أحد الطلّاب، لا يمكن عرض هذا النوع من المكوّنات أثناء استعراض المساق.

source: Number of days a learner has to upgrade after content is made available
ar: عدد الأيام التي يتعين على الطالب الترقية فيها بعد إتاحة المحتوى

source: Disable the dynamic upgrade deadline for this course run.
ar: تعطيل الموعد النهائي للترقية الآلية لهذه الدورة التعليمية.

source: Disable the dynamic upgrade deadline for this organization.
ar: تعطيل الموعد النهائي للترقية الآلية لهذه المؤسسة.

source: Syllabus
ar: خطة المساق

source: Progress
ar: التقدُّم

source: Textbooks
ar: الكتب

source: You are not signed in. To see additional course content, {sign_in_link} or {register_link}, and enroll in this course.
ar: أنت غير مسجل الدخول. للاطلاع على محتوى الإضافي، {sign_in_link} أو {register_link} وانضم بهذا المساق.

source: sign in
ar: تسجيل الدخول

source: register
ar: أنشئ حساب

source: Your enrollment: Audit track
ar: تسجيلك: مستمِع

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
ar: أنت الآن مسجل في مسار المستمع لهذا المساق. لا يتضمن مسارُ مستمع شهادةً.

source: We're working on it...
ar: يجري العمل على ذلك...

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
ar: يجري إنشاء شهادتك. يمكنك متابعة العمل في مساقاتك وسوف يظهر رابط لشهادتك على مكتبك هنا ما أن تصبح جاهزة.

source: Your certificate has been invalidated
ar: تم إلغاء شهادتك

source: Please contact your course team if you have any questions.
ar: تواصل مع فريق العمل الخاص بالمساق في حال كانت لديك أيُّ أسئلة.

source: Congratulations, you qualified for a certificate!
ar: تهانينا، لقد تأهلت للحصول على شهادة!

source: You've earned a certificate for this course.
ar: يمكنك الاستمرار في إتمام اختبارات هذا المساق لتحصل على علامة أعلى أو يمكنك إصدار شهادتك الآن حسب علامتك الحالية

source: Certificate unavailable
ar: الشهادة غير متاحة

source: You have not received a certificate because you do not have a current {platform_name} verified identity.
ar: لم تحصل على شهادتك لأنك لم تقم بتوثيق هويتك في {platform_name}.

source: Your certificate is available
ar: شهادتك جاهزة

source: To see course content, {sign_in_link} or {register_link}.
ar: للاطلاع على محتوى المساق، {sign_in_link} أو {register_link}.

source: You must be enrolled in the course to see course content. {enroll_link_start}Enroll now{enroll_link_end}.
ar: يجب ان تقوم بالتسجيل في المساق للاطلاع على محتوى المساق {enroll_link_start}انضم الان{enroll_link_end}.

source: You must be enrolled in the course to see course content.
ar: يجب أن تكون مسجلا في المساق لمشاهدة المحتوى.

source: Invalid location.
ar: موقع غير صالح.

source: User {username} has never accessed problem {location}
ar: لم يقم المستخدم {username} بفتح المسألة {location} أبداً.

source: You must be signed in to {platform_name} to create a certificate.
ar: يجب أن تدخل إلى {platform_name} لإنشاء شهادة.

source: Course is not valid
ar: المساق غير صالح

source: Your certificate will be available when you pass the course.
ar: ستصبح شهادتك متاحة بعد أن تنجح في المساق.

source: Certificate has already been created.
ar: سبق أن أُنشِأَت الشهادة.

source: Certificate is being created.
ar: يجري إنشاء الشهادة.

source: {platform_name} now offers financial assistance for learners who want to earn Verified Certificates but who may not be able to pay the Verified Certificate fee. Eligible learners may receive up to 90{percent_sign} off the Verified Certificate fee for a course. To apply for financial assistance, enroll in the audit track for a course that offers Verified Certificates, and then complete this application. Note that you must complete a separate application for each course you take. We plan to use this information to evaluate your application for financial assistance and to further develop our financial assistance program.
ar: لقد أصبحت {platform_name} توفّر خدمة الدعم المالي للمتعلّمين الراغبين بالحصول على شهادة موثّقة إلا أنهم قد لا يملكون القدرة المالية لدفع رسوم الحصول عليها. يمكن أن يحصل الطلاب المؤهلون على خصم يصل إلى 90{percent_sign} من رسوم الحصول على شهادة موثّقة للمساق. للتقدّم بطلب للحصول على دعم مالي، سجِّل كمستمع في المساق ذي الشهادة الموثّقة، ومن قم بتعبئة الطلب. انتبه إلى أن عليك ملئ طلب منفضل لكل مساق تحضره. ننوي استخدام هذه البيانات لتقييم طلبك للحصول على دعم مالي وتطوير نظام الدعم المالي لدينا.

source: Annual Household Income
ar: دخل الأسرة السنوي

source: Tell us about your current financial situation. Why do you need assistance?
ar: أخبرنا عن وضعك المالي الحالي. ما سبب حاجتك إلى المساعدة؟

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
ar: أخبرنا عن أهدافك العلمية والمهنيّة. كيف سيساعدك الحصول على شهادة موثّقة في هذا المساق على تحقيق هذه الأهداف؟

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
ar: أخبرنا عن خططك لهذا المساق. ما هي الخطوات التي ستتّبعها لإتمام أعمال المساق المطلوبة والحصول على شهادة؟

source: Use between 250 and 500 words or so in your response.
ar: استخدم ما بين 250 إلى 500 كلمة لصياغة ردّك.

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
ar: اختر المساق الذي ترغب بالحصول على شهادة موثّقة له. إذا لم يظهر المساق في القائمة، فتأكّد من أنك قد سجّلت في المساق كمستمع.

source: Specify your annual household income in US Dollars.
ar: حدّد دخل الأسرة السنوي بالدولار الأمريكي.

source: I allow edX to use the information provided in this application (except for financial information) for edX marketing purposes.
ar: أنا أسمح لإدراك باستخدام البيانات المذكورة ضمن هذا الطلب (باستثناء البيانات المالية) لأغراض تسويقية.

source: Path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_DIR
ar: المسار {0} غير موجود، يُرجى إنشاؤه، أو ضبط إعدادات مسار مختلف باستخدام GIT_REPO_DIR

source: Non usable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
ar: لم يتم توفير عنوان GIT قابل للاستخدام. يجب أن يكون على نحو يشبه: git@github.com:mitocw/edx4edx_lite.git

source: Unable to get git log
ar: تعذَّر الحصول على git log

source: git clone or pull failed!
ar: فشلت عملية الاستنساخ أو السحب باستخدام نظام GIT!

source: Unable to run import command.
ar: تعذّر تشغيل أمر الاستيراد.

source: The underlying module store does not support import.
ar: لا يدعم مخزن الوحدات الأساسي عملية استيراد الملفات.

source: The specified remote branch is not available.
ar: الفرع الخارجي المحدّد غير موجود.

source: Unable to switch to specified branch. Please check your branch name.
ar: تعذّر التبديل إلى الفرع المحدّد. يُرجى التحقق من اسم الفرع الذي طلبته.

source: Import the specified git repository and optional branch into the modulestore and optionally specified directory.
ar: قم باستيراد مستودع git المحدد والفرع الاختياري إلى متجر الوحدات وإلى المسار المحدد اختياريًا.

source: Failed in authenticating {username}, error {error}
ar: فشل التحقق من {username} والخطأ هو {error}

source: Failed in authenticating {username}
ar: فشل التحقّق من {username}

source: fixed password
ar: إُصلِحَت كلمة المرور

source: All ok!
ar: كل شيء على ما يُرام!

source: Must provide username
ar: يجب إدخال اسم المستخدم

source: Must provide full name
ar: يجب إدخال الاسم بالكامل

source: Email address must end in {domain}
ar: يجب أن ينتهي عنوان البريد الإلكتروني بالنطاق {domain}

source: Failed - email {email_addr} already exists as {external_id}
ar: فشلت العملية - البريد الإلكتروني {email_addr} موجود مسبقًا كـ {external_id}

source: Password must be supplied if not using certificates
ar: يجب توفير كلمة المرور في حال عدم استخدام شهادات

source: email address required (not username)
ar: البريد الإلكتروني مطلوب (وليس اسم المستخدم)

source: Oops, failed to create user {user}, {error}
ar: عذرًا، فشلت عملية إنشاء المستخدم {user}، الخطأ {error}

source: User {user} created successfully!
ar: أُنشئ المستخدم {user} بنجاح!

source: Cannot find user with email address {email_addr}
ar: تعذّر إيجاد المستخدم الذي يحمل عنوان البريد الإلكتروني {email_addr}
