Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Grading policy definition for this class
ar: تعريف سياسة رصد العلامات في هذا الصف

source: Show Calculator
ar: أظهِر الآلة الحاسبة

source: Enter true or false. When true, students can see the calculator in the course.
ar: أدخِل "true" أو "false". عندما تكون القيمة المدخلة "true"، سيتمكن الطلاب من رؤية الآلة الحاسبة في المساق.

source: Enter the name of the course as it should appear in the edX.org course list.
ar: أدخِل اسم المساق كما يجب أن يظهر في قائمة المساقات على موقع إدراك.

source: Course Display Name
ar: الاسم الظاهر للمساق

source: Course Editor
ar: محرّر المساقات

source: Enter the method by which this course is edited ("XML" or "Studio").
ar: أدخِل طريقة تعديل هذا المساق ("XML" أو "ستوديو").

source: Course Survey URL
ar: رابط استبيان المساق

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
ar: أدخِل رابط استبيان نهاية المساق. في حال لم يكن لمساقك استبيان، اكتب ’null‘.

source: Discussion Blackout Dates
ar: تواريخ حجب النقاشات

source: Enter pairs of dates between which students cannot post to discussion forums. Inside the provided brackets, enter an additional set of square brackets surrounding each pair of dates you add. Format each pair of dates as ["YYYY-MM-DD", "YYYY-MM-DD"]. To specify times as well as dates, format each pair as ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. Be sure to include the "T" between the date and time. For example, an entry defining two blackout periods looks like this, including the outer pair of square brackets: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]
ar: أدخِل تاريخ البداية والنهاية للفترة التي لا يُسمح للطلّاب خلالها بالمشاركة النقاشات. أَحِط كل زوج من التواريخ المُضافة بزوج إضافي من الأقواس المربّعة، وذلك ما بين القوسين المتوفّرين. اكتب التواريخ وفق الصيغة: ["YYYY-MM-DD", "YYYY-MM-DD"]. ولتحديد الأوقات إلى جانب التواريخ، فاكتبها وفق الصيغة: ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. تأكّد من فصل التاريخ عن الوقت بالحرف ’T‘. على سبيل المثال، تُحدّد صيغة الإدخال لأكثر من زوج التواريخ كما يلي (بما فيها زوج الأقواس المربّعة الخارجي): [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]

source: Discussion Topic Mapping
ar: خريطة مواضيع المناقشة

source: Enter discussion categories in the following format: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. For example, one discussion category may be "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. The "id" value for each category must be unique. In "id" values, the only special characters that are supported are underscore, hyphen, and period. You can also specify a category as the default for new posts in the Discussion page by setting its "default" attribute to true. For example, "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.
ar: أدخل فئات المناقشة بالصيغة التالية: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. على سبيل المثال، قد تكون فئة مناقشة هي "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. يجب أن تكون قيمة "id" لكل فئة فريدة. في قيم "id"، الأحرف الخاصة الوحيدة التي يتم دعمها هي تسطير سفلي و مطّة ونقطة. يمكنك أيضا تحديد فئة منها كفئة افتراضية للمشاركات الجديدة في صفحة المناقشة عن طريق تعيين السمة "default" إلى صحيح. على سبيل المثال، "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1", "default": true}.

source: Discussion Sorting Alphabetical
ar: الترتيب الأبجدي للنقاشات

source: Enter true or false. If true, discussion categories and subcategories are sorted alphabetically. If false, they are sorted chronologically by creation date and time.
ar: أدخِل true أو false. إذا أدخلت true، فستترتب فئات النقاشات وفئاتها الفرعية أبجديًا. أما إذا أدخلت false، فستترتب زمنيًّا حسب تاريخ ووقت إنشائها.

source: Course Announcement Date
ar: تاريخ الإعلان عن المساق

source: Enter the date to announce your course.
ar: أدخِل تاريخًا للإعلان عن مساقك.

source: Cohort Configuration
ar: إعدادات الشعبة

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
ar: إدخِل المفاتيح والقيَم لتفعيل ميزة الشعب، عرِّف ميّزة التقسيم الآلي للطلّاب إلى مجمموعات، أو حدد مواضيع النقاش في مختلف أجزاء المساق بأنّها خاصة بأعضاء شعبة معينة.

source: Course Is New
ar: المساق جديد

source: Enter true or false. If true, the course appears in the list of new courses on edx.org, and a New! badge temporarily appears next to the course image.
ar: أدخِل ’true‘ أو ’false‘. إذا أدخلت true، ففسيظهر المساق ضكم قائمة المساقات الجديدة في إداراك، وستظهر علامة "جديد!" بجانب صورة المساق مؤقتًا.

source: Mobile Course Available
ar: المساق مُتاح على الأجهزة المحمولة

source: Enter true or false. If true, the course will be available to mobile devices.
ar: أدخِل ’true‘ أو ’false‘. إذا أدخلت true، فسيكون المساق متاحًا للإجهزة المحمولة.

source: Video Upload Credentials
ar: البيانات اللازمة لرفع الفيديو

source: Enter the unique identifier for your course's video files provided by edX.
ar: أدخِل المعرّف الفريد لملفّات الفيديو الخاصة بمساقك والتي زوّدتك بها إدراك.

source: Course Not Graded
ar: مساق دون تقييم

source: Enter true or false. If true, the course will not be graded.
ar: أدخِل ’true‘ أو ’false‘. إذا أدخلت true، فلن يتم تقييم الطلاب في المساق.

source: Disable Progress Graph
ar: عطِّل الرسم البياني لتقدّم الطلاب

source: Enter true or false. If true, students cannot view the progress graph.
ar: أدخِل ’true‘ أو ’false‘. إذا أدخلت true، فلن يتمكن الطلاب من رؤية الرسم البياني للتقدم.

source: PDF Textbooks
ar: كتب على نَسَق PDF

source: List of dictionaries containing pdf_textbook configuration
ar: قائمة القواميس التي تحوي إعدادات ’pdf_textbook‘

source: HTML Textbooks
ar: كتب على نسق HTML

source: For HTML textbooks that appear as separate tabs in the course, enter the name of the tab (usually the title of the book) as well as the URLs and titles of each chapter in the book.
ar: للكتب ذات صيغة HTML والتي تظهر كتبويبات منفصلة في المساق، أدخِل اسم التبويب (يكون عادةً اسم الكتاب) إضافة إلى الروابط والعناوين الخاصة بكل فصل في الكتاب.

source: Remote Gradebook
ar: دفتر علامات خارجيّ

source: Enter the remote gradebook mapping. Only use this setting when REMOTE_GRADEBOOK_URL has been specified.
ar: يُرجى إدخال خريطة سجل العلامات الخارجي. استخدم هذا الإعداد فقط بعد تحديد رابط سجل العلامات الخارجي.

source: Enable CCX
ar: فعِّل CCX

source: Allow course instructors to assign CCX Coach roles, and allow coaches to manage Custom Courses on edX. When false, Custom Courses cannot be created, but existing Custom Courses will be preserved.
ar: اسمَح لأساتذة المساق بتعيين أدوار مدرّبي ’CCX‘، والسماح للمدرِّبين بإدارة المساقات المخصَّصة على إدراك. عندما تكون القيمة false، فلن يكون بالإمكان إنشاؤ مساقات مخصّصة جديدة، ولكنّ المساقات المخصَّصة الموجودة ستبقى محفوظة.

source: CCX Connector URL
ar: رابط الوصل للمساق المخصص (CCX)

source: URL for CCX Connector application for managing creation of CCXs. (optional). Ignored unless 'Enable CCX' is set to 'true'.
ar: رابط تطبيق الوصل مع ’CCX‘ لإدارة عمليات إنشاء ’CCX‘. (اختياري). يتمّ تجاهله مالم تُضبط خاصية ’تفعيل CCX‘ على القيمة ’true‘.

source: Allow Anonymous Discussion Posts
ar: السماح بعرض نقاشات مجهولة المصدر

source: Enter true or false. If true, students can create discussion posts that are anonymous to all users.
ar: أدخِل ’true‘ أو ’false‘. اختيارك للقيمة ’true‘ سيعني تمكّن الطلاب من إنشاء مشاركات في قسم ’النقاشات‘ بحيث لا يعلم باقي المستخدمين من كتبها.

source: Allow Anonymous Discussion Posts to Peers
ar: اسمح بنشر نقاشات مجهولة المصدر للزملاء

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
ar: أدخِل ’true‘ أو ’false‘. إذا اخترت ’true‘، فسيتمكن الطلّاب من إنشاء مشاركات في قسم "النقاشات" بحيث لا يعلم باقي الطالب أيّهم كتبها. هذا الإعداد لا يخفي هوية كاتب المشاركة عن طاقم المساق.

source: Advanced Module List
ar: قائمة الوحدات المتقدمة

source: Enter the names of the advanced modules to use in your course.
ar: أدخل أسماء الوحدات المتقدمة لاستخدامها في مساقك.

source: Course Home Sidebar Name
ar: اسم المساق كما يظهر ضمن شريط المعلومات الجانبي للصفحة الرئيسية

source: Enter the heading that you want students to see above your course handouts on the Course Home page. Your course handouts appear in the right panel of the page.
ar: أدخِل العنوان الذي تودّ أن يراه الطلّاب في الصفحة الرئيسية للمساق فوق نشرات مساقك. وتَظهر هذه النشرات على اللّوحة اليمنى في الصفحة.

source: Course Handouts
ar: أوراق العمل

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
ar: تكون القيمة true إذا توجّب إظهار المناطق الزمنية في تواريخ المساق. صارت أثريّة وحلّت محلها due_date_display_format.

source: Due Date Display Format
ar: صيغة عرض موعد التسليم

source: Enter the format for due dates. The default is Mon DD, YYYY. Enter "%m-%d-%Y" for MM-DD-YYYY, "%d-%m-%Y" for DD-MM-YYYY, "%Y-%m-%d" for YYYY-MM-DD, or "%Y-%d-%m" for YYYY-DD-MM.
ar: أدخِل صيغة مواعيد التسليم. والصيغة الافتراضية هي DD/MM/YYYY. أدخِل "%m-%d-%Y" لصيغة MM-DD-YYYY، أو"%d-%m-%Y" لصيغة DD-MM-YYYY، أو"%Y-%m-%d" لصيغة YYYY-MM-DD، أو"%Y-%d-%m" لصيغة YYYY-DD-MM.

source: External Login Domain
ar: النطاق الخارجي للدخول

source: Enter the external login method students can use for the course.
ar: أدخِل طريقة الدخول بحساب خارجي التي يمكن للطلّاب استخدامها للمساق.

source: Certificates Downloadable Before End
ar: الشهادات القابلة للتنزيل قبل انتهاء المساق

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
ar: أدخِل ’true‘ أو ’false‘ .تسمح القيمة ’true‘ للطلّاب تنزيل الشهادات قبل انتهاء المساق في حال استوفوا متطلّبات الشهادة.

source: Certificates Display Behavior
ar: سلوك عرض الشهادات

source: Enter end, early_with_info, or early_no_info. After certificate generation, students who passed see a link to their certificates on the dashboard and students who did not pass see information about the grading configuration. The default is end, which displays this certificate information to all students after the course end date. To display this certificate information to all students as soon as certificates are generated, enter early_with_info. To display only the links to passing students as soon as certificates are generated, enter early_no_info.
ar: أدخِل ’end‘ أو ’early_with_info‘ أو ’early_no_info‘. وبعد إنشاء الشهادة، سيرى الطلّاب الناجحون رابطًا لشهاداتهم على اللوحة التعليمية الخاصة بهم، بينما سيرى الطلّاب الراسبون معلومات عن إعدادات التقييم. الإعداد الافتراضي هو ’end‘ الذي يعرِض هذه المعلومات عن الشهادة لكل الطلّاب بعد تاريخ نهاية المساق. أدخِل ’early_with_info‘ لعرض هذه المعلومات عن الشهادة لجميع الطلّاب عندما يتم إنشاء الشهادات، أو أدخِل ’early_no_info‘ لعرض الروابط للطلّاب الناجحين فقط عندما يتم إنشاء الشهادات.

source: Course About Page Image
ar: صورة صفحة "عن المساق"

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
ar: عدِّل اسم ملف صورة المساق. يجب عليك رفع هذا الملف على صفحة "الملفات والمرفوعات". يمكنك أيضًا ضبط صورة المساق في صفحة "الإعدادات والتفاصيل".

source: Course Banner Image
ar: صورة ترويسة المساق

source: Edit the name of the banner image file. You can set the banner image on the Settings & Details page.
ar: عدِّل اسم ملف صورة البانر. يمكنك وضع صورة البانر من خلال صفحة الإعدادات والتفاصيل.

source: Course Video Thumbnail Image
ar: صورة مصغرة لفيديو المساق

source: Edit the name of the video thumbnail image file. You can set the video thumbnail image on the Settings & Details page.
ar: عدِّل اسم ملف الصورة المصغرة للفيديو. يمكنك تعيين الصور المصغرة للفيديو من خلال صفحة الإعدادات والتفاصيل.

source: Issue Open Badges
ar: إصدار الشارات المفتوحة

source: Issue Open Badges badges for this course. Badges are generated when certificates are created.
ar: إصدار الشارات المفتوحة لهذا المساق. تُولّد الشارات عند إنشاء الشهادات.

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the short name of the type of certificate that students receive when they complete the course. For instance, "Certificate".
ar: استخدم هذا الإعداد فقط عند إنشاء شهادات بصيغة PDF. أدخل - بين علامتيّ اقتباس - الاسم المختصر لنوع الشهادة التي يتلقّاها الطلّاب عند إتمامهم للمساق. مثل "شهادة".

source: Certificate Name (Short)
ar: اسم الشهادة (مختصر)

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the long name of the type of certificate that students receive when they complete the course. For instance, "Certificate of Achievement".
ar: استخدم هذا الإعداد فقط عند إنشاء شهادات بصيغة PDF. أدخل - بين علامتيّ اقتباس - الاسم الكامل لنوع الشهادة التي يتلقّاها الطلّاب عند إتمامهم للمساق. مثل "شهادة إنجاز".

source: Certificate Name (Long)
ar: اسم الشهادة (الكامل)

source: Certificate Web/HTML View Enabled
ar: جرى تفعيل خاصية استعراض الشهادة بصفحة ويب/صيغة HTML

source: If true, certificate Web/HTML views are enabled for the course.
ar: في حال ’true‘، يتم تفعيل خاصيّة عرض شهادة هذا المساق على شكل صفحة ويب أو بصيغة HTML.

source: Certificate Web/HTML View Overrides
ar: تجاوز مشاهدة صفحة الويب/html للشهادة

source: Enter course-specific overrides for the Web/HTML template parameters here (JSON format)
ar: أدخِل التجاوزات الخاصة بالمساق بالنسبة لمعاملات قالب الويب/HTML هنا (بصيغة JSON)

source: Certificate Configuration
ar: إعدادات الشهادة

source: Enter course-specific configuration information here (JSON format)
ar: أدخِل معلومات الضبط الخاص بالمساق من هنا (بصيغة JSON)

source: CSS Class for Course Reruns
ar: صنف ’CSS‘ لعمليات إعادة طرح المساق

source: Allows courses to share the same css class across runs even if they have different numbers.
ar: السماح للمساقات بالتشارك في صنف CSS ذاته بغض النظر عن عمليات التشغيل حتى لو كانت تحمل أرقامًا مختلفة.

source: Discussion Forum External Link
ar: الرابط الخارجي للنقاشات

source: Allows specification of an external link to replace discussion forums.
ar: اسمَح بتحديد رابط خارجي لاستبدال منتدى النقاشات.

source: Hide Progress Tab
ar: اخفِ تبويبة "التقدّم"

source: Allows hiding of the progress tab.
ar: اسمح بإخفاء تبويبة التقدّم

source: Course Organization Display String
ar: نص عرض مؤسسة المساق

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
ar: أدخِل مؤسسة المساق التي تودّ أن يظهر في المساق. يحلّ هذا الإعداد محل اسم المؤسسة الذي أُدخِل عندما أُنشِئَ المساق. لاستخدام اسم المؤسسة المُدخل عند إنشاء المساق، يُرجى إدخال القيمة ’null‘.

source: Course Number Display String
ar: نص عرض رقم المساق

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
ar: أدخل رقم المساق الذي تودّ أن يظهر ضمن المساق. يُلغي هذا الإعداد رقم المساق الذي أُدخل عندما أُنشِئَ المساق. لاستخدام الرقم المُدخل عند إنشاء المساق، يُرجى إدخال القيمة ’null‘.

source: Course Maximum Student Enrollment
ar: العدد الأقصى للطلّاب الذين يمكنهم التسجيل في المساق

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
ar: أدخِل العدد الأقصى للطلّاب الذين يمكنهم الالتحاق بالمساق. أدخِل "null" للسماح لعدد غير محدود من الطلّاب.

source: Allow Public Wiki Access
ar: السماح باستخدام عامّة الناس لصفحة الويكي

source: Enter true or false. If true, edX users can view the course wiki even if they're not enrolled in the course.
ar: أدخِل ’true‘ أو ’false‘ .تسمح القيمة ’true‘ لمستخدمي إدراك بعرض صفحة ويكي المخصّصة للمساق حتى لو لم يكونوا مسجّلين فيه.

source: Invitation Only
ar: للمدعوّين فقط

source: Whether to restrict enrollment to invitation by the course staff.
ar: لتحديد ما إذا كان المساق حصرًا لمن حصلوا على دعوة من طاقَم المساق.

source: Pre-Course Survey Name
ar: اسم استبيان ما قبل المساق

source: Name of SurveyForm to display as a pre-course survey to the user.
ar: اسم نموذج الاستبيان ’SurveyForm‘ الذي يجب عرضه للمستخدم كاستبيان ما قبل المساق.

source: Pre-Course Survey Required
ar: تعبئة استبيان ما قبل المساق مطلوبة

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
ar: حدّد فيما إذا كان الطلاب مُلزمين بتعبئة استبيان قبل عرض محتويات مساقك. في حال ضبطت هذه القيمة على ’true‘، فسيتوجّب عليك إضافة اسم للاستبيان إلى إعداد "اسم استبيان المساق" الموجودة أعلاه.

source: Course Visibility In Catalog
ar: إمكانية مشاهدة المساق في القائمة

source: Defines the access permissions for showing the course in the course catalog. This can be set to one of three values: 'both' (show in catalog and allow access to about page), 'about' (only allow access to about page), 'none' (do not show in catalog and do not allow access to an about page).
ar: تحدِّد هذه القيمة صلاحيات الدخول لعرض المساق ضمن دليل المساقات، ويمكن ضبطها وفق أحد الخيارات الثلاث: ’كلاهما‘ (العرض في الدليل، والسماح بالدخول إلى صفحة ’لمحة عن المساق‘)، ’لمحة عن المساق‘ (السماح فقط بالدخول إلى صفحة ’لمحة عن المساق‘)، ’لا شيء‘ (عدم السماح بالعرض ضمن القائمة، وحظر الدخول إلى صفحة ’لمحة عن المساق‘).

source: Both
ar: كلاهما

source: About
ar: لمحة

source: None
ar: لا شيء

source: Entrance Exam Enabled
ar: تفعيل "اختبار القبول"

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ar: حدّد فيما إذا كان يجب على الطلّاب إتمام اختبار قبول قبل أن يتمكّنوا من استعراض محتوى مساقك. لاحظ أنّ عليك تفعيل "امتحانات القبول" ليُفعّل هذا الإعداد في مساقك.

source: Entrance Exam Minimum Score (%)
ar: الحد الادنى المطلوب للنجاح في امتحان القبول (%)

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
ar: يُرجى تحديد الحدّ الأدنى لعلامة النجاح في امتحان القبول من مئة قبل أن يتمكّن الطلّاب من استعراض محتوى مساقك. لاحظ أنّ عليك تفعيل "امتحانات القبول" ليُفعّل هذا الإعداد الخاص بالمساق.

source: Entrance Exam ID
ar: معرُف امتحان القبول

source: Content module identifier (location) of entrance exam.
ar: معرّف (موقع) وحدة المحتوى الخاصة بامتحان القبول.

source: Social Media Sharing URL
ar: رابط مشاركة عبر مواقع التواصل الاجتماعي

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
ar: إذا كان رابط المشاركة على مواقع التواصل الاجتماعي ورابط المساقات المخصَّصة في صفحة لوحتي التعليمية مفعّلاً، يمكنك استخدام رابط (كرابط صفحة ’لمحة عن المساق‘) يُمكن لمواقع التواصل الاجتماعي الربط عليه. يجب أن تكون جميع الروابط بصيغة صحيحة وكاملة. مثلًا: https://www.edraak.org/course/course-v1:Edraak+FL100+FL_2017_SP

source: Course Language
ar: لغة المساق

source: Specify the language of your course.
ar: حدّد لغة مساقك.

source: Teams Configuration
ar: إعدادات الفِرَق

source: Specify the maximum team size and topics for teams inside the provided set of curly braces. Make sure that you enclose all of the sets of topic values within a set of square brackets, with a comma after the closing curly brace for each topic, and another comma after the closing square brackets. For example, to specify that teams should have a maximum of 5 participants and provide a list of 2 topics, enter the configuration in this format: {example_format}. In "id" values, the only supported special characters are underscore, hyphen, and period.
ar: حدّد العدد الأقصى لعدد أعضاء الفِرق وموضوعاتها في القوسين المعقوفين المعروضين. تأكّد من تضمين جميع مجموعات قيم الموضوعات داخل زوج من الأقواس المعقوفة، واستخدام فاصلة بعد إغلاق زوج الحواصر لكل موضوع، وفاصلة أخرى بعد إغلاق زوج الأقواس المربعة. مثال، للإشارة إلى وجوب تشكيل الفرق من 5 أعضاء على الأكثر وتحديد قائمة من موضوعين، أدخل الإعدادات بصيغة {example_format}. المحارِف الخاصة الوحيدة المسموح بها في قيم المعرّفات هي الشَرطة السُفليّة وعلامة الطرح والنُقطة.

source: Enable Proctored Exams
ar: تفعيل الامتحانات المراقَبة

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
ar: أدخِل’true‘ أو ’false‘. تشير القيمة ’true‘ إلى تفعيل الامتحانات المراقبة لهذا المساق. وانتبه إلى أن تفعيلك للامتحانات المراقبة سيفعّل بدوره الامتحانات محدَّدة التوقيت أيضًا.

source: Allow Opting Out of Proctored Exams
ar: اسمح بالخروج من الامتحانات المُراقبة

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
ar: أدخل true أو false. إذا اخترت true، سيكون بإمكان الطلاب أخذ الامتحانات المُراقبة دون مراقبة. أما إذا اخترت false، فيجب على كل الطلاب الخضوع للامتحان تحت المراقبة. يتم تفعيل هذا الإعداد فقط إذا تم تحديد خيار تفعيل الامتحانات المُراقبة في الدورة.

source: Create Zendesk Tickets For Suspicious Proctored Exam Attempts
ar: أنشئ مذكرة Zendesk للمحاولات المشبوهة للامتحان المراقب

source: Enter true or false. If this value is true, a Zendesk ticket will be created for suspicious attempts.
ar: أدخل true أو false. إذا كانت القيمة true، سيتم إنشاء مذكرة Zendesk للمحاولات المشبوهة.

source: Enable Timed Exams
ar: تفعيل الاختبارات محدّدة الوقت.

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
ar: أدخل true أو false. إذا كان الخيار true، سيتم تفعيل الامتحانات الموقوتة في مساقك. بغض النظر عن هذا الإعداد، يتم تفعيل الامتحانات الموقوتة إذا تم تفعيل خيار "تفعيل الامتحانات المراقَبة".

source: Minimum Grade for Credit
ar: الحدّ الأدنى للعلامة لاحتساب الساعات المعتمدة

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
ar: الدرجة الدنيا التي يجب أن يحصل عليها المتعلِّم للحصول على الساعات المعتمدة، تُحتسب كقيمة عشرية بين 0.0 و1.0. ومثلًا، تُدخل القيمة 0.75 للتعبير عن درجة 75%.

source: Self Paced
ar: المساقات الدائمة

source: Set this to "true" to mark this course as self-paced. Self-paced courses do not have due dates for assignments, and students can progress through the course at any rate before the course ends.
ar: اجعل قيمتها ’true‘ لجعل هذا المساق دائم. لا يُحدّد في المساقات الدائمة تاريخ لتسليم الواجبات الدراسيّة، كما ويُسمح للمتعلّمين التقدّم في مواد المساق بأي سرعة وفي أي وقت يسبق نهاية المساق.

source: Bypass Course Home
ar: تجاوز الصفحة الرئيسية للمساق

source: Bypass the course home tab when students arrive from the dashboard, sending them directly to course content.
ar: تجاوز تبويب الصفحة الرئيسية عندما يصلها الطلاب من صفحة "لوحتي التعليمية"، وذلك بإرسالهم مباشرةً إلى محتوى المساق.

source: Enable Subsection Prerequisites
ar: فعّل المتطلّبات المسبقة للقسم الفرعي

source: Enter true or false. If this value is true, you can hide a subsection until learners earn a minimum score in another, prerequisite subsection.
ar: أدخِل ’true‘ أو ’false‘. إذا كانت هذه القيمة ’true‘، فيمكنك إخفاء قسم فرعي لحين حصول المتعلّمين على الحدّ الأدنى للعلامات في قسم متطلبات أساسية فرعي آخر.

source: Course Learning Information
ar: معلومات تعلم المساق
