Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Group Community TAs are members of the community who help course teams moderate discussions. Group Community TAs see only posts by learners in their assigned group. They can edit or delete posts, clear flags, close and re-open threads, and endorse responses, but only for posts by learners in their group. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Group Community TAs.
ar: مساعدو التدريس لمجموعات المنتديات هم أعضاء المنتديات الذين يساعدون فريق المساق في جعل المناقشات معتدلة. لا يرى المساعدون التابعون للمجموعة سوى المشاركات التي يقوم بها طلّاب تلك المجموعة فقط. يمكنهم تعديل المشاركات أو حذفها، وإزالة الإشارات، وإغلاق المواضيع وإعادة فتحها، والموافقة على الردود، ولكن فقط للمشاركات من قبل الطلّاب في مجموعتهم. يتم وضع علامة "مساعد تدريس بالمنتديات" على مشاركاتهم . يمكن إضافة الطلّاب المسجلين فقط كمساعد التدريس لمجموعات المنتديات.

source: Add Group Community TA
ar: مساعد مدرس لمجموعة المنتدى

source: Community TAs are members of the community who help course teams moderate discussions. They can see posts by learners in their assigned cohort or enrollment track, and can edit or delete posts, clear flags, close or re-open threads, and endorse responses. Their posts are marked as 'Community TA'. Only enrolled learners can be added as Community TAs.
ar: مساعدو المدرّسين هم أعضاء في المجتمع الذين يساعدون فريق المساق في ادارة مراكز المناقشة. يمكنهم مشاهدة المنشورات من قبل المتعلمين في الشعب المخصصة لهم أو مسار التسجيل، ويمكنهم تعديل أو حذف المنشورات، ومسح العلامات، وإغلاق أو إعادة فتح الرسائل، والمصادقة على الردود. تم وضع علامة على مشاركاتهم كـ "Community TA". يمكن إضافة المتعلمين المسجلين فقط كـCommunity TAs.

source: Add Community TA
ar: أضف مساعد تدريس متطوّع

source: CCX Coaches
ar: مدربو المساقات المخصصة

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
ar: يستطيع مدربو المساقات المخصصة إنشاء مساق مخصص خاص بهم بناءًا على هذا المساق، ويمكنهم استخدامه لتقديم تعليمات مخصصة لطلابهم بناءًا على ما يرد في المادة التعليمية لهذا المساق.

source: Add CCX Coach
ar: أضِف مدرب مساق مخصص

source: There is no data available to display at this time.
ar: ليست هناك من بيانات متاحة للعرض حاليًّا.

source: Use Reload Graphs to refresh the graphs.
ar: استخدم زِر إعادة تحميل الرسوم البيانية لتحديث الرسوم البيانية.

source: Reload Graphs
ar: أعِد تحميل الرسوم البيانية

source: Subsection Data
ar: بيانات القسم الفرعي

source: Each bar shows the number of students that opened the subsection.
ar: يظهر كلٌّ من المستطيلات عدد الطلاب الذين فتحوا القسم الفرعي.

source: You can click on any of the bars to list the students that opened the subsection.
ar: يمكنك النقر على أيٍّ من المستطيلات للاطلاع على قائمة الطلاب الذين فتحوا القسم الفرعي.

source: You can also download this data as a CSV file.
ar: يمكنك أيضًا تنزيل هذه البيانات كملفّ CSV.

source: Download Subsection Data for all Subsections as a CSV
ar: تنزيل بيانات القسم الفرعي لكافة الأقسام الفرعية بصيغة CSV

source: Grade Distribution Data
ar: بيانات توزيع العلامات

source: Each bar shows the grade distribution for that problem.
ar: يظهر كلّ مستطيل توزيع العلامات لتلك المسألة.

source: You can click on any of the bars to list the students that attempted the problem, along with the grades they received.
ar: بالإمكان النقر على أيٍّ من المستطيلات لعرض قائمة الطلاب الذين حاولوا حلّ المسألة، بالإضافة إلى العلامات التي حصلوا عليها.

source: Download Problem Data for all Problems as a CSV
ar: تنزيل بيانات المسألة لكلّ المسائل كملف CSV

source: Grade Distribution per Problem
ar: توزيع العلامات لكل مسألة

source: Download Student Opened as a CSV
ar: تنزيل ملف CVS يحوي قائمة الطلاب الذين فتحوا هذا القسم الفرعي

source: Download Student Grades as a CSV
ar: تنزيل علامات الطلاب بصيغة CSV

source: This is a partial list, to view all students download as a csv.
ar: هذه قائمة جزئية، لعرض جميع الطلاب يرجى تنزيل القائمة كملف CSV.

source: There are no problems in this section.
ar: لا توجد مسائل في هذا القسم.

source: Send to:
ar: أرسل إلى:

source: Myself
ar: نفسي

source: Staff and Administrators
ar: الطاقم والإدارة

source: All Learners
ar: جميع المتعلّمين

source: Cohort:
ar: الشعبة:

source: (Learners not explicitly assigned to a cohort)
ar: (طلاب من غير شُعبة)

source: Learners in the {track_name} Track
ar: طلّاب في مسار {track_name}

source: Subject:
ar: الموضوع:

source: (Maximum 128 characters)
ar: (الحد الأقصى 128 محرفاً)

source: Message:
ar: الرسالة:

source: We recommend sending learners no more than one email message per week. Before you send your email, review the text carefully and send it to yourself first, so that you can preview the formatting and make sure embedded images and links work correctly.
ar: يُفضّل أن لا ترسل للمتعلمين أكثر من رسالة واحدة أسبوعياً. ننصح قبل إرسال أي رسالة بمراجعة نصّها بدقة، ثم إرسالها إلى نفسك أولاً، لتتمكن من معاينة التنسيق والتأكد من سلامة الصور والروابط المضمّنة.

source: CAUTION!
ar: تحذير!

source: When you select Send Email, your email message is added to the queue for sending, and cannot be cancelled.
ar: عند اختيارك "أرسل الرسالة"، سيتم جدولة إرسالها للمستلمين، ولا يمكنك بعد ذلك إلغاء هذه العملية.

source: Send Email
ar: أرسِل الرسالة

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
ar: العمليات المتعلّقة بالبريد الإلكتروني تجري في الخلفية. تظهر حالة أي مهام مفعّلة - بما في ذلك مهمات البريد الإلكتروني - في الجدول أدناه.

source: Email Task History
ar: سجل مهمّات البريد الإلكتروني

source: To see the content of previously sent emails, click this button:
ar: لرؤية ما في الرسائل المرسلة سابقًا، اضغط على هذا الزر:

source: Show Sent Email History
ar: اعرض سجل الرسائل الصادرة

source: To read a sent email message, click its subject.
ar: لقراءة أية رسالة صادرة انقر على عنوانها.

source: To see the status for all email tasks submitted for this course, click this button:
ar: لرؤية حالة رسائل البريد التي أُرسلت لهذا المساق، انقر على هذا الزر:

source: Show Email Task History
ar: أظهِر سجلّ مهام البريد الإلكتروني

source: Set Course Mode Price
ar: تحديد تكلفة وضعية المساق

source: Please enter Course Mode detail below
ar: يرجى إدخال تفاصيل وضعية المساق أدناه

source: Set Price
ar: التكلفة المحددة

source: Allowance Section
ar: قسم المنَح

source: Student Special Exam Attempts
ar: محاولات امتحانات الطلاب الخاصّة

source: View gradebook for enrolled learners
ar: اعرض سجلّ العلامات للطلاب المُسجلين

source: Note: This feature is available only to courses with a small number of enrolled learners.
ar: ملاحظة: هذه الميزة متاحة فقط للمساقات التي يكون عدد الطلاب المسجلّين فيها قليل.

source: View Gradebook
ar: اعرض سجل العلامات

source: View a specific learner's grades and progress
ar: اعرض علامات وتقدم أحد الطلاب.

source: Learner's {platform_name} email address or username
ar: عنوان البريد الإلكتروني أو اسم المستخدم لطالب في {platform_name}

source: Learner email address or username
ar: عنوان البريد الإلكتروني أو اسم المستخدم الخاص بالطالب

source: View Progress Page
ar: اعرض صفحة التقدم

source: Adjust a learner's grade for a specific problem
ar: اضبط علامات الطالب في مسألة محددة

source: Location of problem in course
ar: موقع المسألة في المساق

source: Example
ar: مثال

source: Problem location
ar: موقع المسألة

source: Attempts
ar: عدد المحاولات

source: Allow a learner who has used up all attempts to work on the problem again.
ar: اسمح للطالب الذي استنفد جميع محاولاته بحل المسألة مرة أخرى.

source: Reset Attempts to Zero
ar: صفِّر عدّاد المحاولات

source: Rescore
ar: أعِد التقييم

source: For the specified problem, rescore the learner's responses. The 'Rescore Only If Score Improves' option updates the learner's score only if it improves in the learner's favor.
ar: لهذه المسألة تحديداً، أعد تقييم إجابات الطالب. يقوم خيار "أعِد التقييم فقط في حال تحسن النتيجة" بتحديث نتيجة الطالب فقط في حالة تغير النتيجة لصالح الطالب.

source: Score Override
ar: تجاوز النقاط

source: For the specified problem, override the learner's score.
ar: تجاوز نقاط الطالب في المسألة المحددة.

source: New score for problem, out of the total points available for the problem
ar: عدد نقاط جديد من مجموع النقاط المتاحة للمسألة

source: Override Learner's Score
ar: تجاوز نقاط الطالب

source: Problem History
ar: تاريخ المسألة

source: For the specified problem, permanently and completely delete the learner's answers and scores from the database.
ar: في هذه المسألة تحديداً، احذف إجابات ونتائج المتعلم بالكامل وبشكل دائم من قاعدة البيانات.

source: Task Status
ar: حالة المهمة

source: Show the status for the rescoring tasks that you submitted for this learner and problem.
ar: اعرض حالة مهام إعادة التقييم التي قدمتها لهذا الطالب وهذه المسألة.

source: Show Task Status
ar: اعرض حالة المهمة

source: Adjust a learner's entrance exam results
ar: عدِّل نتائج امتحان القبول للطالب

source: Allow the learner to take the exam again.
ar: اسمح للمتعلم بخوض الامتحان مرة أخرى.

source: Allow Skip
ar: اسمح بالتخطي

source: Waive the requirement for the learner to take the exam.
ar: تنازل عن شرط خوض الطالب للامتحان.

source: Let Learner Skip Entrance Exam
ar: اسمح للطالب بتخطي امتحان القبول

source: Rescore any responses that have been submitted. The 'Rescore All Problems Only If Score Improves' option updates the learner's scores only if it improves in the learner's favor.
ar: أعد تقييم أي إجابات تم تقديمها. يعمل خيار "أعِد التقييم فقط في حالة تحسن النتيجة" على تحديث نتيجة الطالب فقط في حالة تغير النتيجة لصالح الطالب.

source: Rescore All Problems
ar: أعد تقييم جميع المسائل

source: Rescore All Problems Only If Score Improves
ar: إعادة تقييم جميع المسائل فقط في حالة تحسن النتيجة

source: Entrance Exam History
ar: تاريخ امتحان القبول

source: For the entire entrance exam, permanently and completely delete the learner's answers and scores from the database.
ar: احذف إجابات ونتائج الطالب بشكل كامل ودائم من قاعدة البيانات لامتحان القبول بأكمله.

source: Show the status for the rescoring tasks that you submitted for this learner and entrance exam.
ar: اعرض حالة مهام إعادة التقييم التي قدمتها لهذا الطالب وامتحان القبول.

source: Adjust all enrolled learners' grades for a specific problem
ar: اضبط جميع علامات الطالب المسجّلين لمسألة محددة

source: Allows all learners to work on the problem again.
ar: اسمح لجميع الطلاب بحل المسألة مرة أخرى.

source: Rescore submitted responses. The 'Rescore Only If Scores Improve' option updates a learner's score only if it improves in the learner's favor.
ar: أعِد تقييم الإجابات المُقدمة. ويعمل خيار "أعِد التقييم فقط في حالة تحسن النتيجة" على تحديث نتيجة المتعلم فقط في حالة تغير النتيجة لصالح المتعلم.

source: Rescore All Learners' Submissions
ar: أعِد تقييم أجوبة كل الطلاب

source: Rescore Only If Scores Improve
ar: أعِد التقييم فقط في حالة تحسن النتيجة

source: Show the status for the tasks that you submitted for this problem.
ar: اعرض حالة المهام التي قدمتها لهذه المسألة.

source: My Courses
ar: مساقاتي

source: Program Details
ar: تفاصيل البرنامج

source: Get the {platform_name} Mobile App!
ar: احصل على تطبيق {platform_name} للهواتف الذكية!

source: We'll send you a one time SMS with a link to download the app.
ar: سنرسل لك رسالة نصية (SMS) لمرة واحدة مع رابط لتنزيل التطبيق.

source: Mobile phone number
ar: رقم الهاتف الجوال

source: Send me a text with the link
ar: أرسل الرابط برسالة نصية (SMS)

source: Change Preferred Language
ar: غيِّر اللغة المفضلة

source: Please choose your preferred language
ar: الرجاء اختيار لغتك المفضّلة

source: Save Language Settings
ar: احفظ إعدادات اللغة

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
ar: ألم تجد لغتك المفضّلة؟ {link_start}تطوّع لتقوم بدور المترجِم!{link_end}

source: Explore Courses
ar: تصفح المساقات

source: Global
ar: عالمي

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The course team needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
ar: {p_tag}ليست لديك حاليًا أيّ مهمّات تصحيح زملاء بالانتظار. وحتى تصلك مهمّات تصحيح الزملاء: {ul_tag} {li_tag}يجب أن تكون قد قدّمت ردًا على إحدى مسائل تصحيح الزملاء{end_li_tag} {li_tag}يجب أن يقوم فريق المساق بتقييم المقالات المستخدمة لمساعدتك على فهم معايير التصحيح بشكلٍ أفضل.{end_li_tag} {li_tag}يجب وجود تسليمات تنتظر التصحيح.{end_li_tag} {end_ul_tag} {end_p_tag}

source: Peer Grading
ar: تصحيح الزملاء

source: Here is a list of problems that need to be peer graded for this course.
ar: فيما يلي قائمة بالمسائل التي تتطلب أن يصححها الزملاء في هذا المساق.

source: Problem Name
ar: اسم المسألة

source: Due date
ar: موعد التسليم

source: Graded
ar: تم التقييم

source: Available
ar: متاحة

source: Required
ar: مطلوبة

source: No due date
ar: لا يوجد موعد للتسليم

source: The due date has passed, and peer grading for this problem is closed at this time.
ar: انقضى موعد التسليم، وتصحيح الزملاء لهذه المسألة مغلق حالياً.

source: The due date has passed, and peer grading is closed at this time.
ar: انقضى موعد التسليم، وتصحيح الزملاء مغلق حالياً.

source: Learning to Grade
ar: تعلُّم التصحيح

source: Hide Question
ar: اخفِ السؤال

source: Student Response
ar: رد الطالب

source: Written Feedback
ar: الآراء والملاحظات المكتوبة

source: Please include some written feedback as well.
ar: تُرجى إضافة بعض الآراء والملاحظات المكتوبة كذلك.

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
ar: تحوي هذه الورقة المقدّمة على محتوى فاضح أو مسيئ، أو (بحسب ما أعتقد) يحوي سرقة علمية أو أدبية.

source: How did I do?
ar: كيف كان أدائي؟

source: Ready to grade!
ar: مستعِد للتصحيح!

source: You have finished learning to grade, which means that you are now ready to start grading.
ar: لقد انتهيت من تعلم طريقة التصحيح، ما يعني أن بإمكانك الآن البدء بالتصحيح.

source: Start Grading!
ar: ابدأ التصحيح!

source: Learning to grade
ar: تعلّم التصحيح

source: You have not yet finished learning to grade this problem.
ar: ما زلت لم تُنهِ تعلم طريقة تقتصحيح هذه المسألة.

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
ar: سيتم إطلاعك الآن على سلسلة من المقالات التي قيمها مدرِّس المساق، وسيطلب منك تقييمها بنفسك.

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
ar: عندما تتمكن تقييم المقالات بطريقة مشابهة لما يقوم به مدرِّس المساق، ستكون جاهزاً عندها للتصحيح لزملائك.

source: Start learning to grade
ar: ابدأ بتعلم التصحيح

source: Are you sure that you want to flag this submission?
ar: هل أنت متأكد من أنك تود وضع إشارة على هذه المادة المقدَّمة ؟

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
ar: أنت على وشك وضع إشارة على مادة مقدّمة. يجب أن لا تقوم بوضع إشارة على مادة إلا إذا احتوت على نصوص فاضحة أو مسيئة أو (يعتقد بأنها) مسروقة. إذا كانت المادة المقدّمة لا تتناول الإجابة المناسبة للسؤال أو كانت غير صحيحة، عليك أن تعطيها علامة الصفر وتقوم بإضافة lghp/hj لها بدلاً من تحديدها بإشارة.

source: Remove Flag
ar: أزِل الإشارة

source: Keep Flag
ar: أبقِ على الإشارة

source: Go Back
ar: ارجِع

source: {start_strong}{application_name}{end_strong} would like to access your data with the following permissions:
ar: يودُّ {start_strong}{application_name}{end_strong} الوصول إلى بياناتك بالصلاحيات التالية:

source: Read your user ID
ar: اقرأ معرف المستخدم الخاص بك

source: Read your user profile
ar: اقرأ الملف الشخصي للمستخدم

source: Read your email address
ar: اقرأ عنوان بريدك الإلكتروني

source: Read the list of courses in which you are a staff member.
ar: اقرأ قائمة المساقات التي عُيّنت ضمن طاقمها.

source: Read the list of courses in which you are an instructor.
ar: اقرأ قائمة المساقات التي عُيّنت كمدرّس فيها.

source: To see if you are a global staff user
ar: لمعرفة ما إذا كنت مستخدِمًا من الطاقَم العام

source: Manage your data: {permission}
ar: أدِرْ بياناتك: {permission}

source: Account Activation Info
ar: معلومات تفعيل الحساب

source: Your Password Reset is Complete
ar: تمت إعادة ضبط كلمة مرورك

source: Password Reset Complete
ar: تمت إعادة ضبط كلمة المرور

source: Your password has been reset. {start_link}Sign-in to your account.{end_link}
ar: تمت إعادة ضبط كلمة مرورك. {start_link}تفضَّل بالدخول إلى حسابك.{end_link}

source: Reset Your {platform_name} Password
ar: أعِد ضبط كلمة مرورك على {platform_name}

source: Invalid Password Reset Link
ar: رابط إعادة ضبط كلمة المرور غير صالِح

source: Password reset successful
ar: نجح تغيير كلمة المرور

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
ar: لقد قمنا بإرسال رسالةٍ إالى عنوان البريد الإلكتروني الذي زودتنا به تتضمن التعليمات الخاصة بضبط كلمة المرور، وستصلك قريباً.

source: Billing Details
ar: تفاصيل الفوترة

source: You can proceed to payment at any point in time. Any additional information you provide will be included in your receipt.
ar: يمكنك متابعة تسديد الدفعة في أي وقت. ومن شأن أي معلومات إضافية تقدّمها أن تُدرَج في إيصالك.

source: Purchasing Organizational Details
ar: تفاصيل المؤسسة المشترِية

source: Purchasing organization
ar: المؤسسة المشترِية

source: Purchase order number (if any)
ar: رقم طلب الشراء (إن وُجد)

source: Additional Receipt Recipient
ar: مستلم الإيصال الإضافي

source: If no additional billing details are populated the payment confirmation will be sent to the user making the purchase.
ar: في حال عدم توفير تفاصيل إضافية حول الفوتَرة، سيُرسَل التأكيد على الدفعة إلى المستخدم الذي يقوم بعملية الدفع.

source: Payment processing occurs on a separate secure site.
ar: تجري معالجة الدفع عبر موقع آمن منفصل.

source: Your Shopping cart is currently empty.
ar: إنّ سلّة مشترياتك فارغة حاليًا.

source: Payment
ar: الدفعة

source: Download CSV Reports
ar: تنزيل التقارير بصيغة CSV

source: Download CSV Data
ar: تنزيل البيانات بصيغة CSV

source: There was an error in your date input. It should be formatted as YYYY-MM-DD
ar: حدث خطأ في عملية إدخال التاريخ التي قمت بها. يجب أن يتم إدخاله على الشكل YYYY-MM-DD

source: These reports are delimited by start and end dates.
ar: هذه التقارير مرشّحة حسب تواريخ البداية والنهاية.

source: Start Date:
ar: تاريخ البدء:

source: End Date:
ar: تاريخ الانتهاء:

source: These reports are delimited alphabetically by university name. i.e., generating a report with 'Start Letter' A and 'End Letter' C will generate reports for all universities starting with A, B, and C.
ar: ستُرشَّح هذه التقارير هجائيًا حسب اسم الجامعة. أي أن إعداد تقرير باستخدام حرف الألف ’حرفاً للبداية‘ وحرف التاء ’حرفاً للنهاية‘ سيؤدي إلى إعداد تقارير بكافة الجامعات التي تبدأ بالأحرف ألف وباء وتاء.

source: Start Letter:
ar: حرف البداية:

source: End Letter:
ar: حرف النهاية:

source: Payment Error
ar: حطأ في الدفع

source: There was an error processing your order!
ar: لقد حدث خطأ في معالجة طلبك!

source: Thank you for your purchase!
ar: شكرًا لك!

source: View Dashboard
ar: شاهد لوحتك التعليمية

source: You have successfully been enrolled for {course_names}. The following receipt has been emailed to {receipient_emails}
ar: لقد نجحت في التسجيل في {course_names}. لقد أُرسِل الإيصال التالي إلى {receipient_emails}

source: You have successfully purchased <b>{number} course registration code</b> for {course_names}.
ar: لقد نجحتَ بالدفع لقاء <b>{number} رمز تسجيل مساق</b> {course_names}.

source: The following receipt has been emailed to {receipient_emails}
ar: أُرسِل الإيصال التالي بالبريد الإلكتروني إلى {receipient_emails}

source: Please send each professional one of these unique registration codes to enroll into the course. The confirmation/receipt email you will receive has an example email template with directions for the individuals enrolling.
ar: يُرجى إرسال أحد رموز التسجيل الخاصة هذه إلى كل متخصّص ليتمكّن من التسجيل في المساق، ويوجد في رسالة التأكيد/الإيصال التي ستتلقّاها عبر البريد الإلكتروني نموذج رسالة إلكترونية وفيه توجيهات حول عملية تسجيل الأفراد.

source: Enrollment Link
ar: رابط التسجيل في المساق

source: Used
ar: مستخدَم

source: Invalid
ar: غير صالِح

source: Date of purchase
ar: تاريخ الشراء

source: Print Receipt
ar: اطبع الإيصال

source: Billed To Details
ar: تفاصيل متلقّي الفاتورة

source: N/A
ar: لا ينطبق

source: Purchase Order Number
ar: رقم طلب الشراء

source: Company Contact Name
ar: اسم مندوب الشركة

source: Company Contact Email
ar: البريد الإلكتروني لمندوب الشركة

source: Recipient Name
ar: اسم المرسَل له

source: Recipient Email
ar: عنوان البريد الإلكتروني للمرسَل له

source: Card Type
ar: نوع البطاقة

source: Credit Card Number
ar: رقم بطاقة الائتمان

source: Address 1
ar: العنوان 1

source: Address 2
ar: العنوان 2

source: State
ar: الحالة

source: Registration for:
ar: التسجيل في:

source: Price per student:
ar: التكلفة لكل طالب:

source: Discount Applied:
ar: الخصم المطبَّق:

source: Students
ar: الطلّاب

source: Note: items with strikethough like <del>this</del> have been refunded.
ar: ملاحظة: تمّ رد قيمة العناصر المشطوبة <del>هكذا</del>.

source: Confirm Enrollment
ar: أكِّد التسجيل

source: {site_name} - Confirm Enrollment
ar: {site_name} - أكِّد التسجيل

source: {course_number} {course_title} Cover Image
ar: صورة غلاف {course_number} {course_title}

source: Confirm your enrollment for: {span_start}course dates{span_end}
ar: أكِّد التحاقك في: {span_start}تواريخ المساق{span_end}

source: You've clicked a link for an enrollment code that has already been used. Check your {link_start}course dashboard{link_end} to see if you're enrolled in the course, or contact your company's administrator.
ar: لقد نقرت على رابط لرمز تسجيل مستخدم سابقًا. تحقق من {link_start}صفحة "لوحتي التعليمية" الخاصة بمساقاتك{link_end} لترى ما إذا كنتَ مسجلاً في المساق أو تواصل مع الشخص المسؤول في شركتك.

source: You have successfully enrolled in {course_name}. This course has now been added to your dashboard.
ar: لقد سجلت بنجاح في {course_name}، لقد أضيفَ هذا المساق الآن إلى صفحة "لوحتي التعليمية" الخاصة بك.

source: You're already enrolled for this course. Visit your {link_start}dashboard{link_end} to see the course.
ar: أنت مسجل أصلًا في هذا المساق. اذهب إلى {link_start}مكتبك{link_end} لترى المساق.

source: The course you are enrolling for is full.
ar: المساق الذي تحاول التسجيل فيه ممتلئ.

source: The course you are enrolling for is closed.
ar: المساق الذي تحاول التسجيل فيه مغلق.

source: There was an error processing your redeem code.
ar: حدث خطأ في معالجة رمز الاسترداد الخاص بك.

source: You're about to activate an enrollment code for {course_name} by {site_name}. This code can only be used one time, so you should only activate this code if you're its intended recipient.
ar: أنت بصَدَد تفعيل رمز تسجيل لمساق {course_name} عبر {site_name}، يمكن استخدام هذا الرمز مرة واحدة فقط، لذا يجب أن لا تفعِّل هذا الرمز ما لم تكن المستلم المقصود.

source: Activate Course Enrollment
ar: تفعيل إمكانية التسجيل في المساق

source: {course_names} has been removed because the enrollment period has closed.
ar: لقد أُزيل {course_names} لأن باب التسجيل قد أُغلِق.

source: Cover Image
ar: صورة الغلاف

source: Students:
ar: الطلّاب:

source: Input quantity and press enter.
ar: أدخل الكمية واضغط زر الإدخال.

source: Increase
ar: زِد

source: Decrease
ar: أنقِص

source: Remove
ar: أزِل

source: Discount or activation code
ar: رمز تفعيل أو خصم

source: discount or activation code
ar: رمز تفعيل أو خصم

source: Apply
ar: استخدِم

source: code has been applied
ar: استُخدِم الرمز

source: TOTAL:
ar: المجموع:
