Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: {platform_name} now requires more complex passwords. Your current password does not meet the new requirements. You must change your password by {deadline} to be able to continue using the site. To change your password, select the dropdown menu icon next to your username, then select "Account". You can reset your password from this page. Thank you for helping us keep your data safe.
ar: يتطلب {platform_name} الآن كلمات مرور أكثر تعقيدًا. كلمة المرور الحالية الخاصة بك لا توافق المتطلبات الجديدة. عليك تغييرها بموعد اقصاه {deadline} لمواصلة استخدام الموقع. لتغيير كلمة المرور الخاصة بك ، اختر القائمة المنسدلة بحانب اسم المستخدم الخاص بك أعلاه، ثم اختر "الحساب". يمكنك إعادة تعيين كلمة المرور الخاصة بك من هذه الصفحة. شكرًا لك على مساعدتنا في الحفاظ على أمان بياناتك.

source: The file must be smaller than {image_max_size} in size.
ar: يجب ألا يزيد حجم الملف عن {image_max_size}.

source: The file must be at least {image_min_size} in size.
ar: يجب ألا يقلّ حجم الملف عن {image_min_size} .

source: The file must be one of the following types: {valid_file_types}.
ar: يجب أن يكون الملف من أحد الأنواع التالية: {valid_file_types}.

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
ar: إن ترويسة نوع-المحتوى الخاصة بهذا الملف غير مطابقة لبياناته. قد يكون الملف تالفًا.

source: The file name extension for this file does not match the file data. The file may be corrupted.
ar: لا يتطابق امتداد هذا الملف مع بياناته. قد يكون الملف تالفًا.

source: bytes
ar: بايت

source: KB
ar: كيلو بايت

source: MB
ar: ميغا بايت

source: No file provided for profile image
ar: لم تُتِح ملفًّا لصورة الملف الشخصي

source: Path used to construct URLs to programs marketing pages (e.g., "/foo").
ar: المسار المستخدم لإنشاء عناوين URL إلى صفحات تسويق البرامج (على سبيل المثال، "/foo").

source: Known Error Case
ar: خطأ معروف

source: Schedule start < course start
ar: بدء الجدول < course start

source: All
ar: الكل

source: Experience
ar: تجربة

source: Schedules
ar: جداول

source: Indicates if this schedule is actively used
ar: يشير إلى ما إذا كان هذا الجدول يستخدم بنشاط

source: Date this schedule went into effect
ar: تاريخ دخول هذا الجدول حيز التنفيذ

source: Deadline by which the learner must upgrade to a verified seat
ar: الموعد النهائي الذي يجب على الطالب الترقية فيه إلى مقعد موثّق

source: Schedule
ar: وضع الجدول

source: By %(filter_title)s
ar: ب%(filter_title)s

source: Welcome to week %(week_num)s of %(course_name)s!
ar: مرحبًا بك في الاسبوع %(week_num)s من مساق %(course_name)s!

source: We hope you're enjoying <strong>%(course_name)s</strong>! We want to let you know what you can look forward to in week %(week_num)s:
ar: نأمل أن تستمتع بـ<strong>%(course_name)s</strong>! نريد أن نخبرك بما يمكنك أن تتطلع إليه في الأسبوع%(week_num)s

source: With self-paced courses, you learn on your own schedule. We encourage you to spend time with the course each week. Your focused attention will pay off in the end!
ar: يمكنك التعلم حسب وقتك مع المساقات الدائمة. نشجعك أن تخصص وقتاً اسبوعياً للمساق. تركيزك وانتباهك سيعودان بالنفع عليك في النهاية.

source: Resume your course now
ar: استئناف المساق الآن

source: We hope you're enjoying %(course_name)s! We want to let you know what you can look forward to in week %(week_num)s:
ar: نأمل أن تستمتع بالمساق%(course_name)s! We want to let you know what you can look forward to in week %(week_num)s

source: Welcome to week %(week_num)s
ar: مرحبًا بك في الاسبوع %(week_num)s

source: Many %(platform_name)s learners are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ar: يقوم العديد من طلّاب %(platform_name)s بإتمام المزيد من المسائل كل أسبوع، والمشاركة في منتديات المحادثة. ماذا تريد أن تفعل أنت للحفاظ على نسق الدراسة؟

source: Many %(platform_name)s learners in %(course_name)s are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ar: يقوم العديد من طلّاب %(platform_name)s في مساق %(course_name)s بإتمام المزيد من المسائل كل أسبوع، والمشاركة في منتديات المحادثة. ماذا تريد أن تفعل أنت للحفاظ على نسق الدراسة؟

source: Keep up the momentum!
ar: واصل في هذا النسق!

source: Many %(platform_name)s learners in <strong>%(course_name)s</strong> are completing more problems every week, and participating in the discussion forums. What do you want to do to keep learning?
ar: يقوم العديد من متعلّمي <strong>%(platform_name)s</strong> في مساق %(course_name)s بحل العديد من المسائل كل أسبوع، والمشاركة في منتديات النقاش. ماذا تريد أن تفعل أنت للحفاظ على استمرارية دراستك؟

source: Keep learning
ar: واصل الدراسة

source: Remember when you enrolled in %(course_name)s, and other courses on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر اشتراكك في مساق %(course_name)sومساقات أخرى على منصة %(platform_name)s؟ نحن نتذكر، ونحن فخورون بوجودك معنا! تعال وانظر ماذا يتعلم الجميع.

source: Remember when you enrolled in %(course_name)s on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر أنك اشتركت في مساق %(course_name)sعلى منصة %(platform_name)s؟ نحن نتذكر، ونحن فخورون بوجودك معنا! تعال وانظر ماذا يتعلم الجميع.

source: Keep learning today
ar: واصل الدراسة اليوم

source: Remember when you enrolled in <strong>%(course_name)s</strong>, and other courses on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر اشتراكك في مساق <strong>%(course_name)s</strong> ومساقات أخرى على منصة %(platform_name)s؟ نحن نتذكر، ونحن فخورون بوجودك معنا! تعال وانظر ماذا يتعلم الجميع في المساق.

source: Remember when you enrolled in <strong>%(course_name)s</strong> on %(platform_name)s? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر اشتراكك في مساق <strong>%(course_name)s</strong>على منصة %(platform_name)s؟ نحن نتذكر، ونحن فخورون بوجودك معنا! تعال وانظر ماذا يتعلم الجميع!

source: Start learning now
ar: ابدأ التعلم الآن

source: Keep learning on %(platform_name)s
ar: واصل التعلّم على %(platform_name)s

source: Keep learning in %(course_name)s
ar: واصل الدراسة في %(course_name)s

source: We hope you are enjoying learning with us so far on %(platform_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
ar: نأمل أن تكون مستمتعاً بالتعلم معنا فيما شاهدته في %(platform_name)s! تتيح لك الشهادة الموثقة إبراز مهاراتك ومعلوماتك الجديدة.. شهادة %(platform_name)s هي شهادة رسمية وسهلة المشاركة على منصات التواصل. طوّر اشتراكك قبل %(user_schedule_upgrade_deadline_time)s.

source: We hope you are enjoying learning with us so far in %(first_course_name)s! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable. Upgrade by %(user_schedule_upgrade_deadline_time)s.
ar: نأمل أنك مستمتع بالتعلم معنا حتى الآن 1%(first_course_name)s1! تتيح لك الشهادة الموثقة إبراز مهاراتك ومعلوماتك التي تعلمتها. شهادة %(platform_name)s هي شهادة رسمية وسهلة المشاركة على منصات التواصل. طوّر اشتراكك عن طريق %(user_schedule_upgrade_deadline_time)s

source: Upgrade now
ar: ترقية الآن

source: We hope you are enjoying learning with us so far on <strong>%(platform_name)s</strong>! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable.
ar: نأمل أنك مستمتع بالتعلم معنا في <strong>%(platform_name)s</strong> ! تتيح لك الشهادة الموثقة إبراز مهاراتك ومعلوماتك التي تعلمتها. شهادة %(platform_name)s هي شهادة رسمية وسهلة المشاركة على منصات التواصل.

source: We hope you are enjoying learning with us so far in <strong>%(first_course_name)s</strong>! A verified certificate allows you to highlight your new knowledge and skills. An %(platform_name)s certificate is official and easily shareable.
ar: نأمل أنك مستمتع بالتعلم معنا حتى الآن <strong>%(first_course_name)s</strong>! تتيح لك الشهادة الموثقة إبراز مهاراتك ومعارفك التي تعلمتها. شهادة %(platform_name)sهي شهادة رسمية وسهلة المشاركة على منصات التواصل.

source: Upgrade by <strong>%(user_schedule_upgrade_deadline_time)s</strong>.
ar: قم بالترقية قبل <strong>%(user_schedule_upgrade_deadline_time)s</strong>.

source: You are eligible to upgrade in these courses:
ar: انت مؤهل لتطوير اشتراكك بالمساقات التالية:

source: Example of a verified certificate
ar: أمثلة على شهادة موثَّقة

source: Upgrade now at
ar: قم بالترقية الآن بـ

source: Upgrade to earn a verified certificate on %(platform_name)s
ar: طور تسجيلك بالمساق للحصول على شهادة موثقة من %(platform_name)s

source: Upgrade to earn a verified certificate in %(first_course_name)s
ar: طور تسجيلك بالمساق للحصول على شهادة موثقة في مساق %(first_course_name)s

source: Enable course home page improvements.
ar: فعّل ميزة تحسين الصفحة الرئيسية للمساق.

source: Site theme changed to {site_theme}
ar: تم تغيير مظهر الموقع إلى {site_theme}

source: Theme {site_theme} does not exist
ar: المظهر {site_theme} غير موجود

source: Site theme reverted to the default
ar: تمت إعادة مظهر الموقع إلى الإعداد الافتراضي

source: Theming Administration
ar: إدارة المظهر

source: Usernames can only contain letters (A-Z, a-z), numerals (0-9), underscores (_), and hyphens (-).
ar: يمكن أن تحتوي أسماء المستخدمين فقط على أحرف (A-Z و a-z) وأرقام (0-9) وشرطات سفلية (_) وواصلات (-).

source: Usernames can only contain letters, numerals, and @/./+/-/_ characters.
ar: يمكن أن تحتوي أسماء المستخدمين فقط على أحرف وأرقام و @/./+/-/_.

source: "{email}" is not a valid email address.
ar: "{email}" ليس عنوان بريد إلكتروني صالح.

source: It looks like {email_address} belongs to an existing account. Try again with a different email address.
ar: يبدو أنّ عنوان البريد الإلكتروني {email_address} يخصّ حسابًا موجودًا. تُرجى إعادة المحاولة باستخدام عنوان بريد إلكتروني مختلف.

source: It looks like {username} belongs to an existing account. Try again with a different username.
ar: يبدو أنّ اسم المستخدم {username} يخصّ حسابًا موجودًا. تُرجى إعادة المحاولة باستخدام اسم مستخدم مختلف.

source: Username must be between {min} and {max} characters long.
ar: يجب أن يكون اسم المستخدم بين {min} و {max} حرفا.

source: Enter a valid email address that contains at least {min} characters.
ar: أدخل عنوان بريد إلكتروني صالحا يحتوي على {min} حرفا على الأقل.

source: Enter your full name.
ar: أدخل اسمك الكامل.

source: The email addresses do not match.
ar: عناوين البريد الإلكتروني غير متطابقة.

source: Select your country or region of residence.
ar: حدد بلدك أو منطقتك.

source: Select your profession.
ar: حدد مهنتك.

source: Select your specialty.
ar: حدد تخصصك.

source: Enter your profession.
ar: أدخل مهنتك.

source: Enter your specialty.
ar: أدخل تخصصك.

source: Enter your city.
ar: أدخل مدينتك.

source: Tell us your goals.
ar: أخبرنا عن أهدافك.

source: Select the highest level of education you have completed.
ar: حدد أعلى مستوى تعليمي كنت قد أكملته.

source: Enter your mailing address.
ar: أدخل عنوانك البريدي.

source: The '{field_name}' field cannot be edited.
ar: لا يمكن تعديل الحقل '{field_name}'.

source: Make sure that you are providing a valid username or a URL that contains "
ar: تأكد من أنك قدمت اسم مستخدم صالح أو رابطا يحتوي على "

source: The email address you used to register with {platform_name}
ar: عنوان البريد الإلكتروني الذي استخدمته لإنشاء حسابك على {platform_name}

source: Password
ar: كلمة المرور

source: Remember me
ar: تذكُّر بياناتي

source: This is what you will use to login.
ar: يستخدم لعملية تسجيل الدخول

source: Confirm Email
ar: تأكيد البريد الإلكتروني

source: This name will be used on any certificates that you earn.
ar: سيستخدم هذا الاسم في أيّ شهادة تحصل عليها.

source: The name that will identify you in your courses. It cannot be changed later.
ar: الاسم الذي سيحدد هويتك في الدروات التعليمية. لا يمكن تغييره لاحقًا.

source: Highest level of education completed
ar: أعلى درجة أكاديمية حصلت عليها

source: Year of birth
ar: سنة الميلاد

source: Country or Region of Residence
ar: بلد أو منطقة الإقامة

source: The country or region where you live.
ar: البلد أو المنطقة التي تعيش فيها.

source: Terms of Service and Honor Code
ar: شروط الخدمة وميثاق الشرف الأكاديمي

source: I agree to the {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}
ar: أوافق على {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end}

source: You must agree to the {platform_name} {terms_of_service}
ar: تجب الموافقة على {terms_of_service} الخاصة بـ{platform_name}.

source: By creating an account with {platform_name}, you agree to abide by our {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} and agree to our {privacy_policy_link_start}Privacy Policy{privacy_policy_link_end}.
ar: بإنشاءك حساباً على منصة {platform_name}, أنت توافق على الالتزام بـ {platform_name} {terms_of_service_link_start}{terms_of_service}{terms_of_service_link_end} الخاصّة بالمنصة، وتوافق أيضاً على {privacy_policy_link_start}Privacy Policy{privacy_policy_link_end}.

source: I agree to the {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}
ar: أوافق على {platform_name} {tos_link_start}{terms_of_service}{tos_link_end}

source: I agree to receiving emails from Edraak team about product updates, recommended courses for me, and news
ar: أوافق على استلام رسائل من فريق إدراك بخصوص تحديثات البرامج، والمساقات المقترحة، والأخبار الجديدة

source: System maintenance in progress. Please try again later.
ar: يجري عمل صيانة للنظام، الرجاء المحاولة لاحقاً.

source: Delete failed for user preference '{preference_key}'.
ar: فشل حذف تفضيل المستخدِم لـ '{preference_key}'.

source: Preference '{preference_key}' cannot be set to an empty value.
ar: لا يمكن ضبط التفضيل '{preference_key}' بقيمة فارغة.

source: Invalid user preference key '{preference_key}'.
ar: مفتاح التفضيل '{preference_key}' للمستخدم غير صالح.

source: Value '{preference_value}' is not valid for user preference '{preference_key}'.
ar: القيمة '{preference_value}' غير صالحة لتفضيل المستخدم '{preference_key}'.

source: Value '{preference_value}' not valid for preference '{preference_key}': Not in timezone set.
ar: القيمة '{preference_value}' غير صالحة للتفضيل '{preference_key}': ليست في المنطقة الزمنية المضبوطة.

source: Value '{preference_value}' is not a valid time zone selection.
ar: القيمة "{preference_value}" غير صالحة كخيار منطقة زمنية.

source: Save failed for user preference '{key}' with value '{value}'.
ar: فشل حفظ القيمة '{value}' كتفضيل '{key}' للمستخدم.

source: No data provided for user preference update
ar: لم تتوفّر أيّ بيانات لتحديث تفضيل المستخدم

source: Hello %(full_name)s,
ar: مرحباً%(full_name)s

source: We received a deletion request for your account on %(platform_name)s. We're sorry to see you go!
ar: لقد تلقينا طلب حذف حسابك على منصة %(platform_name)s نأسف لمغادرتك منصتنا.

source: Your account will be deleted permanently in 3 weeks. Account deletion, including removal from email lists, may take a few weeks to fully process through our system. If you want to opt-out of emails before then, please unsubscribe from the footer of any email.
ar: سيتم حذف حسابك نهائياً خلال ثلاثة أسابيع . يرجى الملاحظة: حذف حسابك وبياناتك الشخصية دائم ولا يمكن التراجع عنه. لن تتمكن منصة إدراك من استعادة حسابك أو البيانات التي تم حذفها.

source: If you'd like to recover your account go ahead and <a href="%(reset_password_link)s">reset your password</a>, that'll cancel the account deletion request.
ar: في حال كنت ترغب باسترجاع حسابك يرجى الضغط على الرابط وتقديم <a href="%(reset_password_link)s">طلب تغيير كلمة السر</a>

source: If you did not initiate this request, please contact %(contact_email)s.
ar: بمجرد حذف حسابك ، لن تتمكن من استخدامه لأخذ دورات تدريبية على تطبيقات إدراك أو edraak.org أو أي موقع آخر تستضيفه إدراك. قد تفقد أيضًا الوصول إلى الشهادات الموثّقة وبيانات اعتماد البرنامج الأخرى مثل شهادات التخصصات إذا لم تقم بإرسال هذا الطلب ، فيرجى الاتصال بنا %(contact_email)s.

source: Best, %(platform_name)s
ar: نتمنى لك كل خير،%(platform_name)s

source: If you'd like to recover your account go ahead and reset your password (%(reset_password_link)s), that'll cancel the account deletion request.
ar: في حال كنت ترغب باسترجاع حسابك يرجى الضغط على الرابط ادناه وتقديم طلب تغيير كلمة السر: %(reset_password_link)s

source: Your Account Has Been Queued For Deletion
ar: حسابك في قائمة الانتظار للحذف

source: Dismiss
ar: رفض العملية

source: The course key for the course we would like to be auto-cohorted.
ar: مفتاح المساق الذي ترغب بجعله يتشعب تلقائيًّا.

source: Oauth client name of video pipeline service.
ar: اسم عميل OAuth لخدمة video pipeline

source: Username created for Video Pipeline Integration, e.g. veda_service_user.
ar: تم إنشاء اسم المستخدم لـ Video Pipeline Integration ، على سبيل المثال veda_service_user.

source: Force On
ar: تفعيل

source: Force Off
ar: إيقاف

source: This value is invalid.
ar: هذة القيمة غير صالحة.

source: This field is not editable
ar: هذا الحقل غير قابل للتعديل

source: %(min_score)s is not a valid grade percentage
ar: %(min_score)s ليست نسبة علامة صالحة

source: Gating milestone for {usage_key}
ar: تقييد الإنجاز الهام من أجل {usage_key}

source: License
ar: الترخيص

source: A license defines how the contents of this block can be shared and reused.
ar: يُحدِّد الترخيص كيف يمكن مشاركة محتويات هذه الكتلة وإعادة استخدامها.

source: Category
ar: الفئة

source: Week 1
ar: الأسبوع الأول

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: اسم فئة للمناقشات. يظهر هذا الاسم على الجانب الأيسر من منتدى المناقشات للمساق.

source: Subcategory
ar: فئة فرعية

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: اسم الفئة الفرعية في المناقشات. يظهر هذا الاسم في الجانب الأيسر من منتدى المناقشات للمساق.

source: You are not signed in. To view the discussion content, {sign_in_link} or {register_link}, and enroll in this course.
ar: أنت غير مسجل الدخول.للاطلاع على مواضيع النقاش،{sign_in_link} او {register_link}، ثم سجل في المساق

source: Updates
ar: التحديثات

source: Reviews
ar: المراجعات

source: {sign_in_link} or {register_link} and then enroll in this course.
ar: {sign_in_link} أو {register_link} ثم سجّل في المساق.

source: Sign in
ar: تسجيل الدخول

source: {open_enroll_link}Enroll now{close_enroll_link} to access the full course.
ar: {open_enroll_link}سجّل الآن{close_enroll_link} للوصول إلى المساق كاملا.

source: Welcome to {course_display_name}
ar: مرحبا بك في {course_display_name}

source: To start, set a course goal by selecting the option below that best describes your learning plan. {goal_options_container}
ar: للبدء، حدد هدف المساق من خلال تحديد الخيار أدناه الذي يصف خطة التدريس بشكل أفضل. {goal_options_container}

source: Set goal to: {choice}
ar: تعيين الهدف إلى: {choice}

source: Set goal to: {goal_text}
ar: تعيين الهدف إلى: {goal_text}

source: Enrollment in {course_title} was not complete.
ar: لم تُستكمل عملية تسجيلك في المساق {course_title}

source: If you have concerns about sharing your data, please contact your administrator at {enterprise_customer_name}.
ar: إن كنت قلقاً حيال مشاركة بياناتك، فرجاءً تواصل مع المسؤول عنك على {enterprise_customer_name}.

source: Thank you for joining {platform_name}. Just a couple steps before you start learning!
ar: شكرا لك للانضمام ل {platform_name}. خطوات قليلة فقط يجب ان تقوم بها قبل أن تبدأ عملية التعلم

source: Continue
ar: استمر

source: Welcome to the new learner profile page. Your full profile now displays more information to other learners. You can instead choose to display a limited profile. {learn_more_link_start}Learn more{learn_more_link_end}
ar: مرحبا بك في صفحة الملف الشخصي للطالب الجديدة. يعرض ملفك الشخصي الآن المزيد من المعلومات للطلاب الآخرين. يمكنك بدلا من ذلك اختيار عرض ملف تعريف محدود. {learn_more_link_start}مزيد من المعلومات{learn_more_link_end}

source: Remember when you enrolled in %(course_name)s, and other courses on edX.org? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر عندما قمت بالتسجيل في %(course_name)s وغيرها من المساقات على edX.org؟ نحن لم ننسى وإننا لسعداء بوجودك معنا! تعال وشاهد ما يتعلمه الآخرون.

source: Remember when you enrolled in %(course_name)s on edX.org? We do, and we’re glad to have you! Come see what everyone is learning.
ar: هل تذكر عندما قمت بالتسجيل في %(course_name)s على edX.org؟ نحن لم ننسى وإننا لسعداء بوجودك معنا! تعال وشاهد ما يتعلمه الآخرون.

source: Course team user does not exist
ar: اسم المستخدم لفريق المساق غير موجود

source: The groups in this configuration can be mapped to cohorts in the Instructor Dashboard.
ar: يمكن نقل المجموعات على الهيئة هذه إلى شعب ضمن واجهة المدرّس.

source: Content Groups
ar: مجموعات المحتوى

source: invalid JSON
ar: ملف JSON غير صالح

source: must have name of the configuration
ar: يجب أن يكون لديك اسم للإعدادات

source: must have at least one group
ar: يجب أن تكون لديك مجموعة واحدة على الأقل

source: Invalid course update id.
ar: معرِّف تحديث المساق غير صالح.

source: Course update not found.
ar: لم يُعثَر على تحديث المساق.

source: Could not index item: {}
ar: تعذَّرت فهرسة العنصر: {}

source: General indexing error occurred
ar: حدث خطأ عام في الفهرسة

source: (Unnamed)
ar: (غير مسمّى)

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
ar: دليل GIT_REPO_EXPORT_DIR غير محدّد، أو أنَّ المسار {0} غير موجود، لذلك يُرجى إنشاؤه، أو ضبط إعدادات مسار آخر له GIT_REPO_EXPORT_DIR.

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
ar: مستودع Git الذي يشير إليه الرابط غير صالح للكتابة. من المتوقّع أن يشبه التالي: git@github.com:mitocw/edx4edx_lite.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
ar: في حال استخدام روابط http، يجب ذكر اسم المستخدم وكلمة المرور في الرابط، فيما يشبه: https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
ar: تعذّر تحديد الفرع؛ المستودع في وضعية الرأس المفصول

source: Unable to update or clone git repository.
ar: تعذّر تحديث أو استنساخ مستودع git.

source: Unable to export course to xml.
ar: تعذّر تصدير المساق إلى xml.

source: Unable to configure git username and password
ar: تعذّر ضبط إعدادات اسم المستخدم وكلمة المرور لـ git

source: Unable to commit changes. This is usually because there are no changes to be committed
ar: تعذّر إيداع التغييرات. ويُعزى هذا عادةً إلى عدم وجود تغييرات ليتم إيداعها

source: Unable to push changes. This is usually because the remote repository cannot be contacted
ar: تعذّر عمل push للتغييرات. ويحدث هذا عادةً بسبب عدم إمكانية الاتصال بالمستودع البعيد.

source: Bad course location provided
ar: موقع المساق الذي قدمته غير صحيح

source: Missing branch on fresh clone
ar: هناك فرع ناقص على النسخة الجديدة

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
ar: خذ المساق المحدّد وحاول أن تصدّره إلى مستودع git. يجب أن يكون مجلد المساق أصلًا مستودع git. الاستخدام: git_export <course_loc> <git_url>

source: Unknown User ID: {0}
ar: رقم مستخدم غير معروف: {0}

source: Permission denied
ar: الصلاحية مرفوضة

source: We only support uploading a .tar.gz file.
ar: ندعم تحميل ملفّات بصيغة tar.gz. فقط.

source: Tar file not found
ar: لم يتم العثور على ملف بصيغة Tar

source: Unsafe tar file. Aborting import.
ar: ملف بصيغة tar غير آمن. جارٍ إيقاف عملية الاستيراد.
