Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Cannot find user with username {username} - {error}
ar: تعذّر إيجاد المستخدم الذي يحمل اسم المستخدم {username} - خطأ {error}

source: Deleted user {username}
ar: حُذِف المستخدم {username}

source: Statistic
ar: إحصائية

source: Value
ar: القيمة

source: Site statistics
ar: إحصائيات الموقع

source: Total number of users
ar: العدد الإجمالي للمستخدمين

source: Courses loaded in the modulestore
ar: تم تحميل المساقات في مخزن الوحدات

source: username
ar: اسم المستخدم

source: email
ar: البريد الإلكتروني

source: Repair Results
ar: نتائج الإصلاح

source: Create User Results
ar: أنشئ نتائج المستخدم

source: Delete User Results
ar: احذف نتائج المستخدم

source: The git repo location should end with '.git', and be a valid url
ar: يجب أن ينتهي موقع مستودع نظام GIT باللاحقة ’git.‘ وأن يكون عنوانًا صالحًا.

source: Added Course
ar: تمّت إضافة المساق

source: Course Name
ar: اسم المساق

source: Directory/ID
ar: الدليل/المُعرِّف

source: Git Commit
ar: إيداع Git

source: Last Change
ar: التغيير الأخير

source: Last Editor
ar: المحرّر الأخير

source: Information about all courses
ar: معلومات عن جميع المساقات

source: Error - cannot get course with ID {0}<br/><pre>{1}</pre>
ar: خطأ - تعذّر الوصول إلى المساق الذي يحمل المعرِّف {0}<br/><pre>{1}</pre>

source: Deleted
ar: تمّ الحذف

source: course_id
ar: معرِّف المساق

source: # enrolled
ar: # مسجّل

source: # staff
ar: # طاقم المساق

source: instructors
ar: المدرّسون

source: Enrollment information for all courses
ar: معلومات التسجيل لجميع المساقات

source: role
ar: الدور

source: full_name
ar: الاسم الكامل

source: %(comment_username)s replied to <b>%(thread_title)s</b>:
ar: %(comment_username)s ردّ على <b>%(thread_title)s</b>:

source: View discussion
ar: استعراض المناقشة

source: Response to %(thread_title)s
ar: استجابة ل%(thread_title)s

source: Title can't be empty
ar: لا يمكن ترك العنوان فارغًا

source: Body can't be empty
ar: لا يمكن ترك المحتوى فارغًا

source: Topic doesn't exist
ar: الموضوع غير موجود

source: Comment level too deep
ar: مستوى التعليق متفرِّع جدًّا

source: Error uploading file. Please contact the site administrator. Thank you.
ar: حدث خطأ أثناء محاولة تحميل الملف. يُرجى الاتصال بمشرف الموقع، وشكرًا.

source: Good
ar: جيّد

source: Brought to you by
ar: مقدم من

source: In Sponsorship with
ar: بدعم من

source: COURSE CERTIFICATE
ar: شهادة المساق

source: Issued {date}
ar: صدرت {date}

source: Verify the authenticity of this certificate at
ar: تحقق من صحة هذه الشهادة في

source: CERTIFICATE OF COMPLETION
ar: شهادة إتمام مساق

source: This is to certify that
ar: تم منح شهادة إتمام المساق هذه إلى

source: Successfully completed
ar: لإتمام المساق التالي بنجاح

source: Section Number *
ar: رقم الشعبة *

source: Full Name in Arabic *
ar: الاسم الكامل باللغة العربية *

source: Enter your full name that you use at the university in Arabic.
ar: أدخل اسمك الكامل كما هو مكتوب في سجلاتك الجامعية باللغة العربية.

source: The name you have entered is too short, please double check.
ar: الاسم الذي ادخلته قصيرٌ جداً، يرجى التأكد منه.

source: The student university ID you have entered is too long, please double check.
ar: الرقم الجامعي الذي أدخلته طويل جداً، يرجى التأكد منه.

source: Student University ID *
ar: الرقم الجامعي للطالب *

source: Enter the full student university ID e.g. 201311318.
ar: أدخل الرقم الجامعي كاملاً، مثال: 201311318.

source: The student university ID must only consist of numbers, letters and dashes.
ar: الرقم الجامعي يجب أن يتكون من الحروف الإنجليزية والأرقام والشرطات (-) فقط.

source: The student university ID you have entered is too short, please double check.
ar: الرقم الجامعي الذي أدخلته قصير جداً، يرجى التأكد منه.

source: Full Name in Arabic
ar: الاسم الكامل باللغة العربية

source: Email
ar: البريد الإلكتروني

source: YYYY-MM-DD
ar: يوم-شهر-سنة

source: Default Group
ar: المجموعة الافتراضية

source: Student University ID
ar: الرقم الجامعي

source: Registration End Date
ar: الموعد النهائي لتسجيل معلومات الطلاب

source: Terms and Conditions
ar: الشروط والأحكام

source: University ID
ar: الرقم الجامعي

source: EdxNotes Service is unavailable. Please try again in a few minutes.
ar: خدمة ’EdxNotes‘ غير متوفّرة حاليًّا. تُرجى إعادة المحاولة بعد بضع دقائق.

source: Invalid JSON response received from notes api.
ar: تم استلام رد ’JSON‘ غير صالح من واجهة برمجة التطبيقات الخاصة بالملاحظات.

source: Incorrect data received from notes api.
ar: استُلِمَت بياتان غير صحيحة من واجهة برمجة التطبيقات الخاصة بالملاحظات.

source: No endpoint was provided for EdxNotes.
ar: لم تُحدَّد نقطة انتهاء لـEdxNotes.

source: Notes
ar: ملاحظات

source: API key for accessing Sailthru.
ar: مفتاح API للوصول إلى Sailthru.

source: API secret for accessing Sailthru.
ar: سرّ API للوصول إلى Sailthru.

source: Sailthru list name to add new users to.
ar: اسم قائمة Sailthru لإضافة مستخدمين جدد إليها.

source: Sailthru connection retry interval (secs).
ar: مهلة إعادة محاولة الاتصال Sailthru (بالثواني).

source: Sailthru maximum retries.
ar: العدد الأقصى لإعادة محاولة Sailthru.

source: Sailthru template to use on welcome send.
ar: قالب Sailthru لاستخدامه في إرسال الترحيب.

source: Sailthru template to use on abandoned cart reminder. Deprecated.
ar: قالب Sailthru لاستخدامه في تذكير سلة متروكة. أثريّ.

source: Sailthru minutes to wait before sending abandoned cart message. Deprecated.
ar: مهلة الانتظار بالدقائق قبل إرسال رسالة سلة Sailthru مهجورة . أثريّ.

source: Sailthru send template to use on enrolling for audit.
ar: قالب رسائل Sailthru الصادرة لاستخدامه في التسجيل كمستمع.

source: Sailthru send template to use on passed ID verification.
ar: قالب رسائل Sailthru الصادرة لاستخدامه في حال نجاح التحقق من الهوية.

source: Sailthru send template to use on failed ID verification.
ar: قالب رسائل Sailthru الصادرة لاستخدامه في حال فشل التحقق من الهوية.

source: Sailthru send template to use on upgrading a course. Deprecated
ar: قالب الرسائل الصادرة من Sailthru التي ستستخدم فيما يتعلق بالتسجيل للحصول على شهادة موثقة. (هذا الخيار أثريّ)

source: Sailthru send template to use on purchasing a course seat. Deprecated
ar: قالب رسائل Sailthru الصادرة لاستخدامه في دفع رسوم مقعد في المساق. أثريّ

source: Use the Sailthru content API to fetch course tags.
ar: استخدام API لمحتوى Sailthru لجلب إشارات المساق.

source: Number of seconds to cache course content retrieved from Sailthru.
ar: مدة الحفظ المؤقت لمحتوى المساق الذي تم الحصول عليه من Sailthru بالثواني.

source: Cost in cents to report to Sailthru for enrolls.
ar: التكلفة بالسنت لإبلاغ Sailthru بعدد المسجلين.

source: Optional lms url scheme + host used to construct urls for content library, e.g. https://courses.edx.org.
ar: نظام lms url الاختياري + المضيف المستخدم في بناء عناوين url لمكتبة المحتوى، على سبيل المثال، https://courses.edx.org.

source: Number of seconds to delay the sending of User Welcome email after user has been created
ar: عدد الثواني لتأخير إرسال البريد الإلكتروني للترحيب بالعضو الجديد بعد إنشاءه.

source: The number of seconds to delay/timeout wait to get cookie values from sailthru.
ar: عدد الثواني لتأخير/مهلة الانتظار للحصول على قيم ملف تعريف الارتباط من Sailthru.

source: {platform_name} Staff
ar: طاقم {platform_name}

source: Course Staff
ar: طاقم المساق

source: Staff
ar: الطاقَم

source: Used Registration Code
ar: رمز تسجيل المُستَخدَم

source: Credit Card - Individual
ar: بطاقة بنكية - للأفراد

source: manually enrolled by username: {username}
ar: سُجّل يدويًا عبر اسم المستخدم: {username}

source: Manually Enrolled
ar: مسجَّل يدويًّا

source: Data Integrity Error
ar: خطأ في سلامة البيانات

source: TBD
ar: سيُحدَّد لاحقًا

source: Proctored Exam Review: {review_status}
ar: معاينة الامتحان المراقب: {review_status}

source: A proctored exam attempt for {exam_name} in {course_name} by username: {student_username} was reviewed as {review_status} by the proctored exam review provider.
ar: محاولة امتحان مُراقب لـ {exam_name} في {course_name} لاسم المستخدم: لقد تمت مراجعة {student_username} باعتباره {review_status} من قبل مزود معاينة الامتحان المُراقب.

source: Your Platform Insights
ar: رؤية المنصة هنا

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below.
ar: يتم الآن إنشاء التقرير {report_type}. لعرض حالة التقرير، انظر المهام المعلقة أدناه.

source: User does not exist.
ar: المستخدم غير موجود.

source: Found a conflict with given identifier. Please try an alternative identifier
ar: وجد تعارضًا مع المعرف المحدد. يرجى محاولة استخدام معرف اخر

source: Make sure that the file you upload is in CSV format with no extraneous characters or rows.
ar: تأكّد من أنّ الملف الذي ترفعه بصيغة "CSV" دون أيّة رموز أو صفوف دخيلة.

source: Could not read uploaded file.
ar: تعذّرت قراءة الملف المرفوع.

source: Data in row #{row_num} must have exactly four columns: email, username, full name, and country
ar: يجب أن تكون البيانات في السطر #{row_num} موزّعة على أربعة أعمدة بالضبط: البريد الإلكتروني، واسم المستخدم، والاسم الكامل، والبلد

source: Invalid email {email_address}.
ar: عنوان بريد إلكتروني {email_address} غير صالح.

source: An account with email {email} exists but the provided username {username} is different. Enrolling anyway with {email}.
ar: يوجد حساب له البريد الإلكتروني {email}، إلّا أنّ اسم المستخدم المُدخَل {username} مختلف. يجري التسجيل على أيّة حال عبر البريد الإلكتروني {email}.

source: File is not attached.
ar: لم يُرفَق الملف.

source: Username {user} already exists.
ar: اسم المستخدم {user} موجود مسبقًا.

source: Error '{error}' while sending email to new user (user email={email}). Without the email student would not be able to login. Please contact support for further information.
ar: حدث الخطأ '{error}' أثناء إرسال بريد إلكتروني إلى المستخدم الجديد (user email={email}). لن يتمكّن الطالب من تسجيل الدخول دون البريد الإلكتروني. يُرجى الاتصال بفريق الدعم للحصول على مزيد من المعلومات.

source: problem responses
ar: إجابات المسائل

source: Could not find problem with this location.
ar: تعذّر إيجاد مسألة في هذا الموقع.

source: Invoice number '{num}' does not exist.
ar: الفاتورة رقم '{num}' غير موجودة.

source: The sale associated with this invoice has already been invalidated.
ar: سبق أن أُلغِيَت عملية البيع المرتبطة بهذه الفاتورة.

source: Invoice number {0} has been invalidated.
ar: أُلغِيَت الفاتورة رقم {0}.

source: This invoice is already active.
ar: سبق تفعيل هذه الفاتورة.

source: The registration codes for invoice {0} have been re-activated.
ar: أُعيد تفعيل رموز التسجيل الخاصة بالفاتورة رقم {0}.

source: CourseID
ar: معرِّف المساق

source: Certificate Type
ar: نوع الشهادة

source: Total Certificates Issued
ar: إجمالي عدد الشهادات الصادرة

source: Date Report Run
ar: تاريخ تشغيل عملية إعداد التقرير

source: enrolled learner profile
ar: الملف الشخصي للطالب الملتحق

source: User ID
ar: رقم المستخدم

source: Language
ar: اللغة

source: Location
ar: الموقع

source: Birth Year
ar: سنة الميلاد

source: Gender
ar: الجِنس

source: Level of Education
ar: المستوى التعليمي

source: Mailing Address
ar: العنوان البريدي

source: Goals
ar: الأهداف

source: Enrollment Mode
ar: وضع التسجيل

source: Verification Status
ar: حالة التوثيق

source: Cohort
ar: شعبة

source: Team
ar: الفريق

source: City
ar: المدينة

source: Country
ar: البلد

source: enrollment
ar: التسجيل

source: The file must contain a 'cohort' column containing cohort names.
ar: يجب أن يحوي الملف عمودًا بعنوان ’cohort‘ وفيه أسماء الشُعب.

source: The file must contain a 'username' column, an 'email' column, or both.
ar: يجب أن يحوي الملف عمود ’اسم المستخدم‘، أو ’البريد الإلكتروني‘، أو كليهما.

source: Coupon Code
ar: رمز القسيمة

source: Course Id
ar: رقم المساق

source: % Discount
ar: النسبة المئوية للخصم

source: Description
ar: الوصف

source: Expiration Date
ar: تاريخ انتهاء الصلاحية

source: Is Active
ar: فعّال

source: Code Redeemed Count
ar: عدد الرموز المسترَدّة

source: Total Discounted Seats
ar: إجمالي عدد المقاعد الحاصلة على خصم

source: Total Discounted Amount
ar: إجمالي المبلغ المخصوم

source: detailed enrollment
ar: تسجيل مفصل

source: executive summary
ar: ملخص تنفيذي

source: survey
ar: إستبيان

source: proctored exam results
ar: نتائج الإمتحان المراقب

source: Could not parse amount as a decimal
ar: تَعذَّر إعراب القيمة كعدد عشري

source: Unable to generate redeem codes because of course misconfiguration.
ar: تعذّر توليد رموز الاسترداد نتيجة خطأ في ضبط إعدادات المساق.

source: pdf download unavailable right now, please contact support.
ar: تنزيل pdf غير متاح حاليًّا، يُرجى التواصل مع قسم الدعم,

source: Module does not exist.
ar: الوحدة غير موجودة.

source: An error occurred while deleting the score.
ar: حدث خطأ أثناء حذف العلامة.

source: Course has no entrance exam section.
ar: لم يتم تعين اختبار قبول لهذا المساق.

source: all_students and unique_student_identifier are mutually exclusive.
ar: لا يمكن استخدام قيّم كل من all_students و unique_student_identifier في الوقت نفسه.

source: all_students and delete_module are mutually exclusive.
ar: لا يمكن استخدام قيّم كل من all_students وdelete_module في الوقت نفسه.

source: Requires instructor access.
ar: يتطلّب صلاحيات الوصول المُعطاة للمدرّس.

source: Course has no valid entrance exam section.
ar: لم يُعيّن للمساق قسم خاص بامتحان القبول.

source: All Students
ar: جميع الطلّاب

source: Cannot rescore with all_students and unique_student_identifier.
ar: لا يمكن إعادة التقييم باستخدام all_students و unique_student_identifier.

source: ORA data
ar: بيانات ORA

source: grade
ar: الدرجة

source: problem grade
ar: درجة المسألة

source: Successfully changed due date for student {0} for {1} to {2}
ar: نجح تغيير تاريخ الاستحقاق للطالب {0} من {1} إلى {2}

source: Successfully removed invalid due date extension (unit has no due date).
ar: نجح إلغاء عملية تمديد الموعد النهائيّ الغير صالح للتسليم (لم يُحدّد موعد تسليم للوحدة).

source: Successfully reset due date for student {0} for {1} to {2}
ar: نجحت إعادة ضبط الموعد النهائي للتسليم للطالب {0} من {1} إلى {2}

source: This student (%s) will skip the entrance exam.
ar: سيتخطّى الطالب (%s) امتحان القبول.

source: This student (%s) is already allowed to skip the entrance exam.
ar: سبق أن سُمِح للطالب (%s) بتخطّي امتحان القبول.

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
ar: بدأت مهمّة إعداد الشهادات لجميع الطلّاب في هذا المساق. يمكنك متابعة حالة مهمّة هذا الإعداد في قسم ’المهام قيد الانتظار‘.

source: Please select one or more certificate statuses that require certificate regeneration.
ar: يُرجى اختيار واحدة على الأقل من حالات الشهادة التي تتطلّب إعادة إنشائها.

source: Please select certificate statuses from the list only.
ar: يُرجى اختيار حالات الشهادة من القائمة فقط.

source: Certificate regeneration task has been started. You can view the status of the generation task in the "Pending Tasks" section.
ar: بدأت مهمّة إعادة إنشاء الشهادة. يمكنك متابعة حالة المهمّة هذه في قسم ’المهام القيد الانتظار‘.

source: Student (username/email={user}) already in certificate exception list.
ar: عذرًا، لقد أُدرج الطالب (ذو الاسم او البريد الإلكتروني {user}) سابقًا ضمن قائمة الاستثناءات.

source: Certificate exception (user={user}) does not exist in certificate white list. Please refresh the page and try again.
ar: عذرًا، لا يوجد مستخدم ذو استثناء متعلق بالشهادة بالاسم {user} في اللائحة البيضاء للشهادات. يُرجى تحديث الصفحة والمحاولة مرة أخرى.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
ar: حقل اسم الطالب/عنوان البريد الإلكتروني مطلوب ولا يمكن تركه فارغًا. يُرجى ملئ اسم المستخدم/البريد الإلكتروني ومن ثم الضغط على زر "أضف إلى قائمة الاستثناء"

source: The record is not in the correct format. Please add a valid username or email address.
ar: السجل ليس بالصيغة الصحيحة. تُرجى إضافة اسم مستخدم أو عنوان بريد إلكتروني صالِح.

source: {user} does not exist in the LMS. Please check your spelling and retry.
ar: المستخدم {user} غير موجود ضمن بيانات نظام إدارة التعلّم LMS. يُرجى التأكّد من تهجئة الاسم ثم إعادة المحاولة.

source: {user} is not enrolled in this course. Please check your spelling and retry.
ar: المستخدم {user} غير مسجّل في هذا المساق. يٌرجى التأكد من تهجئة الاسم ثم إعادة المحاولة.

source: Invalid data, generate_for must be "new" or "all".
ar: بيانات غير صالحة، يجب أن يكون generate_for "جديد" أو "كل شيء".

source: Certificate generation started for white listed students.
ar: لقد بدأ إعداد شهادات طلّاب اللائحة البيضاء.

source: user "{user}" in row# {row}
ar: المستخدم "{user}" في الصف رقم {row}

source: user "{username}" in row# {row}
ar: المستخدم "{username}" في الصف رقم {row}

source: Certificate of {user} has already been invalidated. Please check your spelling and retry.
ar: سبق أن أُلغيت شهادة المستخدم {user}. يُرجى التأكّد من التهجئة وأعادة المحاولة.

source: Certificate for student {user} is already invalid, kindly verify that certificate was generated for this student and then proceed.
ar: شهادة الطالب {user} غير صالحة أصلًا. لُطفًا، تأكّد من توليد الشهادة لهذا الطالب ثم تابع.

source: Certificate Invalidation does not exist, Please refresh the page and try again.
ar: إلغاء الشهادة غير موجود. يُرجى تحديث الصفحة وإعادة المحاولة.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
ar: حقل اسم المستخدم/البريد الإلكتروني للطالب مطلوب ولا يمكن تركه فارغًا. لطفًا، املأ حقل اسم المستخدم/البريد الإلكتروني ومن ثم اضغط على زر ’الغِ الشهادة‘.

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
ar: لم يُمنح الطالب {student} شهادةً للمساق {course}. يُرجى التأكّد من أن اسم المستخدم/عنوان البريد الإلكتروني للطالب و المساق المُختار صحيحان ثمّ المحاولة مرة أخرى.

source: coupon id is None
ar: لا يوجد معرِّف للقسيمة

source: coupon with the coupon id ({coupon_id}) DoesNotExist
ar: لا توجد قسيمة لها المعرِّف ({coupon_id})

source: coupon with the coupon id ({coupon_id}) is already inactive
ar: سبق أن أُبطل تفعيل القسيمة ذات المعرِّف ({coupon_id})

source: coupon with the coupon id ({coupon_id}) updated successfully
ar: نجح تحديث القسيمة ذات المعرِّف ({coupon_id})

source: The code ({code}) that you have tried to define is already in use as a registration code
ar: سبق أن استُخدم الرمز ({code}) الذي حاولت تعيّينه كرمز تسجيل.

source: Please Enter the Integer Value for Coupon Discount
ar: يُرجى إدخال العدد الصحيح لقيمة خصم القسيمة

source: Please Enter the Coupon Discount Value Less than or Equal to 100
ar: يُرجى إدخال قيمة خصم القسيمة بما لا يزيد عن القيمة 100

source: Please enter the date in this format i-e month/day/year
ar: يُرجى إدخال التاريخ بهذه الصيغة، أي الشهر/اليوم/السنة

source: coupon with the coupon code ({code}) added successfully
ar: نجحت إضافة القسيمة التي تحمل الرمز ({code})

source: coupon with the coupon code ({code}) already exists for this course
ar: سبق استخدام قسيمة تحمل الرمز ({code}) في هذا المساق.

source: coupon id not found
ar: لم يُعثر على معرِّف القسيمة

source: coupon with the coupon id ({coupon_id}) updated Successfully
ar: نجح تحديث القسيمة ذات المعرِّف ({coupon_id})

source: Instructor
ar: المدرِّس

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
ar: لمزيدٍ من المعلومات عن تسجيل الطلّاب ومشاركتهم، تُرجى {link_start}زيارة {analytics_dashboard_name}، منتجنا الجديد لتحليلات المساقات{link_end}.

source: E-Commerce
ar: التجارة الإلكترونية

source: Special Exams
ar: امتحانات خاصّة

source: Certificates
ar: الشهادات

source: Please Enter the numeric value for the course price
ar: يُرجى إدخال قيمة عدّدية لتحديد رسوم المساق

source: CourseMode with the mode slug({mode_slug}) DoesNotExist
ar: لا يوجد وضع مساق باسم ({mode_slug})

source: CourseMode price updated successfully
ar: حُدِّث سعر CourseMode بنجاح

source: Course Info
ar: معلومات المساق

source: Enrollment data is now available in {dashboard_link}.
ar: تتوافر بيانات التسجيل الآن في {dashboard_link}.

source: Membership
ar: العضوية

source: Cohorts
ar: الشُعب

source: Discussions
ar: مناقشات

source: Student Admin
ar: المشرف على الطلّاب

source: Extensions
ar: التمديد

source: Data Download
ar: تنزيل البيانات

source: Analytics
ar: التحليلات

source: Metrics
ar: المقاييس

source: Open Responses
ar: إظهار الردود

source: 0 sent
ar: أُرسل 0

source: {num_emails} sent
ar: لَم يُرسَل شيء

source: {num_emails} failed
ar: لم يفشل شيء

source: Complete
ar: تمّ

source: Incomplete
ar: لم يتمّ

source: The enrollment code ({code}) was not found for the {course_name} course.
ar: لم يُعثَر على رمز التسجيل ({code}) للمساق {course_name}.

source: This enrollment code has been canceled. It can no longer be used.
ar: أُلغيَ رمز التسجيل هذا. لم يعد بالإمكان استخدامه.

source: This enrollment code has been marked as unused.
ar: وُسِم رمز التسجيل هذا كرمز غير مستخدم.

source: The enrollment code has been restored.
ar: تمّت استعادة رمز التسجيل.

source: The redemption does not exist against enrollment code ({code}).
ar: لا تتوفّر ميزة الاسترداد لرمز التسجيل ({code}).

source: Could not find student matching identifier: {student_identifier}
ar: تعذّر العثور على طالب له المعرِّف: {student_identifier}

source: Unable to parse date:
ar: تعذّر إعراب التاريخ:

source: Couldn't find module for url: {0}
ar: تعذّر العثور على الوحدة للرابط: {0}

source: Unit {0} has no due date to extend.
ar: لم يُحدّد للوحدة {0} موعد تسليم لتتمكن من تمديده.

source: An extended due date must be later than the original due date.
ar: يجب أن يكون موعد التسليم الجديد (أي ما بعد التمديد) بعد موعد التسليم القديم.

source: No due date extension is set for that student and unit.
ar: لم يتم تمديد موعد تسليم لذلك الطالب وتلك الوحدة.

source: Full Name
ar: الاسم الكامل

source: Extended Due Date
ar: موعد التسليم بعد التمديد

source: Users with due date extensions for {0}
ar: المستخدمونالذين حصلوا على تمديد مهلة التسليم لـ {0}

source: Due date extensions for {0} {1} ({2})
ar: عمليات تمديد موعد التسليم لـ {0} {1} ({2})

source: Requested task is already running
ar: المهمة المطلوبة قيد التشغيل

source: Error occured. Please try again later.
ar: حدث خطأ. الرجاء معاودة المحاولة في وقت لاحق.

source: The {report_type} report is being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
ar: يتم إنشاء التقرير {report_type}. لعرض حالة التقرير، انظر المهام المعلقة أدناه. ستتمكن من تنزيل التقرير عند اكتماله.

source: This component cannot be rescored.
ar: لا يمكن إعادة تقييم هذا العنصر

source: This component does not support score override.
ar: لا يدعم هذا العنصر عملية تجاوز النقاط المسندة.

source: Scores must be between 0 and the value of the problem.
ar: يجب أن تكون النقاط بين 0 وقيمة المسألة.

source: Not all problems in entrance exam support re-scoring.
ar: لا تدعم جميع مسائل امتحان القبول ميّزة إعادة التقييم.

source: rescored
ar: أُعيد تقييمها

source: overridden
ar: تم التجاوز

source: reset
ar: غُيِّرَت

source: deleted
ar: حُذِفَت

source: emailed
ar: أُرسِلَت

source: graded
ar: قُيِّمت

source: problem distribution graded
ar: قُيّم توزيع المسائل

source: generating_enrollment_report
ar: أُُعدّ تقرير التسجيل

source: certificates generated
ar: أُنشِئَت الشهادات

source: cohorted
ar: شُعِّبَت

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة/العشيرة

source: Company Name
ar: اسم الشركة

source: Title
ar: العنوان

source: Year of Birth
ar: سنة الميلاد

source: Enrollment Date
ar: تاريخ الانضمام

source: Currently Enrolled
ar: مسجَّل حاليًّا

source: Enrollment Source
ar: مصدر التسجيل

source: Manual (Un)Enrollment Reason
ar: سبب التسجيل/إلغاء التسجيل يدويًا

source: Enrollment Role
ar: دور التسجيل

source: List Price
ar: سِعر البيان

source: Payment Amount
ar: قيمة الدفعة
