Repository: Edraak/edraak-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Details &amp; Schedule
ar: التفاصيل والخطة الزمنية

source: Grading
ar: التقييم

source: Course Team
ar: فريق المساق

source: Advanced Settings
ar: الإعدادات المتقدّمة

source: Checklists
ar: قوائم المراجعة

source: Tools
ar: الأدوات

source: Duplicate
ar: استنسِخ

source: Duplicate this component
ar: استنسِخ هذا المكوِّن

source: Move
ar: حرّك

source: Delete this component
ar: احذف هذا المكوِّن

source: Drag to reorder
ar: اسحب لإعادة الترتيب

source: Page Actions
ar: إجراءات الصفحة

source: Open the courseware in the LMS
ar: افتح محتويات المساق في نظام إدارة التعلّم LMS

source: View Live Version
ar: شاهد النسخة الحالية

source: Preview the courseware in the LMS
ar: معاينة محتويات المساق في نظام إدارة التعلّم LMS

source: Adding components
ar: إضافة مكوِّنات

source: Select a component type under {strong_start}Add New Component{strong_end}. Then select a template.
ar: إختر نوع مكوّن من "{strong_start}أضف مكوّنًا جديدًا{strong_end}". ثمّ اختر قالبًا.

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
ar: يُضاف المكوِّن الجديد في أسفل الصفحة أو المجموعة، ثمّ يمكنك تعديله وتغيير مكانه.

source: Editing components
ar: تعديل المكوِّنات

source: Click the {strong_start}Edit{strong_end} icon in a component to edit its content.
ar: انقر على أيقونة {strong_start}تعديل{strong_end} لمكوّن معيّن لتتمكّن من تعديل محتواه.

source: Reorganizing components
ar: إعادة ترتيب المكوِّنات

source: Drag components to new locations within this component.
ar: اسحب المكوِّنات إلى مواقع جديدة ضمن هذا المكوِّن.

source: For content experiments, you can drag components to other groups.
ar: لعمل تجارب على المحتوى، يمكنك سحب المكوِّنات إلى مجموعات أخرى.

source: Working with content experiments
ar: يجري العمل على تجارب المحتوى

source: Confirm that you have properly configured content in each of your experiment groups.
ar: تأكَّد من ضبطك لإعدادات المحتوى في كلٍّ من مجموعات تجاربك كما يجب.

source: Learn more about component containers
ar: اعرف المزيد عن حاويات المكوِّنات

source: Unit Location
ar: موقع الوحدة

source: Location ID
ar: معرِّف الموقع

source: To create a link to this unit from an HTML component in this course, enter "/jump_to_id/<location ID>" as the URL value.
ar: لإنشاء رابط إلى هذه الوحدة من عنصر HTML في هذا المساق، أدخل "/jump_to_id/<location ID>" كقيمة الرابط.

source: Location in Course Outline
ar: الموقع في الخطة الدراسية للمساق

source: Create a Course Rerun of:
ar: أنشئ إعادة طرح لمساق:

source: Create a re-run of a course
ar: أنشئ إعادة طرح لمساق

source: You are creating a re-run from:
ar: أنت بصدد إنشاء إعادة طرح لمساق:

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
ar: أدخل معلومات تعريفية لإعادة الطرح هذه للمساق. ومن الجدير بالملاحظة أنّ المساق الأساسي لا يتأثّر بإعادة الطرح بأي شكل من الأشكال.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
ar: ملاحظة: من المفروض على المؤسّسة، ورقم المساق، ورقم طرح المساق، أن يشكلوا معًا معرّفًا فريدًا لهذا المساق الجديد.

source: Required Information to Create a re-run of a course
ar: المعلومات المطلوبة لإنشاء إعادة طرح لمساق ما

source: e.g. Introduction to Computer Science
ar: مثلًا، مقدّمة في علم الحاسوب

source: The public display name for the new course. (This name is often the same as the original course name.)
ar: الاسم الظاهر للعموم للمساق الجديد. (غالبًا ما يكون هذا الاسم هو نفسه اسم المساق الأساسي.)

source: Organization
ar: المؤسّسة

source: e.g. UniversityX or OrganizationX
ar: مثلًا: الجامعة أو المؤسّسة

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
ar: اسم المؤسّسة الراعية للمساق الجديد. (غالبًا ما يكون هذا الاسم هو نفسه اسم المؤسّسة الأصلي.)

source: Note: No spaces or special characters are allowed.
ar: ملاحظة: لا يُسمح باستخدام المسافات أو الرموز الخاصة.

source: e.g. CS101
ar: مثلًا، CS101

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
ar: الرقم الفريد الذي يحدد المساق الجديد داخل المنظمة. (هذا الرقم سوف يكون نفس رقم المساق الأصلي ولا يمكن تغييره).

source: Course Run
ar: طرح المساق

source: e.g. 2014_T1
ar: مثلًا، 2014_T1

source: The term in which the new course will run. (This value is often different than the original course run value.)
ar: الفترة التي سيجري فيها طرح المساق الجديد. (غالبًا ما تكون هذه القيمة مختلفة عن قيمة طرح المساق الأساسي).

source: Create Re-run
ar: أنشئ إعادة طرح

source: When will my course re-run start?
ar: متى سيبدأ مساقي المعاد طرحه؟

source: The new course is set to start on January 1, 2030 at midnight (UTC).
ar: من المقرّر أن يبدأ المساق الجديد في 1/1/2030 عند منتصف الليل (بالتوقيت العالميّ).

source: What transfers from the original course?
ar: ما الذي ينتقل من المساق الأصليّ؟

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
ar: للمساق الجديد نفس الخطة الدراسية والمحتوى الذان للمساق الأصليّ. ويجري نسخ جميع المسائل، والفيديوهات، والإعلانات، والملفّات الأخرى إلى المساق الجديد.

source: What does not transfer from the original course?
ar: ما الذي لا ينتقل من المساق الأصليّ؟

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
ar: أنت العضو الوحيد في طاقم المساق الجديد. لا يوجد طلّاب مسجّلون في هذا المساق، ولا توجد أي بيانات للطلّاب. كما لا يوجد أي محتوى في المناقشات أو في الويكي.

source: Learn more about Course Re-runs
ar: تعلّم المزيد عن إعادة طرح المساقات

source: Course Updates
ar: تحديثات المساق

source: New Update
ar: تحديث جديد

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
ar: استخدم تحديثات المساق لإعلام الطلّاب بالتواريخ أو الامتحانات المهمّة، وتسليط الضوء على مناقشات معيّنة في المنتديات، والإعلان عن التغييرات المُدخلة على الخطة الزمنية، والردّ على أسئلة الطلّاب. ويمكنك إضافة تحديثات أو تعديلها بلغة HTML.

source: This course was created as a re-run. Some manual configuration is needed.
ar: أُنشِئ هذا المساق كإعادة طرح، ويتطلّب بالتالي ضبط بعض الإعدادات يدويًّا.

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
ar: لا يوجد محتوى مرئيّ للمساق في الوقت الراهن، ولا يوجد متعلمون مسجلون. تأكد من مراجعة وإعادة تعيين كافة التواريخ، بما في ذلك تاريخ بدء المساق؛ إعداد فريق المساق؛ مراجعة تحديثات المساق وغيرها من المحتويات للمواد المؤرخة؛ وتنظيم المناقشات والويكي.

source: Warning
ar: تحذير

source: This course uses features that are no longer supported.
ar: يستخدم هذا المساق مزايا لم تعد مدعومة.

source: You must delete or replace the following components.
ar: يجب حذف أو استبدال المكوِّنات التالية.

source: Unsupported Components
ar: مكوِّنات غير مدعومة

source: Deprecated Component
ar: مكوّنات أثريّة

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
ar: لتجنّب الأخطاء، توصيك {platform_name} بشدّة بأن تُزيل المزايا غير المدعومة من إعدادات المساق المتقدِّمة. ولتفعل هذا، اذهب إلى {link_start}صفحة الإعدادات المتقدِّمة{link_end}، وتحديد إعداد "قائمة الوحدات المتقدِّمة"، ثمّ حذف الوحدات التالية من القائمة.

source: Unsupported Advance Modules
ar: وحدات متقدِّمة غير مدعومة

source: Click to add a new section
ar: انقر لإضافة قسم جديد

source: New Section
ar: قسم جديد

source: Reindex current course
ar: أعِد فهرسة المساق الحالي

source: Reindex
ar: أعِد الفهرسة

source: Collapse All Sections
ar: اخفِ جميع الأقسام

source: Expand All Sections
ar: أظهِر جميع الأقسام

source: Click to open the courseware in the LMS in a new tab
ar: انقر لفتح محتويات المساق في نظام إدارة التعلّم LMS في تبويب جديد

source: View Live
ar: شاهد النسخة الحالية

source: Edit Start Date
ar: عدِّل تاريخ البدء

source: Course Pacing
ar: نوع المساق

source: Self-Paced
ar: مساق دائم

source: Instructor-Paced
ar: مساق محدد الوقت

source: Creating your course organization
ar: أنشئ مؤسّسة المساق الخاصة بك

source: You add sections, subsections, and units directly in the outline.
ar: يمكنك إضافة أقسام، وأقسام فرعية، ووحدات إلى الخطة الدراسية مباشرةً.

source: Create a section, then add subsections and units. Open a unit to add course components.
ar: أَنشِئ قسمًا، ثمّ أضف أقسامًا فرعية ووحدات. وافتح وحدة لإضافة مكوِّنات المساق.

source: Reorganizing your course
ar: إعادة تنظيم مساقك

source: Drag sections, subsections, and units to new locations in the outline.
ar: اسحب الأقسام، والأقسام الفرعية، والوحدات إلى مواقع جديدة في الخطة الدراسيّة.

source: Learn more about the course outline
ar: اعرف المزيد عن الخطة الدراسيّة

source: Setting release dates and grading policies
ar: ضبط تواريخ طرح المساق وسياسات التقييم

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
ar: اختر أيقونة الإعدادات لقسم أو لقسم فرعي لتضبط تاريخ طرحه. وعندما تضبط إعدادات أحد الأقسام الفرعية، يمكنك أيضًا أن تضبط سياسة التقييم وتاريخ التسليم.

source: Learn more about grading policy settings
ar: اعرف المزيد عن إعدادات سياسة التقييم

source: Changing the content learners see
ar: تغيير المحتوى الذي يراه المتعلمون

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
ar: اختر أيقونة النشر لقسم، أو لقسم فرعي، أو لوحدة لتنشر محتوى المسودّة.

source: To make a section, subsection, or unit unavailable to learners, select the Configure icon for that level, then select the appropriate {em_start}Hide{em_end} option. Grades for hidden sections, subsections, and units are not included in grade calculations.
ar: لجعل قسم أو قسم فرعي أو وحدة غير متاحة للمتعلمين، اختر أيقونة الإعدادات لهذا المستوى، ثم حدد خيار "{em_start}إخفاء{em_end}" المناسب. علامات الأقسام والأقسام الفرعية والوحدات المخفية ليست مشمولة في في احتساب العلامة.

source: To hide the content of a subsection from learners after the subsection due date has passed, select the Configure icon for a subsection, then select {em_start}Hide content after due date{em_end}. Grades for the subsection remain included in grade calculations.
ar: لإخفاء محتوى قسم فرعي عن المتعلمين بعد مرور الموعد المحدد للقسم الفرعي، حدد رمز التكوين للقسم الفرعي، ثم اختَر {em_start}اخفِ المحتوى بعد تاريخ التسليم{em_end}. تبقى درجات القسم الفرعي مشمولة في احتساب العلامة.

source: Learn more about content visibility settings
ar: تعلّم المزيد عن إعدادات ظهور المحتوى.

source: Pages
ar: الصفحات

source: New Page
ar: صفحة جديدة

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
ar: ملاحظة: الصفحات مرئية للجميع. فإذا كان المستخدمون يعرفون رابط إحدى الصفحات، يمكنهم رؤية الصفحة حتّى لو لم يكونوا مسجّلين في مساقك أو لم يدخلوا بحسابهم.

source: Show this page
ar: أظهِر هذه الصفحة

source: Show/hide page
ar: أظهِر/اخفِ هذه الصفحة

source: This page cannot be reordered
ar: لا يمكن إعادة ترتيب هذه الصفحة

source: You can add additional custom pages to your course.
ar: يمكنك إضافة المزيد من الصفحات المخصّصة إلى مساقك.

source: Add a New Page
ar: أضِف صفحة جديدة

source: What are pages?
ar: ما هي الصفحات؟

source: Pages are listed horizontally at the top of your course. Default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
ar: ستجد الصفحات مسرودة أفقيًّا في أعلى مساقك، بحيث تُدرَج الصفحات الافتراضية (الصفحة الرئيسية، المساق، المناقشات، الويكي، والتقدُّم)، وتليها الكتب والصفحات المخصّصة التي تنشئها.

source: Custom pages
ar: الصفحات المخصّصة

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
ar: يمكنك أن تنشئ الصفحات المخصّصة وتعدّلها لتزوّد الطلّاب بمحتوى إضافي للمساق. ويمكنك مثلًا أن تنشئ صفحات لسياسة التقييم، وشرائح المساق، ورُزنامة المساق.

source: How do pages look to students in my course?
ar: كيف تبدو الصفحات للطلّاب في مساقي؟

source: Students see the default and custom pages at the top of your course and use these links to navigate.
ar: يرى الطلّاب الصفحات الافتراضية والمخصّصة في أعلى مساقك، ويستخدمون هذه الروابط لتصفّحها.

source: See an example
ar: شاهد مثالًا

source: Pages in Your Course
ar: الصفحات في مساقك

source: Preview of Pages in your course
ar: معاينة الصفحات في مساقك

source: Pages appear in your course's top navigation bar. The default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
ar: تظهر الصفحات في الركن العلوي لشريط التصفّح في مساقك، بحيث تُدرَج الصفحات الافتراضية (الصفحة الرئيسية، والمساق، والمناقشات، والويكي، والتقدم)، تليها الكتب والصفحات المخصّصة.

source: close modal
ar: أغلق النافذة المنبثقة

source: Internal Server Error
ar: خطأ داخلي في الخادم

source: The Page You Requested Page Cannot be Found
ar: تعذر العثور على الصفحة التي طلبتها

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
ar: عُذرًا. لم نتمكن من العثور على صفحة {studio_name} التي تبحث عنها. قد ترغب في العودة إلى صفحة "لوحتي التعليمية" لهذا الاستوديو {studio_name} وإعادة المحاولة. وإذا ما زلت تواجه صعوبات في الوصول إلى ما تريد، يُرجى عدم التردّد في {link_start}التواصل مع فريق دعم{studio_name}{link_end} للحصول على مزيد من المساعدة.

source: The Server Encountered an Error
ar: واجه الخادم خطأً ما

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
ar: عُذرًا. حدثت مشكلة في الخادم أثناء محاولة معالجة طلبك الأخير. قد ترغب في العودة إلى صفحة "لوحتي التعليمية" في {studio_name} وإعادة المحاولة. وإذا ما زلت تواجه صعوبات في الوصول إلى ما تريد، يُرجى عدم التردّد في {link_start}التواصل مع فريق دعم {studio_name}{link_end} للحصول على مزيد من المساعدة.

source: Back to dashboard
ar: العودة إلى لوحتي التعليمية

source: Library Export
ar: تصدير المكتبة

source: Course Export
ar: تصدير المساق

source: About Exporting Libraries
ar: عن تصدير المكتبات

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
ar: يمكنك تصدير المكتبات وتعديلها خارج {studio_name}. يكون الملفّ المصدَّر بصيغة tar.gz. (أي ملف tar. مضغوط ببرنامج GNU Zip) ويحتوي على هيكلية المكتبة ومحتواها. كما يمكنك إعادة استيراد المكتبات التي صدّرتها.

source: About Exporting Courses
ar: عن تصدير المساقات

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
ar: يمكنك تصدير المساقات وتعديلها خارج {studio_name}. يكون الملفّ المصدَّر بصيغة tar.gz. (أي ملف tar. مضغوط ببرنامج GNU Zip) ويحتوي على هيكلية المساق ومحتواه. كما يمكنك إعادة استيراد المساقات التي صدّرتها.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
ar: {em_start}تحذير:{em_end} عندما تُصدِّر مساقًا، فإنّ بعض المعلومات، مثل مفاتيح MATLAB API، وتصاريح معيار التوافقية بين أدوات التعلّم LTI، ونصوص الرموز السرّية للملاحظات التوضيحية، وروابط تخزين الملاحظات التوضيحية، تكون مشمولة ضمن البيانات المصدَّرة. وإذا شاركت ملفاتك المصدَّرة مع الآخرين، فقد تشاركهم ضمنها بعض المعلومات الحسّاسة أو الخاصة بالترخيص.

source: Export My Library Content
ar: تصدير محتوى مكتبتي

source: Export My Course Content
ar: تصدير محتوى مساقي

source: Export Library Content
ar: تصدير محتوى المكتبة

source: Export Course Content
ar: تصدير محتوى المساق

source: Library Export Status
ar: تصدير حالة المكتبة

source: Course Export Status
ar: تصدير حالة المساق

source: Preparing
ar: التحضير

source: Preparing to start the export
ar: التحضير لبدء التصدير

source: Exporting
ar: قيد التصدير

source: Creating the export data files (You can now leave this page safely, but avoid making drastic changes to content until this export is complete)
ar: ملفّات البيانات المصدّرة قيد الإنشاء (يمكنك ترك الصفحة الآن، لكن تجنّب إحداث أيّة تغييرات جذرية على المحتوى حتى تنتهي عملية التصدير)

source: Compressing
ar: الضغط

source: Compressing the exported data and preparing it for download
ar: ضغط البيانات المصدرة وإعدادها للتحميل

source: Success
ar: نجحت العمليّة

source: Your exported library can now be downloaded
ar: مكتبتك المصدّرة جاهزة للتحميل الآن

source: Your exported course can now be downloaded
ar: مساقك المصدّر جاهز للتحميل الآن

source: Download Exported Library
ar: حمّل المكتبة المصدّرة

source: Download Exported Course
ar: حمّل المساق المصدّر

source: Data {em_start}exported with{em_end} your course:
ar: البيانات {em_start}المصدَّرة مع{em_end} مساقك:

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
ar: القيَم من الإعدادات المتقدّمة، بما فيها مفاتيح MATLAB API وتصاريح توافقية أدوات التعلّم LTI

source: Course Content (all Sections, Sub-sections, and Units)
ar: محتوى المساق (جميع الأقسام، والأقسام الفرعية، والوحدات)

source: Course Structure
ar: هيكلية المساق

source: Individual Problems
ar: المسائل المنفردة

source: Course Assets
ar: محتويات المساق

source: Course Settings
ar: إعدادات المساق

source: Data {em_start}not exported{em_end} with your course:
ar: البيانات {em_start}غير المصدَّرة{em_end} مع مساقك:

source: User Data
ar: بيانات المستخدم

source: Course Team Data
ar: بيانات فريق المساق

source: Forum/discussion Data
ar: بيانات المنتدى/المناقشات

source: Why export a library?
ar: ما الهدف من تصدير مكتبة؟

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
ar: قد ترغب في تعديل XML في مكتبتك مباشرةً، أي خارج {studio_name}. وقد ترغب أيضًا في إنشاء نسخة احتياطية من مكتبتك. أو قد ترغب في إنشاء نسخة من مكتبتك بحيث يمكنك استيرادها لاحقًا إلى مكتبة فرعية أخرى ومن ثم تخصيصها.

source: Opening the downloaded file
ar: يجري فتح الملف المنزَّل

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
ar: استخدم برنامج أرشفة لاستخراج البيانات من الملفّ الذي صيغته tar.gz. وتشمل البيانات المستخرَجة ملف library.xml، إضافة إلى المجلدات الفرعية التي تتضمّن محتوى المكتبة.

source: Learn more about exporting a library
ar: اعرف المزيد عن تصدير مكتبة

source: Why export a course?
ar: ما الهدف من تصدير مساق ما؟

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
ar: قد ترغب في تعديل XML في مساقك مباشرةً، أي خارج {studio_name}. وقد ترغب أيضًا في إنشاء نسخة احتياطية من مساقك. أو قد ترغب في إنشاء نسخة من مساقك بحيث يمكنك استيرادها لاحقًا إلى مساق آخَر ومن ثم تخصيصه.

source: What content is exported?
ar: ما هو المحتوى الذي يُصدَّر؟

source: The following content is exported.
ar: هذا المحتوى مُصَدّر

source: Course content and structure
ar: هيكلية ومحتويات المساق

source: Course dates
ar: تواريخ المساق

source: Grading policy
ar: سياسة التقييم

source: Any group configurations
ar: أي من إعدادات المجموعة

source: Settings on the Advanced Settings page, including MATLAB API keys and LTI passports
ar: اعدادات من صفحة الاعدادات المتقدمة،بما فيها مفاتيح MATLAB API وتصاريح توافقية أدوات التعلّم LTI

source: The following content is not exported.
ar: هذا المحتوى غير مصدّر

source: Learner-specific content, such as learner grades and discussion forum data
ar: المحتوى الخاص بالمتعلم مثل:العلامات و منتدى النقاش

source: The course team
ar: فريق المساق

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
ar: استخدم برنامج أرشفة لاستخراج البيانات من الملفّ الذي يحمل امتداد tar.gz. وتشمل البيانات المستخرجة ملف course.xml، إضافة إلى المجلدات الفرعية التي تتضمّن محتوى المساق.

source: Learn more about exporting a course
ar: تعلّم المزيد عن تصدير المساقات

source: Export Course to Git
ar: تصدير المساق إلى Git

source: Export to Git
ar: التصدير إلى Git

source: About Export to Git
ar: عن التصدير إلى Git

source: Use this to export your course to its git repository.
ar: استخدام هذا لتصدّر مساقك إلى مستودع git الخاص به.

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
ar: سيحفّز هذا بعدئذٍ تحديثًا تلقائيًّا للموقع الرئيسي لنظام إدارة التعلّم، وسيحدّث محتويات مساقك المرئية هناك للطلّاب إذا كانت إعدادات عمليات الاستيراد التلقائية لـ git مضبوطة.

source: Export Course to Git:
ar: تصدير المساق إلى Git:

source: giturl must be defined in your course settings before you can export to git.
ar: يجب تحديد رابط git في إعدادات مساقك لكي تتمكّن من التصدير إلى git.

source: Export Failed
ar: فشل التصدير

source: Export Succeeded
ar: نجح التصدير

source: Your course:
ar: مساقك:

source: Course git url:
ar: رابط git للمساق

source: Experiment Group Configurations
ar: إعدادات مجموعة الاختبار

source: This module is disabled at the moment.
ar: هذه الوحدة معطّلة في الوقت الحالي.

source: Enrollment track groups allow you to offer different course content to learners in each enrollment track. Learners enrolled in each enrollment track in your course are automatically included in the corresponding enrollment track group.
ar: المجموعات التي تتّبع مسارات التسجيل تسمح لك بعرض محتوى مختلف للمساق على المتعلّمين في كلّ مساقات التسجيل. المتعلّمون المسجّلون في كل مساقات التسجيل الخاصة بدورتك التدريبية يتمّ إدراجهم بشكل تلقائي ضمن مجموعة متماثلة تتّبع مسار التسجيل.

source: On unit pages in the course outline, you can restrict access to components to learners based on their enrollment track.
ar: تستطيع حصر إمكانية الدخول إلى المكونات على متعلّمين محدّدين بناءً على مسارات التسجيل خاصتهم.

source: You cannot edit enrollment track groups, but you can expand each group to view details of the course content that is designated for learners in the group.
ar: لا تستطيع التعديل على المجموعات التي تتّبع مسار التسجيل، لكنك تستطيع أن توسّع كلّ مجموعة لكي تتمكن من الاطلاع على تفاصيل محتوى المساق التي صُمّم من أجل المتعلّمين ضمن المجموعات.
